[{"filename":"Arrest Warrant of 11 April 2000 (Democratic Republic of the Congo v. Belgium).pdf","shortTitle":"Arrest Warrant (Democratic Republic Of The Congo v. Belgium)","date":"02/14/2002","type":"icj judgement","shortSummary":"The ICJ held that an incumbent foreign minister enjoys full immunity from criminal jurisdiction and inviolability under customary international law while in office, and that issuance and circulation of an international arrest warrant against such a minister violated the immunities of the sending State. The Court found Belgium internationally responsible and ordered it to cancel the warrant and inform authorities to whom it had been circulated.","detailedSummary":"Facts and procedural posture: A Belgian examining judge issued an international arrest warrant (11 April 2000) for the incumbent Congolese Minister for Foreign Affairs, Abdoulaye Yerodia Ndombasi, for alleged grave violations of international humanitarian law. The warrant was transmitted internationally. The DRC brought proceedings against Belgium, claiming the warrant violated the immunity and inviolability of its serving foreign minister. Jurisdiction and scope: The Court found it had jurisdiction and framed the legal question as one of customary international law concerning immunities of incumbent foreign ministers. Core holdings: The Court held that, under customary international law, incumbent Ministers for Foreign Affairs enjoy full immunity from criminal jurisdiction and inviolability for the duration of their office when abroad. This immunity is functional and exists to protect the effective performance of state functions, and therefore does not admit a distinction between ‘official’ and ‘private’ acts or between acts before and during office. The Court found no customary exception to immunity for alleged war crimes or crimes against humanity by an incumbent foreign minister. The Court emphasized that jurisdictional immunities are procedural (bar prosecution before foreign courts) and do not negate substantive criminal responsibility, which may be pursued once immunity no longer applies (e.g., after leaving office) or through appropriate inter-state procedures. Remedies and consequences: The Court concluded that the mere issuance and international circulation of the arrest warrant violated Belgium’s obligations to respect the minister’s immunity and constituted an internationally wrongful act. As satisfaction, the Court required Belgium to cancel the warrant and inform recipient authorities of that cancellation; that measure would restore, as far as possible, the situation that would have existed but for the wrongful act.","keyPoints":["Incumbent foreign ministers enjoy full immunity from criminal jurisdiction and inviolability under customary international law for the duration of their office, regardless of the nature or timing of alleged acts.","Issuance and international circulation of an arrest warrant against an incumbent foreign minister abroad can constitute a breach of the sending State’s rights via violation of immunity and inviolability.","Jurisdictional immunity is procedural and distinct from substantive criminal responsibility; immunity can prevent prosecution while in office but does not erase eventual substantive liability once immunity falls away.","Relief for breach can include declaratory measures and obligations to cancel and notify cancellation of instruments (e.g., arrest warrants) circulated internationally to remedy moral injury and restore the prior situation."]},{"filename":"Julian Assange : Ecuadorian Embassy (London) matter (diplomatic-asylum : embassy-inviolability issues).pdf","shortTitle":"Julian Assange Ecuadorian Embassy Matter","date":"2012–2019","type":"other court case","shortSummary":"Julian Assange sought and received diplomatic asylum in the Embassy of Ecuador in London (2012), remaining there for several years because UK authorities could not lawfully enter the mission to arrest him; the incident exposed tensions between diplomatic inviolability and domestic extradition obligations, and highlighted limits of diplomatic asylum where the receiving State does not recognize it.","detailedSummary":"The Assange case involved Ecuador granting diplomatic asylum to Julian Assange after he entered Ecuador’s embassy in London in 2012 to avoid arrest and extradition to Sweden (and potential onward extradition to the United States). Under the Vienna Convention on Diplomatic Relations, the embassy premises were inviolable and UK police could not lawfully enter without Ecuador’s consent, effectively protecting Assange from immediate arrest while he remained inside. The United Kingdom, however, maintained it had no obligation to recognize diplomatic asylum and was legally obliged to execute extradition measures under domestic law; it also had statutory tools (notably the Diplomatic and Consular Premises Act 1987) that could, in extremis, alter the status of premises. Ecuador refused to surrender Assange, leading to a prolonged diplomatic stalemate and demonstrating that diplomatic asylum (particularly from a non-regional asylum tradition) does not trump the receiving State’s criminal jurisdiction or its choices about protecting or withdrawing inviolability. The case therefore clarifies several practical and legal points: diplomatic inviolability provides physical protection while within mission premises but does not create an automatic right of safe passage through third-State territory; diplomatic asylum granted by a sending State is not binding on the receiving State absent an applicable treaty or special agreement; and the receiving State retains legal measures and political options (including withdrawing recognition of premises, consenting to departure, or prosecuting non-diplomatic actors) to vindicate its criminal jurisdiction. These elements bear directly on Ecuador v. Mexico because they illuminate (1) when sheltering a national in a diplomatic mission may be regarded as an abuse of embassy functions or an impermissible interference in the receiving State’s internal affairs, and (2) the practical limits of asylum claims that a sending State may assert to justify retaining a person on mission premises.","keyPoints":["Diplomatic inviolability protects presence inside mission premises but does not negate the receiving State’s criminal jurisdiction or obligation to enforce domestic law when the sending State refuses cooperation","Diplomatic asylum granted by the sending State is not binding on the receiving State absent treaty consent; recognition and safe passage depend on the receiving State’s consent or applicable asylum instruments","Use of mission premises to shield a person convicted or under valid arrest warrants for common crimes may be viewed as incompatible with the functions of the mission and as interference in internal affairs","Receiving States retain domestic and international-law measures (diplomatic protest, persona non grata, statutory alteration of premises status, refusal of safe conduct) to respond to perceived abuses of inviolability","Assange shows factual and legal thresholds for arguing misuse of an embassy: prolonged sheltering, clear criminal proceedings/convictions at home, refusal to surrender despite requests, and public statements by the sending State can all support a claim of breach of duties under the Vienna Convention and related norms"]},{"filename":"Nicaragua v. Honduras (1988).pdf","shortTitle":"Nicaragua v. Honduras","date":"12/20/1988","type":"icj judgement","shortSummary":"The International Court of Justice held that it had jurisdiction under Article XXXI of the 1948 Pact of Bogotá to adjudicate Nicaragua’s claims against Honduras and addressed a series of jurisdictional and admissibility objections before proceedings were discontinued by the parties’ settlement.","detailedSummary":"In its 1988 decision on jurisdiction and admissibility in Nicaragua v. Honduras the Court concluded that Article XXXI of the Pact of Bogotá conferred jurisdiction independently of unilateral declarations accepting the Court’s compulsory jurisdiction under Article 36(2) of the Statute. The Court rejected Honduras’s arguments that Article XXXI had to be supplemented by an additional declaration of acceptance, and it set aside Honduras’s attempt to make effect of reservations in its 1986 Article 36(2) declaration as barring the Pact-based seisin. The Court also dismissed several admissibility objections raised by Honduras (some general, some derivative of the Pact) and proceeded to permit consideration of the merits; the proceedings were later discontinued after the parties reached a settlement and asked the Court to remove the case from the General List. Key aspects of the judgment include (i) an emphasis on the ordinary meaning and text of Article XXXI and the independence of treaty-based jurisdiction from parties’ Article 36(2) declarations; (ii) refusal to allow reservations to discrete declarations to nullify treaty-based jurisdiction where the treaty itself creates compulsory jurisdiction; and (iii) the Court’s procedure of examining jurisdiction and admissibility at a preliminary stage.","keyPoints":["Confirms that Article XXXI Pact of Bogotá jurisdiction operates independently of Article 36(2) declarations — supports Ecuador’s reliance on the Pact as a standalone basis for ICJ jurisdiction.","Rejects argument that a Pact-based seisin must be 'supplemented' by acceptance declarations or can be nullified by reservations to such declarations — undermines Mexico’s potential reliance on its Article 36(2) declaration or reservations to avoid jurisdiction.","Affirms the Court’s practice of addressing jurisdiction and admissibility at a preliminary stage and dismissing procedural objections that lack textual or legal foundation — useful to counter procedural admissibility challenges by Mexico.","Demonstrates that even where jurisdiction and admissibility are contested, the Court will interpret treaty text according to ordinary meaning and context — strengthens Ecuador’s textualist argument about obligations under the Pact and related conventions.","Shows the Court’s willingness to record discontinuance after parties settle, but crucially only after jurisdictional questions have been authoritatively addressed — reinforces the strategic value of obtaining a preliminary jurisdictional ruling in Ecuador v. Mexico."]},{"filename":"Eritrea v. Ethiopia (Partial Award).pdf","shortTitle":"Eritrea-Ethiopia Claims Commission - Partial Award: Jus Ad Bellum - Ethiopia's Claims 1-8","date":"12/19/2005","type":"other court case","shortSummary":"The Claims Commission found Eritrea liable for an unlawful use of force when Eritrean forces attacked and occupied territory administered by Ethiopia beginning 12 May 1998, holding that self-defence and territorial-claim justifications did not validate that use of force. The Award also clarified jurisdictional limits and evidentiary thresholds for proving a preplanned campaign of attacks.","detailedSummary":"The Partial Award addressed whether Eritrea's military operations of May–June 1998 violated the jus ad bellum. The Commission confirmed its jurisdiction under the parties' agreement to hear claims of violations of international law, rejecting Eritrea's contention that a separate investigative body should decide origins of the conflict. On the merits the Commission held that: (a) the UN Charter's prohibition on the use of force (Art. 2(4)) bars resort to force to settle territorial disputes; a putative territorial claim does not justify armed invasion; (b) Article 51 self-defence requires an armed attack of sufficient scale — localized border clashes between small patrols do not meet that threshold; (c) a State invoking self-defence should report measures to the UN Security Council; (d) Eritrea's large-scale attack beginning 12 May 1998 against Badme and adjacent areas, which were under peaceful Ethiopian administration, was not lawful self-defence and therefore violated Art. 2(4); and (e) Ethiopia's governmental resolution condemning the invasion and demanding withdrawal was not a formal declaration of war. The Commission declined to find Eritrea liable for all subsequent operations as a preplanned coordinated campaign because the evidence did not prove that broader claim. The Commission ordered a damages phase limited to harms resulting from the unlawful attack it identified.","keyPoints":["Jurisdiction: tribunal can adjudicate claims of unlawful use of force even where other factual-origin inquiries were contemplated by separate mechanisms, when parties accept that scope.","Prohibition on force: territorial claims do not justify use of force; States may not resolve border disputes by armed attack.","Self-defence threshold: localized skirmishes and small-unit border clashes do not constitute an 'armed attack' permitting lawful unilateral self-defence under Article 51.","Obligation to report: a State taking measures in self-defence must report to the UN Security Council; failure to do so undermines invocation of lawful self-defence.","Evidence standard for coordinated attack: finding a preplanned, multi-front campaign requires persuasive proof; absence of such proof limits attribution of liability to proven unlawful operations."]},{"filename":"Gabcíkovo-Nagymaros Project (Hungary v. Slovakia, 1997).pdf","shortTitle":"Gabcíkovo-Nagymaros Project (Hungary v. Slovakia)","date":"1993-1998 (Judgment 1997)","type":"icj judgement","shortSummary":"ICJ held that Hungary unlawfully suspended and abandoned works under the 1977 Treaty while Czechoslovakia/Slovakia in part lawfully implemented a provisional solution, and ordered the Parties to negotiate in good faith and to make compensation for damages. The Court determined legal consequences and required negotiation of modalities for implementing its judgment.","detailedSummary":"Background and issues: The Parties submitted a Special Agreement asking the Court to decide whether Hungary was entitled to suspend and abandon works it was to perform under the 1977 Budapest Treaty, whether Czechoslovakia (and later Slovakia) was entitled to implement a so-called “provisional solution” (including damming the Danube), and the legal effects of Hungary's notification of termination. Findings: In its 25 September 1997 Judgment the Court found that Hungary was not entitled to suspend and abandon the works; that Czechoslovakia was entitled to adopt the provisional solution in principle but was not entitled to put the barrage into operation as it did in October 1992; and that Slovakia succeeded to treaty rights and obligations. Remedies and obligations: The Court held that both Parties bore international responsibility for wrongful acts and ordered them to negotiate in good faith, take necessary measures to achieve the Treaty’s objectives, and agreed that each Party must make reparation for damage it caused (Hungary to compensate Slovakia/Czechoslovakia for damage from suspension/abandonment; Slovakia to compensate Hungary for damage from operating the dam). Subsequent procedure: Slovakia later sought an additional judgment to determine implementation modalities; after negotiations over years, proceedings were discontinued in 2017 with both Parties reserving rights under the Special Agreement to request future determinations. Evidentiary note: the Court conducted a rare site visit (1997). Relevance to Ecuador v. Mexico: Gabcíkovo-Nagymaros is useful authority on several points Ecuador can invoke before the Court. First, it underscores that unilateral suspension or termination of treaty obligations (or acts that derogate from another State’s sovereignty or agreed regime) can be wrongful and give rise to State responsibility and obligations to make reparation. That principle supports Ecuador’s claim that Mexico’s use of its mission to shield a national and its purported grant of asylum (derogating from Ecuador’s criminal jurisdiction) are wrongful and attract responsibility. Second, the judgment emphasises the Court’s role in determining legal effects of contested acts and in prescribing remedies and modalities (including negotiation in good faith) — useful for Ecuador’s request that the Court adjudge breaches and prescribe consequences and cooperative measures (including compensation and return/cooperation on law enforcement). Third, the case demonstrates the Court’s willingness to consider successive acts, successor-state arguments, extensive factual records, and to use flexible procedural fact-finding (site visit) — relevant to Ecuador’s presentation of detailed diplomatic exchanges, criminal decisions, and prospective evidence. Finally, the ICJ’s insistence on negotiation in good faith and implementation of judicial decisions supports Ecuador’s argument that Mexico must comply with international obligations, cooperate in anti-corruption enforcement, and remedy the injury caused by its interference.","keyPoints":["Unilateral suspension or derogation from treaty obligations can be unlawful and give rise to State responsibility and reparation","Court can determine legal effects of contested acts and prescribe remedies and modalities, including an obligation to negotiate in good faith","States must respect agreed regimes affecting territorial sovereignty and jurisdiction; wrongful use of measures that derogate from another State’s authority can attract compensation","ICJ will examine detailed factual records and can adopt flexible fact-finding measures (e.g., site visit) to determine complex disputes"]},{"filename":"Convention on Political Asylum (Montevideo, 1933) [Conference of American States].pdf","shortTitle":"Convention On Political Asylum (Montevideo, 1933)","date":"12/26/1933","type":"other document","shortSummary":"Multilateral treaty adopted at Montevideo that restricts diplomatic asylum by prohibiting grants of asylum in legations, warships, military camps or airships to persons accused or convicted of common offenses, and requires their surrender when requested by the local government. The Convention also provides that the determination of whether an offence is political rests with the asylum-offering State.","detailedSummary":"The Convention on Political Asylum (Montevideo, 1933) replaces the relevant Havana Convention provision and establishes clear limits on diplomatic asylum. Article 1 bars States from granting asylum in diplomatic premises, warships, military camps or airships to persons accused of common offences (or sentenced by ordinary courts) and requires that such persons who find refuge in those places be surrendered as soon as requested by the local government. Article 2 provides that the judgment whether an act is a political delinquency is for the State offering asylum to determine. Other provisions clarify that political asylum is humanitarian and non-reciprocal in character (Article 3), address the withdrawal/replacement of diplomatic agents in asylum disputes (Article 4), and govern entry into force, ratification and denunciation mechanics (Articles 5–9). In short, the Montevideo Convention narrowly reserves diplomatic asylum in mission premises for non-common (i.e., political) offences and establishes a duty to surrender persons charged with or convicted of ordinary crimes upon the receiving State’s request.","keyPoints":["Article 1: Prohibits asylum in diplomatic or analogous places for those accused/convicted of common offences and requires surrender upon local government request","Article 2: Leaves determination of political delinquency to the asylum-offering State","Article 3: Frames political asylum as humanitarian and non-reciprocal but notes limits where States do not recognize asylum","Article 4: Allows replacement of diplomatic agents when withdrawal is requested over asylum disputes without necessarily severing relations","Practical effect: the Convention constrains use of diplomatic premises to shield persons from prosecution for ordinary crimes and supports surrender obligations"]},{"filename":"Vienna Convention on Diplomatic Relations, 1961 .pdf","shortTitle":"Vienna Convention On Diplomatic Relations","date":"1961","type":"other document","shortSummary":"The Vienna Convention (1961) codifies rules on diplomatic privileges and immunities, the inviolability of mission premises, and duties of diplomatic agents, including the obligation not to interfere in the internal affairs of the receiving State. Its provisions (in particular Articles 22, 29, 41 and 3) are directly relevant to Ecuador’s claims that Mexico misused its embassy in Quito to shield a national and interfered with Ecuador’s domestic criminal justice processes.","detailedSummary":"The Vienna Convention establishes core rules governing diplomatic missions: premises of a mission are inviolable (Art. 22); diplomatic agents and their residences enjoy personal inviolability and immunity from arrest or detention (Arts. 29–31); missions must respect the laws and regulations of the receiving State and not interfere in its internal affairs (Art. 41); and missions must conduct official business through the receiving State’s foreign ministry (Art. 41(2)). The Convention also limits the permissible use of mission premises to functions consistent with the mission’s role (Art. 41(3)) and requires the receiving State to protect mission premises (Art. 22(2)). In Ecuador v. Mexico, Ecuador alleges that Mexico used its embassy in Quito to shelter Jorge Glas — a convicted Ecuadorian national subject to arrest warrants and ongoing prosecutions — and later announced it was granting him asylum and seeking his removal. Ecuador’s case invokes Article 41 to argue that Mexican diplomats breached their duty not to interfere and used mission premises in a manner incompatible with their functions; Article 22 to show the embassy’s inviolability cannot be converted into a safe haven for obstructing local law enforcement; and Articles 29–31 to distinguish permissible immunities of diplomatic agents from impermissible sheltering of local nationals. Applied to the facts at bar, the Convention supports Ecuador’s arguments that: (1) diplomatic privileges do not authorize a sending State to frustrate the receiving State’s criminal process by shielding persons who are nationals of the receiving State and convicted or indicted for ordinary crimes; (2) use of embassy premises to prevent enforcement of arrest warrants is “incompatible with the functions of the mission” under Art. 41(3); and (3) the duties in Art. 41(1) (respect for laws and non-interference) are separate obligations that can be breached even while diplomatic immunities for accredited agents remain protected. For Model UN/ICJ advocacy, the Vienna Convention provides the primary treaty text to establish Mexico’s obligations and to rebut any argument that diplomatic inviolability or immunity permits sanctuary for third‑country nationals to evade domestic criminal justice. It also supports declaratory relief that Mexico violated its international obligations and helps frame appropriate remedies (e.g., cessation of misuse of premises, assurances against recurrence, cooperation on surrender and mutual legal assistance).","keyPoints":["Article 22 (inviolability of mission premises) prevents entry but does not authorize use of premises to obstruct local law enforcement","Article 41 imposes independent duties on persons enjoying privileges and immunities to respect local laws and not to interfere in internal affairs; using an embassy to shelter a convicted local national can breach that duty","Articles 29–31 protect diplomatic agents but do not permit a sending State to convert premises into safe haven for non-diplomatic local nationals charged with ordinary crimes","The Convention’s rule that mission premises must not be used incompatibly with mission functions (Art. 41(3)) directly supports Ecuador’s claim that Mexico’s actions were unlawful","The Vienna Convention is the primary legal instrument to counter any argument that diplomatic inviolability or asylum declarations legitimize interference with the receiving State’s criminal justice system"]},{"filename":"Convention on International Civil Aviation (Chicago Convention).pdf","shortTitle":"Convention On International Civil Aviation (Chicago Convention)","date":"12/07/1944","type":"other document","shortSummary":"The Chicago Convention establishes State sovereignty over airspace and rules governing flights, landings and transit of aircraft, plus the International Civil Aviation Organization (ICAO) framework. In Ecuador v. Mexico it can be relied on to show that any removal of Mr. Glas by aircraft or use of air facilities without Ecuadorian authorization would violate Ecuador’s sovereignty and relevant air-navigation obligations.","detailedSummary":"The Convention on International Civil Aviation (Chicago Convention) codifies fundamental principles for international civil aviation, including State sovereignty over airspace (Article 1), the conditions for flights over and into another State’s territory (Articles 5–10), the distinction and special treatment of state aircraft (Article 3), prohibition on misuse of civil aviation (Article 4), and ICAO’s role and dispute-resolution mechanisms (Part II, Articles 43–57; Article 84). Relevant provisions and how they can be used in Ecuador’s arguments in the case at bar (Ecuador v. Mexico):\n\n- Sovereignty and Transit/Landing Rules (Articles 1, 5–7, 10): The Convention affirms each State’s exclusive sovereignty over the airspace above its territory (Art. 1) and sets conditions for non‑scheduled flights, scheduled services and landings at designated customs airports (Arts. 5–7, 10). If Mexico used state or civilian aircraft to extract Mr. Glas or instructed/arranged his departure without Ecuador’s consent or without complying with Ecuadorian rules for landing, transit or safe conduct, Ecuador can argue a breach of its territorial sovereignty and of the Convention’s traffic/landing regime.\n\n- State Aircraft and Authorization (Article 3): The Convention distinguishes civil from state aircraft and requires special authorization for state aircraft to fly over or land in another State. If Mexico relied on state aircraft (e.g., to effect removal) without Ecuadorian authorization, that would be contrary to Article 3(c) and would support Ecuador’s contention that Mexico unlawfully intervened in Ecuadorian territory.\n\n- Misuse of Civil Aviation (Article 4): The Convention obliges contracting States not to use civil aviation for purposes inconsistent with the Convention’s aims. Ecuador can argue that employing an embassy facility to shield a convicted national and then attempting to remove him by air is an abuse of aviation and transit facilities inconsistent with the Convention’s public‑order and safety objectives.\n\n- ICAO Framework and Remedies (Articles 43–57, 84–86): The Convention establishes ICAO and empowers its Council to consider disputes over interpretation or application (Art. 84). Ecuador can point to ICAO procedures as supplementary means that Mexico should have used rather than unilateral measures affecting Ecuadorian sovereignty. While Ecuador is litigating before the ICJ, the Convention’s dispute‑settlement scheme reinforces that aviation‑related disputes have specific multilateral channels and that unilateral acts affecting air transit and use of aircraft demand compliance with the Convention.\n\nPractical argumentative uses in Ecuador’s submissions:\n1) To demonstrate that any removal of Mr. Glas by air without Ecuador’s authorization would have violated Ecuador’s sovereignty over its airspace and the Convention’s landing/transit requirements; 2) To show that use of aviation resources (civil or state aircraft or facilitation of removal) to frustrate Ecuador’s criminal proceedings is inconsistent with Article 4’s prohibition on misuse of civil aviation; and 3) to invoke the Convention’s institutional framework as demonstrating that aviation‑related disputes require state cooperation and multilateral procedures rather than unilateral extraterritorial action, thus bolstering Ecuador’s broader claims of unlawful intervention and failure to respect territorial jurisdiction and procedural cooperation obligations.","keyPoints":["Article 1 (Sovereignty): every State has complete and exclusive sovereignty over the airspace above its territory — supports Ecuador’s territorial sovereignty claim if Mexico used aircraft or airspace without consent","Articles 5–10 (Transit, scheduled services, landing at designated airports): set conditions for flights, landings and transit — Mexico’s removal of Glas or use of aviation facilities without Ecuadorian authorization could breach these rules","Article 3 (State aircraft): state aircraft require authorization to fly over or land in another State — relevant if Mexico used state aircraft to extract Glas","Article 4 (Misuse of civil aviation): prohibits use of civil aviation inconsistent with Convention aims — lends support to Ecuador’s argument that facilitating Glas’s departure to frustrate justice misuses aviation facilities","Articles 43–57 and 84 (ICAO framework and dispute settlement): establish ICAO and an aviation dispute process — underscores that aviation disputes require cooperation and multilateral procedures rather than unilateral extraterritorial acts"]},{"filename":"Charter of the Organization of American States.pdf","shortTitle":"Charter Of The Organization Of American States","date":"1948 (amended 1967–1993)","type":"other document","shortSummary":"The Charter establishes the Organization of American States (OAS), its purposes (including the promotion of democracy, nonintervention, and peaceful settlement of disputes), and the obligations of Member States to respect sovereignty and refrain from interfering in internal affairs. In Ecuador v. Mexico, Ecuador invokes Charter principles (sovereign equality, territorial integrity, non‑intervention, and duties of cooperation) to argue Mexico breached regional obligations by sheltering and attempting to remove an Ecuadorian national from Ecuadorian jurisdiction.","detailedSummary":"The OAS Charter defines core regional principles: respect for the sovereignty, territorial integrity and political independence of Member States (Articles 1, 2, 10–13, 19–21); the duty of non‑intervention (Articles 2.b, 3.e, 19); promotion and consolidation of representative democracy (Articles 2.b, 3.d); and the obligation to pursue peaceful settlement of disputes and cooperative measures (Chapters V–VII). It establishes organs (General Assembly, Permanent Council, Meeting of Consultation) charged with promoting dialogue, good offices and measures to preserve friendly relations and resolve disputes (Articles 53–91). Relevant provisions underscore that the OAS has no authority to intervene in matters within the internal jurisdiction of Members (Article 1), while simultaneously obliging States to abstain from intervening in other States’ internal affairs (Articles 2.b, 3.e, 19) and to cooperate regionally. In the present case, Ecuador may rely on the Charter to show: (1) Mexico’s acts of sheltering an Ecuadorian national convicted or under prosecution for ordinary crimes and announcing asylum/evacuation constitute an interference with Ecuador’s internal jurisdiction and a derogation from Ecuador’s territorial sovereignty (contrary to Articles 1, 10–13, 19–21); (2) the Charter’s explicit duty of non‑intervention and respect for sovereignty supports Ecuador’s contention that Mexico improperly used diplomatic premises and political statements to affect Ecuador’s domestic processes (Articles 2.b, 3.e, 19); (3) the Charter’s framework for peaceful settlement and the Permanent Council/General Assembly competence supports Ecuador’s entitlement to regional diplomatic remedies and to invoke the OAS organs’ findings or resolutions (Articles 24–29, 80–91); and (4) references to promoting democracy and lawful institutional processes (Articles 2.b, 3.d, 45) bolster Ecuador’s argument that Mexico’s public attacks on Ecuadorian elections and political institutions violated OAS principles. Ecuador can therefore invoke the Charter as reinforcing customary and treaty norms on non‑intervention, sovereignty, and regional cooperation, and as validating recourse to inter‑state dispute settlement and remedial measures when a Member’s conduct undermines another’s territorial jurisdiction and judicial system.","keyPoints":["Charter affirms sovereign equality, territorial integrity and non‑intervention — supports Ecuador’s claim that Mexico unlawfully interfered in Ecuador’s internal affairs","Charter limits OAS powers but imposes duties on States to abstain from intervention and to respect each other’s domestic jurisdiction, reinforcing Ecuador’s legal argument","Provisions on peaceful settlement and OAS organs (Permanent Council, General Assembly) provide regional mechanisms and political backing for Ecuador’s dispute‑settlement and remedial claims","Charter’s promotion of representative democracy and respect for domestic institutions strengthens Ecuador’s argument that Mexico’s statements attacking Ecuadorian elections were improper under regional norms","While the Charter does not create enforcement powers independent of Member State consent, it bolsters Ecuador’s legal and political case that Mexico breached inter‑American obligations and justifies judicial adjudication or regional measures"]},{"filename":"Convention Against Torture.pdf","shortTitle":"Convention Against Torture","date":"12/10/1984 (entered into force 06/26/1987)","type":"other document","shortSummary":"The Convention Against Torture (CAT) requires States Parties to prevent torture and other cruel, inhuman or degrading treatment, to criminalize and prosecute such acts, to investigate allegations, and to prohibit refoulement to states where there are substantial grounds for believing the person would face torture. It creates reporting, cooperative and individual/state-complaint mechanisms to secure compliance.","detailedSummary":"Overview and core obligations relevant to Ecuador v. Mexico: - Non-refoulement (Article 3): No State Party shall expel, return or extradite a person to another State where substantial grounds exist for believing the person would be in danger of being subjected to torture; competent authorities must consider all relevant factors, including patterns of gross violations. - Prevention and criminalization (Articles 1–4, 16): Torture is defined (Article 1) and States must adopt effective measures (legislative, administrative, judicial and other) to prevent, criminalize and punish torture and other cruel, inhuman or degrading treatment. - Jurisdiction and prosecution (Articles 5–8): States must establish jurisdiction over torture offences in several circumstances (e.g., when committed in their territory or by their nationals) and afford mutual legal assistance and extradition for torture offences. - Custody, preliminary inquiry and notification (Article 6): A State in whose territory a person alleged to have committed torture is present shall, after examining available information, take that person into custody or other legal measures to ensure presence and conduct a prompt preliminary inquiry, notifying States listed in Article 5 as appropriate. - Prompt, impartial investigation and remedy (Articles 12–14): States must promptly and impartially investigate credible allegations of torture, guarantee complainants the right to complain, protect complainants and witnesses, and ensure victims obtain redress and compensation. - Cooperation, assistance and reporting (Articles 9, 17–24): States must afford one another the greatest measure of assistance in criminal proceedings, report periodically to the Committee against Torture, and may be subject to inquiries where systematic torture is alleged. How these rules bear on the case at bar (Ecuador v. Mexico): - CAT is principally focused on preventing torture and ensuring non-refoulement. Its provisions do not create a general asylum regime for persons convicted of ordinary crimes; rather they prohibit surrender or expulsion only where return would expose a person to torture. - Article 6’s obligation to take into custody and investigate an alleged offender present in a State’s territory establishes duties on a State where an alleged perpetrator is physically present; it anticipates coordination between States about custody, extradition or prosecution. - The Convention’s cooperative and investigative obligations (Articles 9, 12, 14) support international cooperation in criminal matters while still protecting persons from torture and guaranteeing fair treatment. Overall legal interaction with Ecuador’s claims: - Ecuador can invoke CAT to show that Mexico’s conduct cannot be justified on human-rights grounds unless Mexico had a bona fide, articulable risk that Mr. Glas faced torture or ill-treatment in Ecuador; absent credible grounds for such a risk, CAT does not authorize the use of diplomatic premises to shield a convicted local national from domestic criminal process. - Ecuador can also point to Article 6 as evidence that a State in whose territory an alleged offender is present has duties to take custody or to cooperate promptly with the territorial State’s criminal process; Mexico’s sheltering and announced removal of Mr. Glas without cooperating undermines that cooperative framework. - Mexico could attempt to rely on CAT only by asserting substantial grounds to fear torture on return; if Mexico raises Article 3 defensively, the Court would need to assess whether such grounds existed and whether Mexico’s actions (including use of embassy premises and unilateral removal) were proportional or lawful under international law. - CAT supports Ecuador’s broader argument that protecting the embassy from being used to obstruct justice is consistent with human-rights obligations: CAT requires States to prevent and investigate torture, not to obstruct another State’s legitimate judicial enforcement where no risk of torture exists.","keyPoints":["Article 3 prohibits refoulement where there are substantial grounds to believe return would lead to torture; absence of such grounds weakens any CAT-based justification for shielding a convicted national","Article 6 requires the State where an alleged offender is present to take custody or other measures and to make prompt inquiries and notifications — supporting cooperation rather than unilateral sheltering","Articles 12–14 obligate prompt, impartial investigations and effective remedies for torture victims, but do not create a blanket asylum exception for persons convicted of ordinary crimes","CAT’s obligations strengthen Ecuador’s position that Mexico must not misuse diplomatic premises to frustrate criminal enforcement unless a genuine, demonstrable risk of torture exists","If Mexico relies on Article 3 defensively, the Court must examine the factual basis for any claimed risk of torture and whether Mexico’s measures were lawful, necessary and proportionate"]},{"filename":"Lopez Burgos v. Uruguay (Human Rights Committee, 1981).pdf","shortTitle":"Lopez Burgos v. Uruguay","date":"1981","type":"other court case","shortSummary":"Human Rights Committee decision finding State responsibility where agents abducted, detained and tortured a person who had taken refuge abroad and the State failed to investigate or rebut allegations. The Committee emphasised that a State’s obligations under the Covenant extend to all persons within its power and also addressed responsibility for acts outside its territory.","detailedSummary":"Facts: The communication alleged that Uruguayan security agents, with assistance from Argentine actors, abducted and secretly transferred Mr. López Burgos from Argentina to Uruguay, where he was detained in secret detention, tortured and ill-treated. The complainant provided detailed factual allegations (dates, locations, names) and witness testimony. Uruguay did not effectively refute the factual allegations nor demonstrate any investigation.\n\nLegal findings: The Human Rights Committee found violations of the Covenant (notably Article 7 prohibiting torture and cruel, inhuman or degrading treatment) and emphasised two key points of principle: (1) the State’s obligations under the Covenant apply to all individuals within its territory and to persons subject to its effective control, including where agents operate extraterritorially; and (2) a State’s failure to investigate, to provide information or to refute well‑substantiated allegations can engage its international responsibility. The Committee treated the detailed, corroborated allegations as establishing a prima facie case in the absence of refutation by the State and underlined the duty of States to take preventive and investigatory measures and to refrain from conduct resulting in serious human rights violations.","keyPoints":["A State can be held responsible where its agents abduct, detain or torture persons even when initial contact occurred outside the State’s territory if the State exercised effective control or its agents acted.","Detailed and corroborated allegations that are not effectively rebutted by the State may be accepted as establishing a breach; the State bears a burden to investigate and produce evidence.","Obligations under human‑rights treaties (e.g., prohibition of torture) include a duty to prevent, investigate and remedy abuses and to avoid facilitating transnational removals that lead to ill‑treatment.","The Committee recognised extraterritorial dimensions of responsibility where State action or complicity produces human rights violations beyond its borders."]},{"filename":"United Nations Convention Against Corruption (Mérida Convention).pdf","shortTitle":"United Nations Convention Against Corruption","date":"2003-2004","type":"other document","shortSummary":"The United Nations Convention against Corruption (UNCAC, “Merida Convention”) is a comprehensive global treaty requiring States to prevent, criminalize and cooperate against corruption, including mutual legal assistance, asset recovery and anti‑money‑laundering measures. Ecuador can invoke UNCAC provisions on cooperation, mutual legal assistance and preventing misuse of diplomatic premises to argue Mexico breached obligations by sheltering and attempting to remove a convicted Ecuadorean national.","detailedSummary":"Overview: UNCAC (adopted 2003; opened for signature in Merida, Mexico) sets binding standards for prevention, criminalization, law‑enforcement cooperation and asset recovery. Key substantive pillars are (i) preventive measures and public integrity; (ii) criminalization and law enforcement (bribery, embezzlement, money‑laundering, obstruction, liability of legal persons); (iii) international cooperation (extradition, mutual legal assistance, law‑enforcement cooperation, special investigative techniques); and (iv) asset recovery (identification, freezing, confiscation, return).Relevant provisions for Ecuador v. Mexico: - Article 1 (purposes) and Article 43 (international cooperation) establish the Convention’s object of facilitating mutual assistance in corruption matters. - Article 15–23 and 31–36 require States to criminalize core corruption offences, enable freezing/seizure/confiscation and maintain specialized investigative bodies. Article 31 authorizes tracing/freezing/confiscation and empowers courts to order production of bank/financial records (no bank‑secrecy barrier). - Article 46–46/55: extradition and broad mutual legal assistance obligations (Art. 46 jurisdiction; Art. 46–47 extradition/transfer; Art. 46–46/55/54–55 mutual legal assistance and cooperation for confiscation) require States to provide the widest measure of assistance in investigations, prosecutions and asset recovery and permit executing foreign confiscation orders or freezing property at request. - Article 48 (law‑enforcement cooperation), Article 50 (special investigative techniques) and Article 58 (financial intelligence units) promote close operational cooperation to combat corruption and money‑laundering. - Article 52–57 (asset recovery): require enhanced due diligence for high‑risk accounts (Art. 52), mechanisms for identification/freezing/return of proceeds, and priority for returning embezzled public funds to the requesting State (Art. 57).How Ecuador Can Use UNCAC in This Case: 1) Obligation to cooperate in corruption investigations and prosecutions: Ecuador can argue Mexico violated UNCAC’s central duty to afford “the widest measure of mutual legal assistance” (Arts. 43, 46, 55) by sheltering a national convicted of corruption, refusing to surrender him, and acting to remove him — thereby obstructing enforcement of Ecuadorian criminal judgments and pending proceedings. 2) Duty to assist in freezing/confiscation and not to impede evidence: Mexico’s refusal to permit Ecuadorian authorities access and its use of diplomatic premises to effectuate asylum undermine UNCAC measures to identify, trace, freeze and confiscate proceeds and to provide bank/financial records (Arts. 31, 52–55). Ecuador may stress Art. 31(7) (power to order production of bank/financial records; bank secrecy not a bar) and Art. 55 (obligation to give effect to foreign confiscation orders or assist in tracing and freezing). 3) Obligation to prevent misuse of privileges that frustrate corruption enforcement: while UNCAC does not directly regulate diplomatic asylum, its preventive and law‑enforcement cooperation regime (Arts. 5–6, 36, 48) supports Ecuador’s contention that Mexico should not have used its mission to frustrate judicial process in a corruption case — particularly where the offences are ordinary corruption offences UNCAC requires States to criminalize (Arts. 15–18, 23). 4) Asset recovery priority where public funds embezzled: Art. 57(3)(a) requires return of confiscated property in cases of embezzlement of public funds; Ecuador can therefore seek declaratory relief and concrete measures to secure cooperation in preserving and returning any assets or preventing removal of proceeds. 5) Remedies and measures before the ICJ: Ecuador may ask the Court to pronounce that Mexico’s conduct breached UNCAC duties (cooperation, mutual legal assistance, asset recovery and law‑enforcement cooperation), and to order Mexico to take specific steps (cease misuse of diplomatic premises, surrender or facilitate lawful process, assist in freezing/return of any relevant assets, and adopt measures to ensure future cooperation).Limitations and Interaction With Other Law: - UNCAC does not itself determine asylum law; Ecuador should combine UNCAC claims with treaty and customary obligations (Vienna Convention, regional asylum instruments) as it has done. - UNCAC’s mutual assistance obligations are implemented “in accordance with domestic law,” and some measures (extradition, surrender) are subject to national conditions; Ecuador must show Mexico’s conduct went beyond permitted discretions and frustrated the Convention’s object and purpose. - UNCAC provides strong policy and legal support for Ecuador’s anti‑corruption and asset‑recovery claims and complements the Vienna Convention and inter‑American instruments invoked by Ecuador.Conclusion: UNCAC supplies a robust international framework Ecuador can invoke to demonstrate that Mexico failed to cooperate in corruption investigations and asset recovery, impaired execution of judicial decisions, and frustrated law‑enforcement cooperation. The Convention’s provisions on mutual legal assistance, freezing/confiscation, and return of embezzled public funds are the most directly applicable norms to argue Mexico breached binding obligations and to request judicially‑ordered remedies and measures to restore cooperation and secure assets.","keyPoints":["UNCAC requires States to criminalize core corruption offences and to cooperate fully in investigations, prosecutions and asset recovery (Arts. 15–23; 43–46; 55).","States must enable tracing, freezing and confiscation and assist foreign confiscation/return requests (Arts. 31; 52–55; 57 prioritizes return of embezzled public funds).","Bank secrecy cannot be invoked to refuse assistance in domestic corruption investigations (Art. 31(7); Art. 46/54–55 mutual legal assistance regime).","UNCAC’s law‑enforcement cooperation obligations (Arts. 48–50, 58) support Ecuador’s claim that sheltering a convicted national in a mission and removing him frustrated required cooperation.","Remedies under UNCAC: Ecuador can seek declaratory relief, orders to cease obstructive conduct, cooperation in surrender/asset preservation and specific steps to facilitate freezing/return of proceeds."]},{"filename":"Charter of the United Nations.pdf","shortTitle":"Charter Of The United Nations","date":"06/26/1945","type":"other document","shortSummary":"The UN Charter sets out the Organization's purposes and binding principles for Member States, including sovereign equality, non-intervention, peaceful settlement of disputes, and respect for treaty and other international-law obligations. These Charter principles frame states' conduct in international relations and the role of the International Court of Justice.","detailedSummary":"Relevant Charter provisions and how Ecuador can use them in Ecuador v. Mexico:\n\n- Purposes and principles (Articles 1–2): The Charter affirms sovereign equality (Art. 2(1)), the duty of Members to fulfill in good faith their Charter and treaty obligations (Art. 2(2)), the obligation to settle disputes by peaceful means (Art. 2(3)), and the corollary principle of non-intervention in matters essentially within the domestic jurisdiction of States (Art. 2(7), read with the Court's interpretation in subsequent jurisprudence and the Friendly Relations Declaration). Ecuador can invoke these provisions to show that Mexico’s sheltering of a convicted Ecuadorian national and public political statements amounted to unlawful interference with Ecuador’s sovereignty and internal affairs and breached Mexico’s duty to respect Ecuador’s laws and judicial processes.\n\n- Duty to comply with obligations and treaties: Article 1(3) and Article 2(2) underline that the UN system exists to maintain justice and respect for obligations arising from treaties and other sources of international law. Ecuador can argue Mexico’s conduct contravened Mexico’s treaty obligations (cited in the Application) and customary rules, thereby undermining the Charter’s purpose of maintaining justice and treaty stability.\n\n- Peaceful settlement and the role of the Court (Articles 33, 92–96): The Charter encourages peaceful means for dispute settlement (Art. 33) and designates the ICJ as the principal judicial organ (Art. 92). Ecuador may rely on these provisions, alongside regional compromissory clauses (Pact of Bogotá), to justify seisin of the Court and to emphasize that recourse to judicial settlement is the Charter-favored method for resolving such interstate legal disputes.\n\n- Compliance with ICJ decisions and enforcement (Article 94): Article 94 requires Members to comply with ICJ decisions and contemplates Security Council involvement where a party fails to perform obligations under a judgment. Ecuador can point to Art. 94 to stress the binding nature of the Court’s eventual judgment and the expectation of Mexican compliance.\n\n- Limited relevance of Chapter VII mechanisms: While Articles 39–51 deal with collective enforcement, Ecuador’s primary Charter-based arguments are normative (sovereignty, non-intervention, treaty fidelity, judicial settlement) rather than seeking Security Council enforcement at this stage. The Charter nonetheless provides the umbrella legal framework showing that Mexico’s acts, if found internationally wrongful, implicate fundamental UN principles.\n\nOverall, Ecuador can use the Charter to (i) frame Mexico’s conduct as violating core UN principles (sovereign equality, non-intervention, respect for treaty and judicial processes), (ii) underpin the Court’s jurisdiction and the appropriateness of judicial settlement, and (iii) support a claim for declaratory relief and binding adjudication that Mexico breached international obligations arising under the Charter and related treaties.","keyPoints":["Charter principles (sovereign equality, non-intervention, good-faith treaty compliance) support Ecuador’s claim that Mexico unlawfully interfered in Ecuador’s internal affairs","Articles 33 and 92–96 promote peaceful settlement and designate the ICJ as the appropriate forum — reinforcing Ecuador’s choice to bring the dispute before the Court","Article 2(2) and Article 1(3) underscore the duty to respect treaty and judicial obligations, bolstering Ecuador’s argument that Mexico breached its obligations under regional and universal instruments","Article 94 indicates ICJ judgments are binding and establishes mechanisms for enforcement, giving legal weight to any Court decision in Ecuador’s favor","The Charter provides a normative framework (rather than specific asylum/diplomatic rules) that situates Mexico’s conduct as contrary to the UN system of sovereign equality and peaceful co-operation"]},{"filename":"American Treaty on Pacific Settlement (Pact of Bogotá, 1948) [Conference of American States].pdf","shortTitle":"American Treaty On Pacific Settlement (Pact Of Bogotá)","date":"1948","type":"other document","shortSummary":"The Pact of Bogotá binds American States to settle interstate disputes by peaceful regional procedures and declares compulsory ICJ jurisdiction for juridical disputes among American States. In Ecuador v. Mexico the Pact supplies a treaty basis for the Court's jurisdiction and frames obligations on peaceful settlement, non‑intervention, and procedures prior to judicial resort.","detailedSummary":"The Pact of Bogotá (American Treaty on Pacific Settlement) is directly relevant to Ecuador v. Mexico in two principal ways: jurisdiction and substantive procedural obligations. Article XXXI of the Pact contains an express, reciprocal declaration by High Contracting Parties that they recognize the Court's compulsory jurisdiction, in relation to any other American State, for disputes of a juridical nature about treaty interpretation, questions of international law, existence of facts constituting breaches, and reparation. Ecuador can therefore rely on the Pact as a treaty basis for seising the Court without a special agreement. Procedurally, the Pact requires use of the regional peaceful‑settlement mechanisms (Articles I–IV, II, IX–XIII, XV–XXX) and foresees conciliation/arbitration where appropriate; Article XXXII permits recourse to the ICJ when conciliation does not produce a solution. These provisions allow Ecuador to show that (1) a legal controversy exists that cannot be resolved by the ordinary diplomatic exchanges already tried between Quito and Mexico City, and (2) the parties are entitled to bring a juridical dispute before the Court under the Pact.\n\nSubstantively, several Pact provisions support Ecuador's claims on the merits or on admissibility. The Pact emphatically requires peaceful settlement and non‑coercive conduct (Articles I–II) and contemplates submission to regional good offices/mediation and conciliation prior to or alongside judicial means; that framework reinforces Ecuador's position that Mexico should have resolved the asylum/diplomatic‑premises conflict through negotiation, mediation, or conciliation rather than unilateral measures that Ecuador characterizes as interference. Article V (exclusion for matters within domestic jurisdiction) is the most likely focal point for Mexico’s counter‑argument; Ecuador can answer by showing the dispute raises international law questions (treaty interpretation and breaches of obligations under Vienna Convention and asylum conventions) within Article XXXI’s scope, so it is not a purely domestic matter within Article V. Article VII (non‑intervention in diplomatic protection to protect nationals when domestic remedies were available) is also relevant: Mexico may attempt to frame its acts as diplomatic protection of a national, but Ecuador can argue the dispute concerns the lawfulness of using diplomatic premises to obstruct domestic criminal processes and interpretation/application of regional asylum instruments — matters squarely of international law under Article XXXI.\n\nFinally, the Pact’s provisions on procedure (Articles XXXII–XXXV) allow Ecuador to show admissibility: conciliation/mediation were attempted or could not resolve the controversy, and the Pact itself contemplates judicial referral when regional procedures fail. Ecuador can therefore rely on the Pact both to establish this Court's compulsory jurisdiction and to frame the dispute as one implicating interstate treaty obligations (use of diplomatic premises, non‑intervention, and cooperation in anti‑corruption prosecutions), thereby countering any plea that the matter is purely internal or non‑justiciable.","keyPoints":["Article XXXI supplies an express treaty basis for compulsory ICJ jurisdiction over juridical disputes between American States, supporting Ecuador's seisin of the Court","Articles I–II and related provisions require peaceful regional settlement and frame the dispute as raising interstate obligations (non‑intervention, peaceful procedures), reinforcing Ecuador's meritorious claims","Article V (domestic‑jurisdiction exception) is the main potential bar Mexico may invoke, but Ecuador can show the case raises international law questions and treaty interpretation within Article XXXI","Article VII and the Pact's procedural chapters limit purely diplomatic‑protection defenses and permit judicial recourse where conciliation/mediation fail (Article XXXII), supporting admissibility","Overall, the Pact can be used both to establish jurisdiction and to argue that Mexico violated interstate obligations by using diplomatic premises and asylum in ways incompatible with regional treaty norms"]},{"filename":"Universal Declaration of Human Rights (1948).pdf","shortTitle":"Universal Declaration Of Human Rights","date":"1948","type":"other document","shortSummary":"The Universal Declaration of Human Rights (UDHR) sets out universal civil, political, economic and social rights (e.g. rights to fair trial, liberty, security, and to seek asylum subject to limits). In Ecuador v. Mexico, the UDHR provides human-rights norms that can be invoked to frame Mexico’s conduct — sheltering a convicted national in its embassy and obstructing domestic judicial processes — as contrary to principles protecting legal process, non-arbitrary detention/exile, and the rule of law.","detailedSummary":"The UDHR proclaims foundational principles relevant to the Court’s assessment of inter-State conduct affecting individuals and domestic legal processes. Articles especially pertinent to Ecuador’s claims include: Article 3 (right to life, liberty and security of person); Article 8 (right to an effective remedy by competent national tribunals); Article 9 (no arbitrary arrest, detention or exile); Article 10 (right to a fair and public hearing by an independent and impartial tribunal); Article 11 (presumption of innocence and guarantees in criminal proceedings); Article 12 (protection from arbitrary interference with home and reputation); Article 14(1)-(2) (right to seek asylum and the exception that it may not be invoked for prosecutions genuinely arising from non-political crimes); and Articles 1, 2 and 7 (equality, dignity and equality before the law). These provisions collectively support the primacy of lawful domestic criminal processes and the protection of individuals’ legal status and procedural guarantees. In the present case, Ecuador can rely on the UDHR to emphasize: (a) that Mexico’s sheltering and attempted removal of a person convicted and subject to arrest warrants risks arbitrary deprivation of liberty and effective obstruction of Ecuador’s right to enforce its criminal judgments and secure remedies (Articles 3, 8, 9, 10, 11); (b) that asylum protections under international human-rights norms are expressly limited where prosecutions arise from non-political/common crimes (Article 14(2)), aligning with regional asylum conventions Ecuador cites; and (c) that State actions that impair another State’s ability to provide legal remedies and to exercise its judicial authority implicate the UDHR’s core principles of the rule of law, dignity and non-interference. While the UDHR is a general, non‑treaty declaration, it helps interpret treaty and customary obligations invoked by Ecuador (Vienna Convention Article 41; Caracas/Montevideo asylum rules; anti‑corruption conventions) and can be used persuasively before the Court to show the human‑rights stakes of Mexico’s conduct and to buttress Ecuador’s argument that Mexico’s actions unlawfully interfered with Ecuador’s legal order and the individual’s right to a lawful adjudication and remedy.","keyPoints":["UDHR Articles 3, 8–11 protect liberty, fair trial rights, remedies and forbid arbitrary arrest/detention — supporting Ecuador’s claim that embassy sheltering obstructed due process","Article 14(2) limits asylum where prosecutions arise from non‑political/common crimes, consistent with Ecuador’s reliance on regional asylum conventions","Articles on equality, dignity and protection from arbitrary interference (Articles 1,2,7,12) bolster Ecuador’s argument that Mexico’s conduct undermined rule of law and domestic legal remedies","Although non‑binding, the UDHR can be used as persuasive authority to interpret treaty and customary obligations (Vienna Convention, Caracas/Montevideo, anti‑corruption instruments) and to highlight human‑rights consequences of non‑cooperation","UDHR norms help frame Mexico’s public statements and use of diplomatic premises as not only diplomatically problematic but also contrary to principles protecting legal process and protection against arbitrary exile or interference"]},{"filename":"Statute of the International Court of Justice (Rules of Court reference).pdf","shortTitle":"Statute Of The International Court Of Justice","date":"1945 - present","type":"other document","shortSummary":"The Statute establishes the Court’s composition, jurisdiction, procedure and sources of law; it governs how States bring cases, how the Court decides them, and the remedies and provisional measures available. Its provisions determine admissibility, competence, and the legal methods the Court must apply to disputes such as Ecuador v. Mexico.","detailedSummary":"The Statute of the International Court of Justice (ICJ) sets the institutional and procedural framework that governs the adjudication of interstate disputes and the application of international law. Key provisions directly relevant to Ecuador v. Mexico include: (a) Jurisdiction and Competence — Article 36(1)-(2) defines the Court’s jurisdiction to decide cases submitted by states and to apply treaties, questions of international law, and facts constituting breaches of obligations. Ecuador invokes the Pact of Bogotá and other instruments to establish jurisdiction; under Article 36 the Court must determine whether those bases suffice. (b) Who May Be a Party — Article 34 confirms that only states may be parties, which frames procedural posture (Ecuador v. Mexico) and third‑party or intervention requests under Articles 62–63. (c) Application and Seisin — Article 40 requires a written application to the Registrar and immediate communication to the other party; Ecuador’s April 29 Application invokes this procedure and the Statute obliges the Registrar to notify Mexico and relevant States. (d) Provisional Measures — Article 41 empowers the Court to indicate provisional measures to preserve rights of the parties pending final decision; Mexico and Ecuador both sought urgent measures in related filings, and Article 41 governs the threshold and effect of any such indications. (e) Applicable Law — Article 38 prescribes sources the Court must apply (treaties, custom, general principles, and subsidiary means); this directs the Court to assess claims under the Vienna Convention on Diplomatic Relations, the Caracas and Montevideo asylum conventions, OAS and UN instruments, and anti‑corruption treaties relied upon by Ecuador. (f) Judges Ad Hoc and Composition — Article 31 preserves parties’ rights to have judges of their nationality sit or to appoint ad hoc judges; Ecuador’s notice of intent to choose a judge ad hoc is rooted in Article 31 and Article 36 procedural framework. (g) Procedure, Evidence and Default — Articles 43–55 and 53–54 set written and oral proceedings, evidence rules, and the Court’s approach when a party fails to appear; these provisions shape admissibility, burden of proof on alleged breaches, and the conduct of hearings in this case. (h) Binding Effect and Finality — Articles 59–60 state that judgments bind only the parties and are final; relief and legal consequences requested by Ecuador would be binding on Mexico only if the Court finds a breach and issues a judgment. How the Statute can be used to argue the case at bar: - Ecuador can invoke Article 36 (and Pact of Bogotá treated as a treaty within Article 36) to establish the Court’s competence to adjudicate alleged breaches of treaty and customary obligations by Mexico (diplomatic abuse, unlawful asylum, non‑cooperation on anti‑corruption). - Article 40 and the Registrar notification regime strengthen Ecuador’s procedural seisin and timing arguments (Ecuador’s application and annexed communications demonstrate proper seisin). - Article 41 supports Ecuador’s requests for provisional measures (or rebuttal of Mexico’s measures): Ecuador can argue the existence of a real risk that Mexico’s actions would render a final judgment ineffectual and that provisional measures are appropriate to preserve Ecuador’s rights. - Article 38 requires the Court to apply the specific treaties Ecuador relies on (Vienna Convention, Caracas/Montevideo asylum law, OAS/UN instruments, Merida and Inter‑American anti‑corruption conventions), so Ecuador’s factual record and treaty interpretation arguments must be framed directly under those sources. - Article 31 underpins Ecuador’s right to choose a judge ad hoc and to insist on impartial adjudication where nationalities of judges might otherwise affect composition; it also allows Mexico to select a judge if a judge of its nationality sits. Together, the Statute’s provisions supply the procedural route, standards of admissibility and evidence, and sources of law by which Ecuador’s substantive claims (misuse of diplomatic premises, unlawful asylum, non‑cooperation, and unlawful interference) must be assessed and, if established, remedied.","keyPoints":["Article 36 provides the Court’s jurisdiction to decide treaty disputes and questions of international law — central to Ecuador’s invocation of the Pact of Bogotá and other treaties","Article 40–41 govern seisin and provisional measures; Ecuador’s application, timing and any provisional relief must satisfy those provisions","Article 38 fixes applicable sources (treaties, custom, general principles) — the Court must assess Vienna Convention, asylum conventions, anti‑corruption treaties and customary non‑intervention","Article 31 permits appointment of a judge ad hoc and affects bench composition and parties’ procedural rights","Articles 43–55 and 53 set the written/oral procedure, evidence rules and consequences if a party fails to appear; Articles 59–60 establish finality and binding effect of the Court’s judgment"]},{"filename":"Inter-American Convention against Corruption [Organization of American States].pdf","shortTitle":"Inter-American Convention Against Corruption","date":"03/29/1996","type":"other document","shortSummary":"Regional treaty obliging OAS Member States to prevent, detect, punish and cooperate in relation to corruption, including broad mutual legal assistance and extradition measures; it clarifies that corruption offences are not political offences for purposes of asylum or non‑cooperation. Ecuador invokes it to show Mexico breached obligations of cooperation and frustrated Ecuador’s anti‑corruption prosecutions.","detailedSummary":"Overview: The Inter‑American Convention Against Corruption (IACAC) requires States Parties to adopt preventive measures against corruption, to criminalize specified corrupt acts (or otherwise cooperate), and to afford the “widest measure” of mutual assistance in investigations, prosecutions and judicial proceedings relating to corruption. Key obligations include mutual legal assistance (Article XIV), extradition cooperation (Article XIII), jurisdictional rules (Article V), treatment of the nature of corrupt acts as not automatically qualifying as political offences (Article XVII), and measures on property tracing and seizure (Article XV). How the Convention applies to Ecuador v. Mexico: - Mutual‑assistance obligation: Article XIV obliges States Parties, subject to domestic law and applicable treaties, to process requests from competent authorities to obtain evidence and take action that facilitates investigation and prosecution of acts of corruption. Ecuador can rely on this provision to argue that Mexico had a duty to cooperate with Ecuador’s requests to surrender or otherwise permit local authorities to take custody of an accused/convicted person prosecuted for corruption-related offences. - Extradition and custody measures: Article XIII makes corruption offences extraditable between States Parties and allows the Convention itself to furnish a legal basis for extradition where no bilateral treaty exists; it also authorizes temporary custody measures when circumstances are urgent. Ecuador can argue Mexico violated these duties by refusing to surrender Mr. Glas or to permit Ecuadorian authorities to take custody. - Political‑offence limitation: Article XVII states that the mere allegation that proceeds or acts were political does not, by itself, render a corrupt act a political offence. Coupled with Article IV’s territoriality scope and Articles VI/VII defining corruption as “common” criminal behaviour, this supports Ecuador’s position that claims of political asylum do not override obligations to cooperate in corruption cases. - Preventive and substantive obligations: Articles II, III, VI and VII show States Parties’ shared commitment to combat corruption and to criminalize key corrupt conduct; Ecuador may use these provisions to frame its prosecutions of Mr. Glas as legitimate anti‑corruption enforcement consistent with regional norms against shielding corrupt actors. - Asset cooperation: Article XV reinforces obligations to identify, trace, freeze and forfeit proceeds of corruption and to assist one another in those measures — showing the Convention’s comprehensive assistance mandate goes beyond mere evidence, to practical law‑enforcement cooperation that Mexico impeded. Probative use in the case at bar: Ecuador can cite the IACAC to demonstrate that Mexico was legally obliged to process Ecuador’s cooperation requests in good faith, to consider extradition or provisional custody under the Convention, and not to use diplomatic premises or asylum claims to frustrate regional anti‑corruption obligations. The Convention’s statement that corruption is not to be treated as a political offence (Article XVII) and its express mutual‑assistance obligations (Articles XIII–XV, XIV) bolster Ecuador’s argument that Mexico’s sheltering of a convicted and prosecuted individual and its refusal to surrender him constituted a breach of binding inter‑American cooperation duties and an interference with Ecuador’s criminal process.","keyPoints":["The Convention requires States Parties to afford the widest measure of mutual legal assistance in corruption investigations and prosecutions (Article XIV), including evidence‑gathering and related measures.","Extradition cooperation is mandated: corruption offences are to be treated as extraditable (Article XIII), and the Convention may serve as a legal basis for extradition when no bilateral treaty exists.","The Convention treats corruption as common crime for cooperation purposes and bars treating corrupt proceeds/acts as political offences by default (Article XVII), undercutting asylum claims based on political persecution.","States must adopt domestic preventive and criminal measures against corruption (Articles II, III, VI, VII), which frames Ecuador’s prosecutions as consistent with regional obligations.","Assistance extends to tracing, freezing and forfeiture of proceeds (Article XV) — demonstrating the Convention’s comprehensive cooperation goals that Mexico’s conduct impeded."]},{"filename":"Convention on Territorial Asylum.pdf","shortTitle":"Convention On Political Asylum","date":"12/26/1933","type":"other document","shortSummary":"Regional inter-American treaty (Montevideo, 1933) that prohibits granting asylum in legations, warships, military camps or airships to persons accused or convicted of common offences and requires their surrender to local authorities. It also provides that the State offering asylum is the judge of political delinquency.","detailedSummary":"The Convention on Political Asylum (Montevideo, 1933) restricts diplomatic/political asylum by declaring that States may not grant asylum in legations, warships, military camps or airships to persons accused of or sentenced for common offences, and that such persons who take refuge in those places are to be surrendered as soon as requested by the local government (Article 1). The Convention further establishes that determinations about whether an offence is political are for the State offering asylum (Article 2), clarifies the humanitarian character and non-reciprocal nature of political asylum (Article 3), and addresses diplomatic consequences (Article 4). In relation to Ecuador v. Mexico, the Montevideo Convention is directly pertinent because it expressly bars the grant of asylum in diplomatic premises to persons accused or convicted of ordinary crimes and obliges surrender on request. Ecuador can rely on the Convention to argue that (1) Mr. Glas was convicted of corruption offences (common offences) and therefore not eligible for diplomatic/political asylum in the Mexican mission under Article 1; (2) Mexico’s sheltering of and announced grant of asylum to Mr. Glas violated the Convention’s mandatory surrender obligation; and (3) any derogation from Ecuador’s territorial jurisdiction effected by Mexico’s actions lacked a lawful basis under the treaty. Coupled with the Caracas Convention (1954) and Vienna Convention obligations on mission functions and non-interference, the Montevideo Convention supports Ecuador’s claim that Mexico unlawfully intervened in Ecuador’s domestic judicial process and misused diplomatic premises.","keyPoints":["Article 1: Prohibits asylum in legations/warships/military camps/airships for persons accused of or convicted of common offences and requires surrender on request","Article 2: The State offering asylum is the judge of whether an act is political in nature (limits scope but does not permit asylum for ordinary crimes)","Article 3: Frames political asylum as humanitarian and non-reciprocal while noting limits where States do not recognize asylum","Relevance to Ecuador v. Mexico: supports Ecuador’s claim that sheltering a convicted public official for corruption in an embassy and granting asylum to effect his removal violated inter-American asylum rules and required surrender","When combined with Vienna Convention Article 41 and anti-corruption conventions, the Montevideo Convention bolsters arguments of unlawful interference with Ecuador’s sovereignty and obstruction of justice"]},{"filename":"Havana Convention on Asylum (1928) [Conference of American States].pdf","shortTitle":"Convention On Asylum (Havana)","date":"02/20/1928 - 05/21/1929","type":"other document","shortSummary":"The Havana Convention (1928) limits diplomatic asylum by prohibiting asylum in legations, warships or military premises for persons accused or convicted of common crimes and requires surrender on request of the local government; it permits only narrow, urgent, temporary asylum for political offenders subject to safeguards. Its provisions have been incorporated or reflected in later regional asylum instruments (Montevideo 1933; Caracas 1954).","detailedSummary":"The Convention On Asylum (Havana, 1928) establishes regional rules on diplomatic and territorial asylum among American States. Key operative rules include: (1) a prohibition on granting asylum in legations, warships, military camps or aircraft to persons accused or convicted of common crimes and an obligation to surrender such persons to the local government (Article 1); (2) detailed limits on asylum for political offenders when granted in diplomatic/military premises — it must be exceptional (urgent), strictly temporary, reported immediately to the local authorities, and the receiving State may require the refugee to leave as soon as possible; asylum cannot be used to land refugees in national territory or allow them to engage in acts contrary to public peace (Article 2, First–Fifth); (3) asylum granted must respect domestic law, existing treaties, usages and humanitarian toleration; and (4) the Convention does not displace other treaty obligations. The Convention was later modified or developed by the Montevideo (1933) and Caracas (1954) instruments but remains an important early codification of the limits of diplomatic asylum in inter-American law. In relation to Ecuador v. Mexico, the Convention supplies direct treaty text supporting Ecuador’s claim that Mexico could not lawfully grant asylum in its embassy to a person convicted of common crimes, and that Mexico had an obligation to surrender the person to Ecuadorian authorities or facilitate exit under guarantees rather than remove him in breach of the receiving State’s jurisdiction. The Convention’s reporting, temporariness and non-derogation-from-sovereignty rules help show that any purported grant of asylum intended to shield convicted common offenders and to effect removal from the receiving State is unlawful under inter-American asylum law. Combined with the Montevideo and Caracas rules and Vienna Convention obligations, Havana supports arguments that Mexico misused its mission, interfered in Ecuador’s internal affairs, and breached specific treaty duties to surrender or to limit asylum to genuinely political, urgent, and temporary cases.","keyPoints":["Article 1 prohibits asylum in legations/warships/military premises for persons accused or convicted of common crimes and requires surrender to local authorities on request","Article 2 limits diplomatic asylum for political offenders to urgent, strictly temporary cases, requires immediate notice to local authorities, and forbids using missions as a means to land or effect removal into national territory","The Convention confirms asylum cannot derogate from the territorial State’s sovereignty unless a legal basis is clearly established and consistent with other treaty obligations","In Ecuador v. Mexico the Convention supports Ecuador’s position that Mexico unlawfully sheltered and sought to remove a convicted common criminal from Ecuadorian jurisdiction and thus misused its diplomatic premises","When read with Montevideo, Caracas and Vienna Convention obligations, Havana strengthens claims of non‑intervention, improper use of mission premises, and failure to surrender and cooperate in law enforcement"]},{"filename":"1976 International Covenant on Civil and Political Rights (ICCPR).pdf","shortTitle":"International Covenant On Civil And Political Rights","date":"1976","type":"other document","shortSummary":"The ICCPR codifies core civil and political rights (liberty, fair trial, non‑arbitrary detention, freedom of movement and remedies) and creates State obligations to respect and ensure those rights and to provide effective remedies. It establishes monitoring procedures (Human Rights Committee) and duties of States Parties to take measures to give effect to Covenant rights.","detailedSummary":"Relevant ICCPR provisions and how they can be used in Ecuador v. Mexico: \n\n- Article 2 (State obligation to respect and ensure rights; effective remedy): Ecuador can invoke Article 2 to show that States Parties must take measures to ensure that Covenant rights are effective in practice and that victims of rights violations have enforceable remedies. Ecuador may argue Mexico’s conduct — sheltering a convicted national in its diplomatic premises and acting to remove him from Ecuador — frustrated Ecuador’s ability to secure enforcement of judicial decisions and thus frustrated the effective operation of Ecuador’s criminal justice remedies against that individual. Article 2 supports Ecuador’s contention that States must not take actions that obstruct another State’s lawful processes when those processes are directed to upholding Covenant rights (for example, victims’ rights to truth and effective legal process). \n\n- Article 9 (liberty and security; protection against arbitrary arrest/detention): Ecuador can argue that Mexico’s actions facilitated the evasion of lawful and non‑arbitrary arrest orders issued by Ecuadorian courts, thereby undermining the protections Article 9 affords (both the substantive protection against arbitrary deprivation of liberty and the procedural guarantees for lawful detention). Conversely, Mexico may counter that its conduct was aimed at protecting Glas’ Covenant rights (e.g., to liberty from persecution), so the Court should weigh competing rights and the lawfulness of Ecuador’s criminal measures under the Covenant. \n\n- Article 12 (freedom of movement; right not to be arbitrarily deprived of the right to enter one’s own country): Article 12(4) can be pressed to show that a State should not impede a national’s return to his own country or assist removal in a way that defeats legal processes. Ecuador can argue Mexico’s attempt to remove Glas interfered with Ecuador’s sovereign ability to enforce its criminal sentences and thus implicated movement/return rights and associated State responsibilities. \n\n- Article 14 (fair trial and finality of convictions): Because Glas had been convicted by Ecuador’s highest courts in two cases, Ecuador may rely on Article 14 to emphasize the finality and legality of those convictions; Mexico’s sheltering and proposed removal undermined the implementation of final judicial decisions. Mexico might respond by invoking Article 14 protections for the accused (e.g., claims that his proceedings were unfair), but Ecuador can point to the record of final judgments and procedural review set out in its Application. \n\n- Article 17 (protection of home and privacy): Ecuador can contend that using diplomatic premises to protect a local national from domestic enforcement interferes with the territorial State’s control over its territory and the personal legal status of persons within it, contrary to the Covenant’s guarantees when read with the non‑intervention principle. \n\nProcedural and interpretive uses before the ICJ: \n- The ICCPR is not a jurisdictional basis for the ICJ, but it is a binding treaty between both States and a relevant source of international legal obligations under Article 38(1)(c) of the ICJ Statute. Ecuador can therefore rely on ICCPR provisions to interpret customary rules on non‑intervention, state duties to cooperate with domestic enforcement, and the protection of judicial remedies. \n\nProbative value and limits: \n- Strengths for Ecuador: the ICCPR underlines State duties to ensure effective remedies (Article 2) and to respect criminal‑process safeguards (Articles 9 and 14) — supporting Ecuador’s argument that Mexico’s conduct frustrated lawful domestic enforcement and victims’ rights to effective remedies; it reinforces the unlawfulness of actions that obstruct judicial processes. \n- Weaknesses/Mexico’s likely counters: the ICCPR does not address diplomatic asylum or the lawfulness of a State’s grant of asylum in diplomatic premises; Mexico may argue it acted to protect Glas’ Covenant rights (e.g., risk of political persecution), or invoke limitations, comity, and the narrow comparative scope of Articles (the Covenant does not displace diplomatic or asylum law). The Human Rights Committee procedure (Articles 41–42) is separate from the ICJ and cannot substitute for treaty interpretation in this Court, though Committee jurisprudence may be persuasive. \n\nPractical pleading approach: Ecuador should (i) cite Article 2 to frame Mexico’s acts as frustrating Ecuador’s obligation to provide effective remedies and enforce final judgements; (ii) invoke Articles 9 and 14 to show the nexus between Mexico’s conduct and the deprivation of Ecuadorian legal process protections; (iii) use the Covenant to corroborate that shielding a convicted individual from lawful enforcement undermines international human‑rights obligations and the rule of law, while acknowledging the Covenant’s limits on asylum/diplomatic immunity questions; and (iv) distinguish the ICCPR’s remedial mechanisms from the present ICJ forum while using Covenant norms as authoritative evidence of binding State duties relevant to the dispute.","keyPoints":["Article 2 imposes a State duty to ensure rights and effective remedies — Ecuador can argue Mexico’s sheltering of Glas frustrated enforcement of Ecuadorian judicial remedies","Articles 9 and 14 protect against arbitrary deprivation of liberty and guarantee fair trial — Mexico’s actions can be framed as facilitating evasion of lawful arrest and undermining final convictions","Article 12(4) (right to enter one’s country) and Article 17 support Ecuador’s position that removal or shielding of a national cannot lawfully obstruct domestic legal processes","ICCPR is not a jurisdictional basis for the ICJ but is a binding treaty and persuasive source of international law under Article 38(1)(c); its norms can be used to interpret State duties on cooperation, remedies and non‑interference","Limitations: the Covenant does not govern diplomatic asylum directly and Human Rights Committee procedures are distinct from ICJ litigation, so Ecuador should use the ICCPR to bolster — not to replace — arguments grounded in diplomatic‑asylum and Vienna Convention obligations"]},{"filename":"United States Diplomatic and Consular Staff in Tehran (United States v. Iran), ICJ (1980) — Tehran Hostage Case.pdf","shortTitle":"United States Diplomatic and Consular Staff in Tehran (United States v. Iran)","date":"11/04/1979–05/24/1980","type":"icj judgement","shortSummary":"The ICJ found that Iran violated obligations under treaties and general international law by failing to protect the inviolability of the U.S. Embassy and its staff, indicated provisional measures for their release and ordered Iran to secure their immediate release and make reparation. The Court also held that State responsibility may arise where a State fails to prevent wrongful acts in its territory and where State organs subsequently endorse or perpetuate those acts.","detailedSummary":"The Tehran Hostage Case (ICJ) concerned the occupation of the United States Embassy in Tehran and the seizure of diplomatic and consular personnel by militants beginning 4 November 1979. The Court emphasized the fundamental rule of inviolability of diplomatic premises and persons and, on provisional measures, required steps to restore the premises and secure release of the hostages. On the merits (24 May 1980) the Court found that Iran had violated treaty obligations and rules of general international law and therefore bore international responsibility. Although the initial perpetrators were non-state actors, the Court found that Iran had failed to take reasonable steps to prevent or terminate the wrongful acts and that, after the events, certain State organs endorsed and perpetuated the acts such that they became attributable to the State. The Court ordered cessation, release, restoration and reparation (though final reparation proceedings were later discontinued). The judgment thus (i) reaffirmed strict protections for diplomatic premises and agents, (ii) confirmed the State duty to prevent and to put a stop to unlawful acts on diplomatic premises, and (iii) explained how failure to act and later endorsement by State organs can transform non-state wrongful acts into internationally wrongful acts of the State.","keyPoints":["Reaffirmation of the inviolability of diplomatic premises and the duty of the receiving State (and persons enjoying privileges) to respect local laws and not to use mission premises inconsistently with their functions","State responsibility can arise from failing to prevent, stop or punish wrongful acts committed on its territory even when initial perpetrators are non-state actors, and becomes attributable where State organs later endorse or perpetuate those acts","The Court will indicate and enforce provisional measures to protect fundamental diplomatic rights and to secure immediate relief (release, restoration) pending the merits","Tehran supports treating misuse of an Embassy that obstructs another State's enforcement of its law as capable of engaging the sending State's international responsibility","Limitations: Tehran dealt with violent non-state occupation and hostage-taking; the legal principles are transferable but must be applied to the distinct factual matrix of diplomatic asylum and alleged unlawful grant of protection"]},{"filename":"Nicaragua v. United States (Military and Paramilitary Activities in and against Nicaragua, 1986).pdf","shortTitle":"Nicaragua v. United States (Military and Paramilitary Activities in and against Nicaragua)","date":"1984-1986","type":"icj judgement","shortSummary":"ICJ found the United States internationally responsible for unlawful military and paramilitary intervention in Nicaragua, breaching customary international law and treaty obligations, and ordered cessation of wrongful acts and reparation. The Court also addressed jurisdiction and indicated provisional measures early in the proceedings.","detailedSummary":"The ICJ held that it had jurisdiction under relevant treaty declarations and that Nicaragua’s application was admissible. On the merits (1986) the Court found that US support for and direction of military/paramilitary activities against Nicaragua violated customary international law obligations not to use force, not to intervene in the affairs of another State, not to infringe another State’s sovereignty, and not to interrupt peaceful maritime commerce; the Court also found breaches of a bilateral 1956 Treaty. It rejected the US argument of collective self‑defence. The Court ordered the US to cease the unlawful conduct immediately and to make full reparation for injuries caused; it also had earlier indicated provisional measures (ordering cessation of mining and other acts restricting access to ports). The case illustrates (i) the Court’s capacity to address violations of non‑intervention and sovereignty; (ii) the availability of provisional measures to prevent ongoing harm; and (iii) the international responsibility of a State for actions (and omissions) that interfere with another State’s domestic jurisdiction and legal order. Relevance to Ecuador v. Mexico: Nicaragua v. United States provides persuasive authority on core principles Ecuador invokes — non‑intervention, respect for territorial sovereignty and domestic legal processes, and state responsibility for interference — and on remedies (cessation, reparation) and provisional protection. The decision’s reasoning about unlawful interference and the duty to cease wrongful acts supports Ecuador’s argument that sheltering a national in an embassy and granting asylum to frustrate enforcement of criminal judgments can amount to internationally wrongful intervention and misuse of diplomatic facilities. The case also shows that treaty breaches and obligations under customary international law can be adjudicated together and that the Court may indicate provisional measures where urgent interference with sovereignty and judicial processes is alleged.","keyPoints":["Confirmed that use of force and intervention in another State’s domestic affairs violate customary international law and give rise to state responsibility","Ordered immediate cessation of wrongful acts and affirmed availability of provisional measures to protect territorial sovereignty and prevent ongoing injury","Rejected invocation of collective self‑defence where facts do not meet legal thresholds, reinforcing strict limits on justifications for interference","Demonstrated that treaty obligations and customary rules can be enforced concurrently, with reparations and cessation as primary remedies","Provides a precedent to argue that sheltering or enabling removal of a convicted national from the receiving State’s jurisdiction can constitute unlawful intervention, misuse of diplomatic premises, and ground for provisional measures and reparation"]},{"filename":"Convention on Diplomatic Asylum (Caracas Convention, 1954).pdf","shortTitle":"Convention On Diplomatic Asylum (Caracas Convention)","date":"03/28/1954","type":"other document","shortSummary":"Multilateral treaty of the Organization of American States setting rules for diplomatic asylum in legations, warships and military camps, including limits on asylum for persons accused or convicted of common crimes. It defines procedures (notification, safe-conduct, transit, duration, and limitations) and reserves certain discretionary powers to the asylum-granting State.","detailedSummary":"The Convention on Diplomatic Asylum (Caracas Convention) governs when and how diplomatic asylum may be granted by a party State in its legations, warships or military camps and the obligations this creates vis-à-vis the territorial (receiving) State. Key provisions: Article I confirms that diplomatic asylum must be respected subject to the Convention; Article III bars asylum for persons who at the time of request are under indictment, on trial for common offences, or have been convicted by regular courts unless the acts are clearly political; Article V limits asylum to urgent cases and only for the period strictly necessary to obtain safe-conduct for departure; Article VIII requires prompt notification to the territorial State; Article IX directs the asylum-granting official to consider information furnished by the territorial government and states that the decision to continue asylum or to ask safe-conduct shall be respected; Article XII and XIII create an obligation for the territorial State to grant immediate guarantees and a safe-conduct (absent force majeure) to permit departure; Article XVII limits return of the asylee and sets rules on preventive surveillance and costs; Article XVIII forbids asylees from acting against public peace or interfering in internal politics; Article XIX addresses rupture of relations and transfer of asylees; and Article XX confirms that asylum is non‑reciprocal and applies to any nationality. The Convention also contemplates that the State granting asylum retains discretion (Article IV) and may unilaterally assess urgency (Articles V–VII), while also requiring respect for the territorial State’s information and rights. Several States made reservations or declarations on scope and procedural points. Both Ecuador and Mexico are parties (Ecuador ratified 1955; Mexico ratified 1957), so the Convention is directly relevant between them.","keyPoints":["Article III: asylum is not lawful for persons under indictment, on trial for common offenses, or convicted by regular courts unless the acts are clearly political","Procedural obligations: prompt notification to the territorial State (Art. VIII), consideration of information from the territorial State (Art. IX), and the territorial State’s duty to grant safe-conduct and guarantees for departure (Arts. XII–XIII)","Temporal and substantive limits: asylum only in urgent cases and only for the period strictly necessary to secure departure (Arts. V–VII), and prohibition on asylees interfering in internal politics (Art. XVIII)","Disposition of responsibility on rupture of relations and transfer (Art. XIX) and non-reciprocity/applicability to any nationality (Art. XX)","Treaty leaves some discretion to asylum-granting State (Art. IV) but requires respect for procedural duties and for the territorial State’s information (Art. IX)"]},{"filename":"1951 Refugee Convention.pdf","shortTitle":"Convention Relating To The Status Of Refugees","date":"1951 (Protocol 1967)","type":"other document","shortSummary":"The 1951 Convention (with the 1967 Protocol) defines who is a refugee and sets out core rights and protections (notably non-refoulement, non‑penalization, and minimum standards of treatment). Its exclusion clauses bar Convention protection for persons guilty of serious non‑political crimes or acts contrary to UN purposes.","detailedSummary":"The 1951 Convention (and the 1967 Protocol removing temporal/geographic limits) is the primary international instrument defining refugee status and the minimum protections States must afford refugees. Key provisions: Article 1 defines a refugee as a person with a well‑founded fear of persecution for race, religion, nationality, membership of a particular social group or political opinion; Articles 31–33 protect refugees from penalties for illegal entry and prohibit expulsion or return (non‑refoulement); Articles 2–34 set out treatment standards (access to courts, employment, travel documents, social security, education, etc.). Importantly, Article 1 contains exclusion clauses: the Convention does not apply to persons for whom there are serious reasons for considering they committed war crimes, crimes against humanity, serious non‑political crimes, or acts contrary to the purposes and principles of the United Nations. The Convention does not regulate diplomatic or political asylum specifically; regional diplomatic‑asylum instruments and customary rules may be invoked separately. In the context of Ecuador v. Mexico, the Convention is relevant because (i) Mexico may attempt to characterize Mr. Glas as an asylum‑seeker or refugee entitled to protection; (ii) Ecuador will rely on the Convention’s definition and exclusion clauses to argue that Glas is ineligible for Convention protection because he was convicted of and is being prosecuted for ordinary (non‑political) corruption offences; and (iii) although the Convention protects refugees against penalties for illegal entry, that protection does not extend to persons excluded by Article 1(f). Thus the Convention supports Ecuador’s position that Mexico’s sheltering and removal of Glas cannot be justified under refugee law and that Mexico had no Convention‑based right to prevent Ecuadorian enforcement of its criminal judgments. Conversely, Mexico could attempt (less persuasively under the Convention) to rely on non‑refoulement or non‑penalization norms if it tried to show Glas faced persecution rather than ordinary criminal prosecution—but the exclusion clauses and the facts of final convictions for corruption will be central to rebut that claim. Finally, while the 1951 instrument requires cooperation with UNHCR and sets travel‑document standards, it does not override obligations under the Vienna Convention on Diplomatic Relations concerning use of mission premises; Ecuador can therefore combine refugee‑law arguments (ineligibility under Article 1) with diplomatic law claims that Mexico misused its mission.","keyPoints":["Article 1 defines refugees and contains exclusion clauses excluding those guilty of serious non‑political crimes or acts contrary to UN purposes (central to assessing Glas’s eligibility)","Articles 31–33 protect refugees from penalties for illegal entry and prohibit refoulement, but these protections do not apply to excluded persons","Convention sets minimum treatment standards (access to courts, travel documents, social benefits) and envisages State cooperation with UNHCR, but it does not create a general right of diplomatic asylum or permit use of embassy premises to evade local criminal justice","In Ecuador v. Mexico the Convention can be used to show (a) Glas is not entitled to refugee protection because he faces convictions and prosecutions for common corruption offences, and (b) Mexico cannot lawfully rely on refugee law to justify shielding him from Ecuadorian criminal enforcement","The Convention complements — but does not displace — Vienna Convention rules on diplomatic premises; combined legal arguments strengthen Ecuador’s claim that Mexico unlawfully interfered with Ecuador’s criminal jurisdiction"]},{"filename":"Democratic Republic of the Congo v. Uganda (2005).pdf","shortTitle":"Democratic Republic Of The Congo v. Uganda","date":"1999–2022","type":"icj judgement","shortSummary":"The ICJ found Uganda internationally responsible for unlawful use of force, occupation-related violations (including humanitarian and human-rights breaches), and pillaging of natural resources on the territory of the DRC, and later fixed reparations for those internationally wrongful acts. The Court also found the DRC liable for certain violations of the Vienna Convention on Diplomatic Relations in relation to attacks on Ugandan diplomatic premises.","detailedSummary":"The DRC filed cases against Uganda (and initially against other States) alleging armed aggression, unlawful use of force, violations of sovereignty, and exploitation of Congolese resources. The Court concluded that Uganda’s military presence in the DRC from 1998 was not consented to (except for a narrow border exception) and that Uganda could not lawfully rely on self-defence. Uganda was held responsible for acts of occupation in parts of the DRC (e.g., Ituri), for failing to restore and ensure public order under Article 43 of the 1907 Hague Regulations, and for serious violations of international humanitarian and human-rights law committed by its forces. The ICJ found credible evidence of looting and exploitation of natural resources by UPDF personnel and attributed those acts to Uganda, while rejecting a finding of a governmental policy to exploit resources for state benefit. Uganda’s counter-claims were mostly dismissed, except that the Court found the DRC responsible for violations of the Vienna Convention on Diplomatic Relations in relation to attacks and the removal of property from the Ugandan Embassy. The Court reserved questions of reparation, later organized expert appraisal and hearings, and ultimately ordered monetary reparations in 2022 after negotiations failed.","keyPoints":["State responsibility for unlawful use of force and non-consensual military presence: the Court found Uganda’s military intervention a grave breach of the UN Charter where consent was absent and lawful self-defence was not established.","Attribution and occupation duties: Uganda was held responsible for actions of its forces, including violations of humanitarian and human-rights law, and for failing to fulfil occupation obligations under Article 43 of the Hague Regulations.","Diplomatic protections upheld: the Court found breaches of the Vienna Convention where a receiving State failed to protect diplomatic premises/personnel and where property and archives were removed.","Reparations framework: the Court reserved and later determined reparations, using expert evidence to quantify harm (human losses, property, natural resources) and imposing a structured payment regime."]},{"filename":"Alleged Violations of Sovereign Rights and Maritime Spaces (Nicaragua v. Colombia, 2022).pdf","shortTitle":"Alleged Violations Of Sovereign Rights And Maritime Spaces (Nicaragua v. Colombia)","date":"2013-2022","type":"icj judgement","shortSummary":"The ICJ adjudicated a dispute in which Nicaragua alleged Colombia violated Nicaragua’s sovereign rights and maritime zones as determined in the Court’s 2012 judgment, and found that Colombia had breached Nicaragua’s rights in its exclusive economic zone. The case also addressed jurisdiction under the Pact of Bogotá, admissibility of counterclaims, and remedies for internationally wrongful acts.","detailedSummary":"Nicaragua brought proceedings alleging Colombia had violated the sovereign rights and maritime zones earlier awarded to Nicaragua by the Court and had threatened force to implement the alleged violations. Nicaragua relied principally on Article XXXI of the 1948 Pact of Bogotá for jurisdiction; Colombia raised preliminary objections which the Court rejected in 2016, confirming jurisdiction under the Pact. Colombia filed multiple counterclaims; the Court found some inadmissible and others admissible, delineating standards for counterclaim admissibility and the scope of the dispute. After hearings, the Court’s 2022 merits judgment held that Colombia had violated Nicaragua’s sovereign rights and jurisdiction in its EEZ and addressed remedies. The judgment is significant for its treatment of: (1) the Pact of Bogotá as a basis for compulsory ICJ jurisdiction over inter-American disputes; (2) the Court’s approach to disputes about alleged non-compliance with its own prior judgments; (3) criteria for admissibility of counterclaims that arise in related proceedings; and (4) the characterization of conduct as an internationally wrongful act affecting sovereign rights and entitlement to reparation.","keyPoints":["Court affirmed jurisdiction under Article XXXI of the Pact of Bogotá to decide disputes about alleged violations of rights previously declared by the Court, and to address compliance-related controversies","Judgment clarifies standards for admissibility of counterclaims in inter-state proceedings and separates claims that fall within the Court’s seisin from those that do not","Court found concrete breaches of sovereign rights in the EEZ and affirmed State responsibility principles and entitlement to reparation for internationally wrongful acts","The case demonstrates the ICJ’s willingness to examine allegations of unlawful State conduct that intrudes on another State’s sovereign prerogatives and to provide binding remedies"]},{"filename":"Asylum (Colombia v. Peru) — Asylum Case (ICJ, 1950).pdf","shortTitle":"Asylum (Colombia v. Peru)","date":"11/20/1950","type":"icj judgement","shortSummary":"The ICJ held that a State granting diplomatic asylum may not unilaterally determine that an offence is political in a manner binding on the territorial State, and that the territorial State is not automatically obliged to grant safe conduct; the Court found Colombia had violated the Havana Convention. The Court also stressed that the political character of the offence must be established by evidence.","detailedSummary":"Facts and issues: In 1949 Colombia sheltered Victor Raúl Haya de la Torre, a Peruvian national, in its embassy in Lima and granted him diplomatic asylum. Peru contended the offence was a common crime (instigation to rebellion) and that Colombia could not unilaterally characterize it as political to justify asylum. The Court was asked whether the asylum-granting State could unilaterally qualify the offence as political and whether the territorial State was bound to grant safe conduct.\n\nHoldings: The Court answered both questions negatively. It held that: (1) a unilateral qualification by the asylum-granting State that an offence is political cannot be binding on the territorial State — whether an act is political or common is not for the asylum State alone to decide in a way that derogates from the territorial State's sovereignty; (2) the territorial State is not automatically obliged to afford guarantees (such as safe conduct) merely because asylum is claimed; (3) the political nature of the offence must be demonstrated by the asylum claimant/state and cannot be presumed; and (4) on the facts, Colombia breached the Havana Convention by granting asylum in the circumstances of the case. The Court nevertheless observed that Peru had not established that Haya de la Torre had committed a common crime.\n\nLegal reasoning and principles: The judgment emphasizes limits on diplomatic asylum as a derogation from territorial sovereignty, requires an objective assessment of whether offences are 'political', and treats treaty rules (Havana Convention) and customary principles as constraints on the asylum-granting State.\n\nHow it can be used in Ecuador v. Mexico: The Asylum judgment is directly on point. Ecuador can rely on the ICJ's principle that the State granting diplomatic asylum cannot unilaterally and conclusively recharacterize offences as political so as to withdraw a person from the territorial State’s criminal jurisdiction. Ecuador may argue (following Asylum) that Mexico's announcement that Mr. Glas received \"political asylum\" does not bind Ecuador unless Mexico proves the political character of the offences. The judgment also supports Ecuador's position that diplomatic asylum that removes a person convicted or under indictment for common offences constitutes a derogation from Ecuador’s sovereignty and is unlawful absent a firm treaty basis and demonstrable political character. Finally, Asylum supports Ecuador’s contention that the territorial State is not automatically required to provide safe conduct and that an asylum-granting State must respect limits in the applicable asylum conventions; where those conventions prohibit asylum for common crimes (as in the Montevideo and Caracas/Caracas-type provisions Ecuador invokes), Mexico’s actions would amount to a breach similar to Colombia’s in Asylum.","keyPoints":["The asylum-granting State cannot unilaterally and conclusively qualify an offence as political in a way that binds the territorial State","Granting diplomatic asylum is a derogation from the sovereignty of the territorial State and therefore subject to strict legal limits and treaty rules","The territorial State is not automatically obliged to grant safe conduct; the political character of the offence must be proven","Where asylum treaties prohibit asylum for common crimes, a diplomatic grant of asylum to someone convicted or under indictment for corruption can be unlawful","Asylum supports Ecuador's arguments that Mexico's unilateral grant of asylum and use of embassy premises to shield a convicted national interfered with Ecuador's criminal jurisdiction and violated relevant asylum and diplomatic-law limits"]},{"filename":"Rainbow Warrior Arbitration (New Zealand v. France, 1990).pdf","shortTitle":"Rainbow Warrior","date":"04/30/1990","type":"other court case","shortSummary":"Arbitral tribunal between New Zealand and France arising from France’s 1985 sabotage of the Greenpeace vessel Rainbow Warrior and the subsequent transfer and repatriation of French agents placed under a mediation agreement. The tribunal found France in breach of its treaty obligations in relation to the agreed terms for custody and return of the agents and addressed available defences (force majeure, distress, necessity).","detailedSummary":"Facts and decision: French agents carried out a covert operation in New Zealand (1985) that sank the Rainbow Warrior and caused a death. Two agents were arrested and sentenced in New Zealand. Following UN mediation, New Zealand and France concluded an exchange of letters (9 July 1986) requiring France to pay compensation and to transfer the agents to an isolated French base on Hao for at least three years. After medical evacuations and repatriations of the agents without New Zealand’s consent, New Zealand invoked the agreement’s arbitration clause. The arbitral tribunal examined whether France breached its obligations and whether circumstances excluding wrongfulness (force majeure, distress, necessity) applied. The tribunal: - rejected force majeure as inapplicable; - defined strict conditions for distress (extreme, urgent threat to life or physical integrity, good-faith attempts to secure consent, and restoration of the prior situation once emergency passed); - applied those criteria to find France had not acted in conformity with the agreement (material breaches in failing to return and in removing an agent without proper consent); - held that the agreement’s obligations had a temporal limit, so certain remedies sought (return orders) were no longer appropriate by the time of the award; - recognized non-material damage and endorsed declaratory relief and conciliatory measures rather than further monetary awards in the circumstances. Relevance to Ecuador v. Mexico: The Rainbow Warrior arbitration is directly relevant on points of (a) misuse of diplomatic premises and (b) state responsibility for breaches of treaty or international obligations despite characterizations of humanitarian or political necessity. The tribunal’s careful treatment of excluding circumstances (force majeure, distress, necessity) provides a precedent for narrowly construing such defences and for requiring: objective evidence of immediate and grave risk, prompt notification and good-faith attempts to obtain the other State’s consent, and restoration to the prior situation when the emergency ends. Applied to Ecuador v. Mexico, Rainbow Warrior supports Ecuador’s legal arguments that (1) sheltering a convicted national in an embassy and purporting to grant asylum to remove him from domestic jurisdiction is an intervention in the receiving State’s sovereignty and incompatible with Vienna Convention duties; (2) humanitarian or medical justifications cannot be invoked to excuse non-compliance unless they meet strict, demonstrable criteria (urgent threat, prior consultation, and restoration); and (3) remedies for treaty breaches include declaratory relief, satisfaction and measures to repair relations even where coercive remedies (e.g., forced return) may be impracticable. Practically, Ecuador can cite Rainbow Warrior to argue the Tribunal should (i) narrowly scrutinize Mexico’s claimed grounds for removing or protecting Mr. Glas, (ii) require evidence that Mexico made timely, good-faith requests and allowed Ecuador participation in any medical or security assessments, and (iii) find Mexico internationally responsible for using diplomatic premises incompatibly with their functions and for obstructing Ecuador’s judicial process, while seeking appropriate declaratory, restitutive or conciliatory remedies.","keyPoints":["Rainbow Warrior establishes strict criteria for excluding wrongfulness (force majeure, distress, necessity): objective, urgent threat; prompt good-faith consultation; restoration to prior compliance.","The tribunal treated misuse of agreements and failure to obtain consent as material breaches even when domestic or humanitarian justifications were invoked.","Relief for treaty breaches can be declaratory and conciliatory when coercive measures are impracticable; non-material damage is recognised and may warrant satisfatory measures.","The case supports narrow judicial scrutiny of claims that diplomatic protection or asylum justified interference with the receiving State’s criminal jurisdiction and underlines duties under the Vienna Convention to avoid using mission premises in ways incompatible with their functions."]}]