[
  {
    "filename": "Vienna Convention on the Law of Treaties (1969).pdf",
    "shortTitle": "Vienna Convention on the Law of Treaties",
    "date": "1969–1980",
    "type": "other document",
    "shortSummary": "The Vienna Convention codifies the rules for conclusion, interpretation, amendment and termination of treaties between States. In Ecuador v. Mexico, the Convention supplies the legal methodology for interpreting the asylum, diplomatic and anti‑corruption treaties Mexico invokes or is alleged to have breached and for assessing whether Mexico’s acts are compatible with those treaty obligations.",
    "detailedSummary": "Overview and core rules relevant to Ecuador v. Mexico\n- Core principles: pacta sunt servanda (Art. 26) and good faith; non‑retroactivity (Art. 28); territorial scope (Art. 29); and the duty not to defeat a treaty’s object and purpose prior to entry into force (Art. 18). These principles frame the starting point that States must perform treaty obligations in good faith and cannot rely on domestic law to avoid them (Art. 27).\n- Interpretation rules: the Convention’s general rule of interpretation (Art. 31) requires interpretation in good faith, giving ordinary meaning in context and in light of the treaty’s object and purpose; subsequent agreement and subsequent practice (Art. 31(3)) and preparatory work (Art. 32) are admissible supplementary means. When multiple authentic texts exist, the text best reconciling them with the object and purpose is preferred (Art. 33).\n- Treaties and third States: Articles 34–37 govern when treaty provisions create rights or obligations for non‑parties and confirm that, ordinarily, a treaty does not bind third States without their consent (but may create rights for third States if the parties intended that result and the third State assents — Art. 36).\n- Successive and conflicting treaties: Article 30 determines which treaty prevails where later and earlier treaties address the same subject matter; Article 41 permits modification of a multilateral treaty between some parties only in narrow circumstances. Article 60 defines consequences of material breach (including possible suspension or termination).\n- Dispute procedures and remedies: Part V (Arts. 65–67) prescribes notification procedures and available dispute settlement routes for claims concerning invalidity, termination or other treaty issues, including referral to judicial or conciliation mechanisms under defined conditions.\nHow the Convention applies to the case at bar (Ecuador v. Mexico)\n- Method of treaty interpretation: Ecuador will rely on Art. 31 and 32 to interpret the Caracas Convention (1954), Montevideo Convention (1933), Vienna Convention on Diplomatic Relations (1961) and the anti‑corruption conventions in the light of their object and purpose (preventing misuse of diplomatic premises, excluding asylum for common crimes, and promoting cooperation against corruption). Ecuador can use the text, the preambles, the parties’ subsequent practice (diplomatic notes, exchanges, OAS resolution) and preparatory materials to show that Mexico’s purported “asylum” for a person convicted of common crimes is incompatible with treaty terms and object and purpose.\n- Good faith and “defeating” treaty purposes: Article 18 and Art. 26 support Ecuador’s contention that Mexico may not take acts which defeat the object and purpose of treaties it is bound by (e.g., using diplomatic premises to avoid criminal jurisdiction or to frustrate cooperation obligations under anti‑corruption treaties). Mexico’s press announcements and actions can be characterized as inconsistent with treaty performance in good faith.\n- Conflicts among treaties and obligations to third States: Article 30 helps assess interactions among overlapping instruments (e.g., Vienna Convention on Diplomatic Relations vs. regional asylum conventions vs. anti‑corruption instruments). Articles 34–36 guide claims involving treaty rights or obligations vis‑à‑vis third States (Ecuador may argue the anti‑corruption treaties create obligations to cooperate that are directly applicable between the parties).\n- Material breach and consequences: If the Court finds Mexico’s conduct to contravene provisions essential to a treaty’s object and purpose, Article 60 provides the framework for considering suspension, termination or other legal consequences; Ecuador may invoke material breach as legal basis for remedies.\n- Procedural path for treaty disputes: Arts. 65–67 provide the procedural sequence for notice and dispute settlement Ecuador can use to show that diplomatic exchanges, failure to cooperate, and subsequent actions gave rise to a treaty dispute properly submitted to the Court.\nPractical evidentiary and argument strategies under the Convention\n- Rely on Art. 31(1) to argue that ordinary meaning and object/purpose foreclose a broad reading of “asylum” that would include shielding persons convicted of ordinary crimes.\n- Use subsequent practice and the parties’ diplomatic notes (Art. 31(3)(b)) — the detailed verbales and press statements — to show that Mexico’s own practice and contemporaneous communications do not support its construction of treaty rights to shelter a convicted national who faces arrest for common crimes.\n- Invoke Art. 18 (obligation not to defeat object and purpose) to argue temporary acts (use of embassy premises) that frustrate enforcement of criminal sentences and mutual‑assistance obligations under anti‑corruption instruments are unlawful even if a formal amnesty/asylum declaration is later attempted.\n- Apply Art. 30 to reconcile obligations under multiple treaties (showing that the asylum conventions’ clear exclusions for common crimes prevail as between parties that are also bound by Vienna Convention norms on mission functions and inviolability).\n- If Mexico claims conflicting treaty rights, use the VCLT rules on third‑state rights (Arts. 34–36) to demonstrate whether anti‑corruption treaties or the Caracas/Montevideo provisions create direct rights/obligations between Ecuador and Mexico and how those should be enforced.\nLimitations and cautions\n- VCLT governs legal methodology; it does not itself create the substantive prohibitions Ecuador invokes (those come from the specific asylum, diplomatic and anti‑corruption treaties and from customary international law). The Convention is a tool to interpret and apply those instruments and to define remedies for breach.\n- Where Mexico argues customary rules or national constitutional protections, Ecuador must show consistency with treaty interpretation (Arts. 27 and 31) and resist domestic‑law defenses (Art. 27).\nConclusion\nThe Vienna Convention provides the Court with the authoritative interpretive framework and procedural rules Ecuador needs to: (1) read the relevant asylum, diplomatic and anti‑corruption treaties in light of their object and purpose; (2) rely on subsequent practice and communications to demonstrate the ordinary meaning and parties’ common understanding; (3) determine whether Mexico’s conduct amounted to a material breach with legal consequences; and (4) establish that the dispute over treaty application is properly before the Court under the Convention’s dispute procedures.",
    "keyPoints": [
      "Article 31 (good‑faith interpretation in context and in light of object and purpose) is central to construing the asylum, diplomatic and anti‑corruption treaties at issue",
      "Article 18 (obligation not to defeat a treaty’s object and purpose) and Article 26 (pacta sunt servanda) support Ecuador’s claim that Mexico must perform treaty obligations in good faith and cannot use diplomatic premises to frustrate enforcement",
      "Articles 34–36 govern when treaty provisions affect third States and are relevant to whether anti‑corruption and asylum rules create direct obligations between Ecuador and Mexico",
      "Article 30 helps resolve conflicts among overlapping treaties (e.g., Vienna Convention on Diplomatic Relations vs. regional asylum conventions); Article 60 provides the framework for legal consequences of material breach",
      "Articles 65–67 describe the required notification and dispute settlement procedures and support Ecuador’s use of the Court to resolve treaty interpretation and application disputes"
    ]
  },
  {
    "filename": "Articles on Responsibility of States for Internationally Wrongful Acts (ILC Articles : ARSIWA, 2001).pdf",
    "shortTitle": "Responsibility Of States For Internationally Wrongful Acts",
    "date": "2001",
    "type": "other document",
    "shortSummary": "The International Law Commission’s ARSIWA (2001) sets the legal framework for state responsibility: when state conduct is attributable and breaches an international obligation, the State incurs responsibility and must cease the act and make reparation. It identifies rules on attribution, breaches, circumstances precluding wrongfulness, and legal consequences (cessation, guarantees of non-repetition, restitution, compensation, and satisfaction).",
    "detailedSummary": "Relevance of ARSIWA to Ecuador v. Mexico and lines of argument Ecuador can deploy under the ILC Articles (ARSIWA):\n\n1. Establishing an internationally wrongful act (Articles 1–3, 12–15)\n- Article 2 requires (a) attribution of the conduct to Mexico and (b) a breach of an international obligation. Ecuador can argue that Mexico’s sheltering of Mr. Glas in its embassy, refusal to surrender him and public grant of asylum (with the aim of removing him from Ecuador) satisfy both elements: Mexican conduct is attributable to the State and breaches obligations under the Vienna Convention (Article 41) and the asylum conventions (Montevideo/Caracas) and obligations of non-intervention.\n- Article 3 supports Ecuador’s point that domestic characterizations (e.g., Mexico’s internal asylum determinations) cannot negate the international characterization of the acts as wrongful.\n- Articles 14–15 address temporal aspects: Ecuador can treat Mexico’s conduct as continuing (presence/refusal from 17 Dec 2023 until removal attempt/related acts), so breach extends for that period.\n\n2. Attribution (Articles 4–11)\n- Article 4 covers acts by any State organ. The presence and decisions concerning Mr. Glas involved Mexico’s embassy and notes/press releases by Mexico’s Foreign Ministry and Head of State, which are attributable as acts of State organs.\n- Article 7 (excess of authority) means even if embassy staff exceeded instructions, their acts remain attributable. Article 11 (acknowledgement/adoption) covers later official pronouncements adopting the embassy’s conduct.\n\n3. Breach of international obligations (Articles 12; Articles 20–21 for defences)\n- Article 12 confirms breach exists when conduct departs from what the obligation requires. Ecuador can show breaches of: (i) Article 41 VCDR obligations (respect local laws, not interfere, not use premises incompatibly); (ii) Montevideo/Caracas asylum rules prohibiting asylum for those prosecuted/convicted for common crimes; (iii) treaty obligations to cooperate on anti-corruption (Inter-American Convention; Merida Convention); and (iv) the non-intervention principle under the UN/OAS Charters (customary law).\n- Ecuador should anticipate and rebut potential defenses: ARSIWA Chapter V limits precluding wrongfulness to strict conditions. Mexico could attempt to rely on asylum or necessity/distress — Articles 20–25 show these are narrowly applicable: consent, self-defence, force majeure, distress, necessity all require stringent elements not present here (e.g., necessity requires grave and imminent peril to essential interest and not to have contributed to situation). Article 26 bars invoking circumstances to justify acts contrary to peremptory norms; non-intervention and diplomatic obligations approach jus cogens weight in practice.\n\n4. Consequences and remedies (Part Two: Articles 28–39)\n- Article 30 obliges cessation and guarantees of non-repetition — Ecuador can request the Court to order Mexico to cease use of mission to shield nationals and give assurances. Article 31 and 34–37 set reparation modalities: restitution (where feasible), compensation for material/moral injury, and satisfaction (acknowledgment/apology) — Ecuador can seek declarations, assurances, and reparations proportionate to the injury to sovereignty and judicial function. Article 32 prevents Mexico from invoking internal law to excuse non-performance.\n\n5. Invocation, injured State and countermeasures (Part Three: Articles 42–54)\n- Article 42 plainly entitles Ecuador as an injured State to invoke Mexico’s responsibility for obligations owed to Ecuador individually (non-interference, respect for laws and jurisdiction). Article 43 requires notice of claim — Ecuador’s diplomatic notes satisfy this prerequisite. If Ecuador contemplates countermeasures, ARSIWA articles 49–53 outline lawful limits: proportionate, non-forcible, respecting human-rights and diplomatic inviolability; Ecuador must show it complied with requirements to call upon Mexico to perform and offer negotiation prior to countermeasures (Article 52).\n\nPractical argument structure for Ecuador at the ICJ:\n- Prove attribution: embassy acts and statements by Mexican organs are Mexican State acts (Articles 4,7,11). \n- Prove breach: link those acts to specific treaty and customary obligations (Article 12), emphasizing incompatibility with Article 41 VCDR and the asylum conventions and obligations to cooperate on anti-corruption. \n- Reject defenses: show no lawful circumstance precluding wrongfulness applies (Articles 20–25). \n- Identify remedies: request cessation, assurances of non-repetition (Article 30), and appropriate reparation including satisfaction (Articles 31,34–37). \n- Procedural: confirm Ecuador is an injured State under Article 42 and fulfilled notice requirements of Article 43 (supported by diplomatic notes and exchanges annexed to the Application).",
    "keyPoints": [
      "ARSIWA requires attribution plus breach: Mexico’s embassy acts and official pronouncements are attributable state conduct and can be shown to breach VCDR Article 41 and asylum conventions",
      "ARSIWA’s narrow defenses (consent, necessity, distress, force majeure) are unlikely to preclude wrongfulness here; Mexico’s political asylum claim does not meet those strict conditions",
      "Legal consequences under ARSIWA: Ecuador can seek cessation, guarantees of non-repetition, restitution/compensation and satisfaction for injury to its sovereignty and judicial order",
      "ARSIWA Articles 42–44 confirm Ecuador’s standing as an injured State and validate Ecuador’s diplomatic notices and claims prior to invoking the Court’s jurisdiction",
      "If Ecuador contemplates countermeasures ARSIWA limits require proportionality, prior demand/negotiation, and respect for peremptory norms and diplomatic inviolability"
    ]
  },
  {
    "filename": "Treaty of Peace, Friendship, Commerce, and Navigation (1888).pdf",
    "shortTitle": "Treaty Of Peace, Friendship, Commerce, And Navigation",
    "date": "1888",
    "type": "other document",
    "shortSummary": "An 1888 treaty on peace, friendship, commerce and navigation reflects 19th‑century state practice on diplomatic relations, treatment of foreigners, and limits on the use of diplomatic premises. In the Ecuador v. Mexico context, it can be offered as historical evidence of customary rules on asylum, non‑intervention, and proper uses of missions.",
    "detailedSummary": "The 1888 Treaty Of Peace, Friendship, Commerce, And Navigation (and contemporaneous commercial/diplomatic treaties of the late 19th century) sets out reciprocal obligations between States concerning the treatment and protection of foreign nationals, the privileges and immunities of diplomatic and consular agents, and limitations on special privileges such as asylum or sanctuary. Although phrased in the language of bilateral commerce-and-navigation agreements, these treaties are useful in an ICJ proceeding as evidence of historical State practice and opinio juris bearing on: (a) the scope and limits of inviolability and the legitimate functions of diplomatic premises; (b) the principle that diplomatic privileges do not authorize interference in the receiving State’s domestic criminal enforcement; and (c) obligations to surrender or not shelter persons accused or convicted of ‘common offences’. In Ecuador v. Mexico, Ecuador can rely on the treaty (and similar instruments from the same era) to show that longstanding international practice rejected the use of legations or consular premises to shield persons convicted of ordinary crimes and that States have historically recognized limits on diplomatic asylum. The treaty therefore supports Ecuador’s arguments that Mexico’s sheltering and attempted removal of a national convicted and subject to arrest warrants constituted an improper derogation from Ecuador’s territorial sovereignty and from the proper functions of a mission. Practically, the 1888 instrument would be pleaded not as a directly applicable modern treaty between the Parties but as corroborative historical evidence that informs the content of customary international law and the ordinary meaning of contemporary treaty terms (for example, the Vienna Convention’s Article 41 obligations, and regional asylum conventions invoked by Ecuador). Mexico could counter that earlier treaties sometimes accommodated forms of protection for political refugees and that historical practice is mixed, so the probative weight of a single 1888 treaty is limited; Ecuador should therefore combine it with other regional instruments and later State practice (e.g., Montevideo/Caracas conventions, OAS practice) to demonstrate a continuous rule excluding diplomatic asylum for common crimes and prohibiting misuse of mission premises.",
    "keyPoints": [
      "Historical evidence of limits on diplomatic asylum and the idea that legations should not shield persons convicted of ordinary crimes",
      "Supports the proposition that diplomatic premises must be used only for legitimate mission functions and not to obstruct local criminal justice",
      "Can be used to show long‑standing State practice and opinio juris relevant to customary rules on non‑intervention and respect for territorial sovereignty",
      "Probative value is cumulative: most persuasive when combined with regional asylum conventions, Vienna Convention norms, and subsequent State practice",
      "Defendant may challenge its direct relevance; treat as corroborative historical material rather than a binding modern multilateral source between Ecuador and Mexico"
    ]
  },
  {
    "filename": "Arrest Warrant of 11 April 2000 (Democratic Republic of the Congo v. Belgium).pdf",
    "shortTitle": "Arrest Warrant of 11 April 2000 (Democratic Republic Of The Congo v. Belgium)",
    "date": "2002",
    "type": "icj judgement",
    "shortSummary": "The ICJ held that issuing and internationally circulating an arrest warrant for an incumbent foreign minister violated that minister’s immunity from criminal jurisdiction and inviolability under customary international law, and ordered Belgium to cancel the warrant and notify authorities to whom it had been circulated. The Court framed its reasoning around the functional purpose of immunities, limits on extraterritorial enforcement of domestic criminal law, and appropriate remedies for state-to-state injury.",
    "detailedSummary": "Facts and holding: The case concerned an international arrest warrant issued in Belgium (and circulated through Interpol) for the then-Foreign Minister of the Democratic Republic of the Congo (Mr. Yerodia), charging war crimes and crimes against humanity. The Court found (by majority) that incumbent foreign ministers enjoy full immunity from criminal jurisdiction and inviolability while in office under customary international law, that the mere issue and international circulation of the warrant infringed those immunities and engaged Belgium’s international responsibility, and that Belgium must, by means of its own choosing, cancel the warrant and inform the authorities to whom it had been circulated. Jurisdiction and admissibility objections were rejected. Reasoning: The Court grounded its conclusion on (1) the functional rationale of immunities — protecting the performance of high-ranking officials’ functions and the conduct of international relations — and (2) an examination of treaty materials and state practice showing no established exception to incumbent ministers’ immunities before national courts (even for atrocity crimes) as a matter of customary law. The Court distinguished the question of national courts’ assertion of universal jurisdiction (which it largely avoided deciding in the operative part) from the separate question of immunity, explaining that jurisdictional expansion does not ipso facto negate immunities. Remedies: The Court treated its findings as satisfaction for the moral injury to the Congo but additionally ordered Belgium to cancel the arrest warrant, as the unlawful instrument itself remained extant. Separate and dissenting opinions stressed (variously) the need to address universal jurisdiction (or not), concerns about impunity for international crimes, the evidentiary basis for a customary rule of ministerial immunity, and the practical effect of the remedy ordered. Key jurisprudential points: the decision affirms (i) inviolability and full immunity from foreign criminal process for incumbent foreign ministers as a rule of customary international law, (ii) limits on the extraterritorial effects of domestic criminal measures when they operate against high-ranking foreign officials, (iii) the Court’s willingness to provide remedial relief against a wrongful state act (including ordering cancellation of instruments), and (iv) the Court’s careful distinction between jurisdiction, immunity and remedies while recognizing the normative tension between immunities and accountability for serious international crimes.",
    "keyPoints": [
      "Affirmation of customary-law immunity and inviolability for incumbent foreign ministers from foreign criminal jurisdiction, grounded in functional necessity to perform state duties",
      "Issuing and internationally circulating an arrest warrant against an incumbent foreign minister violated the receiving State’s obligation to respect inviolability and engaged international responsibility; Court ordered cancellation of the warrant",
      "Court distinguished the questions of (i) national courts’ jurisdiction (including universal jurisdiction) and (ii) immunity — jurisdictional expansion does not by itself negate immunity",
      "The Court will fashion remedies against unlawful state acts between States (including requiring cancellation/recall of unlawful instruments) even where individual criminal accountability remains a separate issue",
      "The judgment highlights the Court’s methodology: reliance on treaty guidance, state practice and opinio juris, and careful treatment of competing values (immunity vs accountability) — with separate opinions underscoring unresolved tensions and limits of the ruling"
    ]
  },
  {
    "filename": "Julian Assange : Ecuadorian Embassy (London) matter (diplomatic-asylum : embassy-inviolability issues).pdf",
    "shortTitle": "Julian Assange Ecuadorian Embassy Matter",
    "date": "2012–2019",
    "type": "other document",
    "shortSummary": "Julian Assange sought and received diplomatic asylum in the Embassy of Ecuador in London (2012–2019), creating a prolonged clash between embassy inviolability under the Vienna Convention and the host State’s obligations to arrest and extradite. The episode exposed legal limits of diplomatic asylum and practical tensions when a receiving State refuses to recognize or facilitate diplomatic asylum.",
    "detailedSummary": "Background: In 2012 Julian Assange entered the Embassy of Ecuador in London to avoid arrest and possible extradition to Sweden and onward to the United States. Ecuador granted him diplomatic asylum and Ecuadorian officials sheltered him inside the embassy. Legal framework: Under the Vienna Convention on Diplomatic Relations (VCDR) embassy premises are inviolable and local police may not enter without the sending State’s consent. Diplomatic asylum (an asylum granted within diplomatic premises) has no universal treaty basis accepted by the UK; recognition of such asylum depends on the receiving State’s consent and relevant regional instruments. Key events and conduct: The UK government insisted on its domestic and treaty obligations to extradite Assange and repeatedly made clear it would arrest him if he left the embassy. The UK threatened—but did not ultimately invoke—the Diplomatic and Consular Premises Act 1987 (which could have withdrawn recognition of the premises and allowed entry). Ecuador refused to surrender Assange, producing a prolonged diplomatic stalemate and heavy political dispute. Legal and practical outcomes: Assange remained inside the embassy for several years; the case demonstrated that diplomatic inviolability can protect an individual physically inside a mission but cannot by itself compel third States to grant safe passage or to recognize diplomatic asylum. It also illustrated that a receiving State may lawfully prioritize its criminal-justice obligations and that the sending State’s use of mission premises for sheltering a convicted or accused local national can create claims of abuse of diplomatic premises and of interference in the receiving State’s internal affairs.\n\nHow this matters for Ecuador v Mexico: The Assange episode supplies persuasive factual and legal analogies for Ecuador’s claims that Mexico misused its embassy by sheltering Jorge Glas. Relevant propositions that Ecuador can draw from Assange include: (1) Embassy inviolability protects a person physically inside a mission but does not authorize the sending State to frustrate the receiving State’s lawful criminal-process obligations or to effect extrication without the receiving State’s consent; (2) diplomatic asylum lacks universal binding effect where the receiving State does not accept it, so a sending State’s unilateral grant of asylum cannot trump the receiving State’s arrest warrants; (3) prolonged sheltering of a receiving-State national inside a mission can amount to interference with the receiving State’s sovereignty and may be incompatible with Article 41 VCDR duties not to use mission premises in a manner incompatible with the mission’s functions; and (4) host-State countermeasures (including declaring persona non grata, withdrawing recognition of premises under domestic law, or lawful policing measures taken when inviolability is removed) are recognized instruments for responding to such abuse. These points support Ecuador’s argument that Mexico’s sheltering of Glas and grant of asylum were not a lawful exercise of diplomatic functions but an unlawful interference and misuse of diplomatic premises, undermining claims that Mexico’s conduct was protected by inviolability or asylum doctrines.",
    "keyPoints": [
      "Embassy inviolability shelters individuals inside mission premises but does not automatically legalize shielding a local national from lawful arrest or prosecution",
      "Diplomatic asylum lacks universal binding force where the receiving State does not accept it; unilateral grants cannot override the receiving State’s criminal-justice obligations",
      "Using embassy premises to prevent enforcement of domestic criminal judgments can amount to misuse of a mission and interference with the receiving State’s sovereignty under Article 41 VCDR",
      "The Assange case demonstrates practical remedies and responses (persona non grata declarations, domestic statutory measures to withdraw premises recognition, or diplomatic rupture) that a receiving State may employ when mission inviolability is abused",
      "Assange provides persuasive analogy supporting Ecuador’s contention that Mexico’s conduct toward Jorge Glas exceeded lawful diplomatic functions and cannot be justified solely by inviolability or claims of asylum"
    ]
  },
  {
    "filename": "Nicaragua v. Honduras (1988).pdf",
    "shortTitle": "Border and Transborder Armed Actions (Nicaragua v. Honduras)",
    "date": "1988",
    "type": "icj judgement",
    "shortSummary": "The ICJ held that it had jurisdiction and that Nicaragua's application was admissible under Article XXXI of the Pact of Bogotá, treating that Article as an autonomous basis for compulsory jurisdiction and examining admissibility obstacles including prior regional procedures. The Court also addressed requirements for conciliation and when an ongoing regional process bars recourse to the Court.",
    "detailedSummary": "The Court unanimously found it had jurisdiction under Article XXXI of the Pact of Bogotá and that Nicaragua's application (filed 28 July 1986) was admissible. Key holdings: (1) Article XXXI of the Pact is an autonomous basis for compulsory jurisdiction between Pact parties and is not automatically altered by unilateral declarations accepting (or modifying) the Court's jurisdiction under Article 36 of the Statute; reservations to jurisdiction must be made as reservations to the Pact itself. (2) Article XXXII (conciliation) and Article XXXI are distinct procedures; prior conciliation is not an immutable prerequisite to seisin under XXXI. (3) On admissibility the Court rejected general objections that the application was political or vague, finding that the Application met Statute and Rules requirements. (4) The Court examined whether regional pacific procedures (the Contadora process) barred recourse to the Court under Article IV of the Pact and concluded that the earlier Contadora phase had, by 28 July 1986, come to a standstill (i.e., was effectively concluded), so Article IV did not bar the seisin. The judgment contains extended reasoning on burden of proof, treaty interpretation (travaux and practice), and separate opinions on nuances of Pact interpretation and procedural fairness.",
    "keyPoints": [
      "Article XXXI of the Pact of Bogotá is an independent, treaty-based basis for compulsory ICJ jurisdiction between Pact parties and is not superseded by unilateral declarations under Article 36 of the Statute",
      "Conciliation under Article XXXII is not necessarily a prerequisite to judicial seisin under Article XXXI; the two articles are autonomous routes to the Court",
      "An application is admissible even if linked to broader regional/political problems so long as it meets the Statute and Rules requirements and is sufficiently particularized",
      "A prior regional pacific procedure bars Court access only while it is continuing; a process that has come to a standstill is effectively ‘concluded’ for Article IV purposes"
    ]
  },
  {
    "filename": "Eritrea v. Ethiopia (Partial Award).pdf",
    "shortTitle": "Eritrea-Ethiopia Claims Commission - Partial Award: Jus Ad Bellum",
    "date": "2005",
    "type": "other court case",
    "shortSummary": "The Eritrea‑Ethiopia Claims Commission (Partial Award, Jus ad Bellum) found Eritrea internationally liable for an unlawful resort to force in May 1998 (attack and occupation of Badme and nearby territory) and set principles on when use of force and claims of self‑defence are lawful. The Commission also addressed limits on what factual findings a tribunal may resolve and the distinction between origins of a conflict and legality of the resort to force.",
    "detailedSummary": "The Partial Award (Jus ad Bellum) held that: Eritrea’s large‑scale attack on May 12, 1998 against Badme and adjacent areas — territory then peacefully administered by Ethiopia — violated Article 2(4) of the UN Charter and gave rise to Eritrean international responsibility. The Commission rejected arguments that (a) a disputed territorial claim alone authorizes force, and (b) localized border clashes involving small patrols constitute an armed attack permitting self‑defence. It emphasized that self‑defence under Article 51 requires an armed attack of sufficient scale and that States must report measures taken in self‑defence to the Security Council. The Commission also explained it had jurisdiction to decide legality of the use of force even where another instrument contemplated fact‑finding on the origins of the conflict, because the latter did not resolve legal questions of jus ad bellum. Finally, the Commission refused to find that subsequent separate attacks were proven to be part of a single pre‑planned offensive. Relevance to Ecuador v Mexico (ICJ, Model UN): the Award supplies useful legal and methodological propositions Ecuador can invoke. Substantively, it supports the proposition that derogations from a receiving State’s sovereignty require a clear legal basis and cannot be justified by mere unilateral claims (here: Mexico’s asserted “asylum”) — just as the Commission rejected territorial‑dispute as a free‑standing justification for force. Methodologically, it underlines the need to distinguish (and prove) the legal character of State conduct (intervention/non‑intervention) from factual disputes about origins or motives; Ecuador can therefore argue that Mexico’s use of its mission to shield a convicted national constitutes an unlawful derogation from Ecuador’s sovereignty and an unlawful interference since no legal basis (under the Caracas/Montevideo Conventions or other rules) lawfully justified that conduct. The Award’s caution about scale and character of wrongful acts is also helpful for Ecuador to show that even non‑military acts (diplomatic shelter plus public statements) may amount to internationally wrongful interference when they remove a person from the territorial State’s jurisdiction or obstruct judicial processes. Finally, the Commission’s focus on State obligations to bring measures to appropriate international fora (e.g., Security Council in cases of self‑defence) and on the centrality of objective legal criteria can be used to argue that Mexico’s unilateral press‑announcement and failure to follow agreed diplomatic channels aggravated the breach and undermines any claim of lawful asylum or permissible diplomatic function.",
    "keyPoints": [
      "Affirms that unilateral derogations from a State’s territorial sovereignty require a clear legal basis; disputed claims do not justify breaking fundamental rules (analogy: misuse of diplomatic premises cannot be justified by asserted asylum)",
      "Establishes that limited or localized incidents do not automatically confer a right of self‑defence — tribunals must assess scale and character of the act (useful to show Mexico’s acts are not lawful exceptions to Ecuador’s sovereignty)",
      "Distinguishes factual origin inquiries from legal adjudication of wrongdoing; emphasizes the need for proof of legal character of State conduct (Ecuador should focus on proving legal elements of intervention and misuse of diplomatic premises)",
      "Reinforces that procedural irregularities (failure to use diplomatic channels, press declarations) and obstructing a receiving State’s law‑enforcement can be relevant indicia of unlawful interference",
      "Demonstrates tribunal practice in attributing international responsibility for violations of core principles (sovereign equality, territorial integrity, non‑intervention) which Ecuador can analogize to Mexico’s sheltering and removal efforts"
    ]
  },
  {
    "filename": "Gabcikovo-Nagymaros Project (Hungary v. Slovakia, 1997).pdf",
    "shortTitle": "Gabcíkovo-Nagymaros Project",
    "date": "1997",
    "type": "icj judgement",
    "shortSummary": "The ICJ held that Hungary unlawfully suspended and abandoned parts of the 1977 treaty project, that Czechoslovakia/Slovakia exceeded its rights by putting a unilateral provisional solution into operation, and that the 1977 Treaty remained in force with continuing obligations and compensation consequences. The Court directed the parties to negotiate in good faith, take account of evolving environmental norms, and settle damages and operational arrangements in accordance with the treaty.",
    "detailedSummary": "The Court found (1) Hungary was not entitled to suspend and abandon works in 1989 in breach of the 1977 Treaty; (2) Czechoslovakia/Slovakia could prepare alternative measures (Variant C) but was not entitled to put the unilateral diversion into operation in October 1992; (3) Hungary’s 1992 notification of termination did not lawfully terminate the Treaty, which continued to bind Slovakia as successor to Czechoslovakia; and (4) both Parties committed internationally wrongful acts and must negotiate in good faith to restore a joint operational regime, give effect to the treaty’s objectives (including evolving environmental standards), and provide compensation for damage. The Court emphasized: treaty obligations persist despite factual change, unilateral derogations are unlawful unless justified under strict treaty-law grounds (e.g., state of necessity narrowly construed), countermeasures must be proportionate, and newly developed norms (here environmental law) may be taken into account in implementing an existing treaty. It also recommended negotiation, equitable settlement (including the possibility of an overall account/cancellation of claims), and compliance with pacta sunt servanda and good-faith performance.",
    "keyPoints": [
      "Unilateral suspension/termination of treaty obligations is not lawful absent narrowly defined legal grounds; treaty continues to bind successor States",
      "A State may take preparatory measures, but putting a unilateral alternative regime into operation can be an internationally wrongful act if it exceeds treaty rights and is disproportionate",
      "States must negotiate in good faith to implement treaty objectives; evolving norms (e.g. environmental law) are relevant to treaty implementation and can be incorporated by agreement",
      "Where both parties commit intersecting wrongful acts, the Court may require compensation but encourage negotiated overall settlements (including offsetting claims)",
      "Countermeasures or unilateral measures must meet strict necessity and proportionality tests; premature or disproportionate unilateral action is condemned and gives rise to responsibility"
    ]
  },
  {
    "filename": "Convention on Political Asylum (Montevideo, 1933) [Conference of American States].pdf",
    "shortTitle": "Convention on Political Asylum",
    "date": "1933",
    "type": "other document",
    "shortSummary": "Regional treaty (Montevideo, 1933) that limits diplomatic/political asylum by prohibiting asylum in legations, warships, military camps or airships for persons accused or convicted of \"common offenses\" and requiring their surrender to local authorities. It clarifies that the granting State judges the political character of the offence but imposes an obligation to surrender where the offence is common.",
    "detailedSummary": "The Convention on Political Asylum (Montevideo, 1933) (hereafter 'Montevideo Convention') (i) replaces the Havana wording on asylum to provide that States shall not grant asylum in legations, warships, military camps or airships to persons accused of or convicted for common offences and that such persons found in those places shall be surrendered as soon as requested by the local government (Article 1); (ii) confirms that the determination whether an offence is political (\"judgment of political delinquency\") is for the State offering asylum (Article 2); (iii) treats political asylum as humanitarian and non‑reciprocal but recognizes limits where States do not accept asylum (Article 3); and (iv) contains procedural/relationship rules (e.g., replacement of a withdrawn diplomatic agent where asylum causes dispute) and standard ratification/entry into force clauses (Articles 4–9). In relation to the dispute before the Court (Ecuador v. Mexico), the Montevideo Convention is directly relevant because it: (a) expressly bars the grant of asylum in diplomatic premises to persons accused of or convicted of \"common offences\" and requires surrender upon request by the local government; (b) therefore supports the proposition that Mexico’s sheltering of an Ecuadorian national convicted of corruption in the Mexican embassy in Quito and its announced grant of asylum were unlawful if those offences are correctly characterised as common (non‑political) offences; (c) provides a treaty basis, alongside the Caracas Convention and the Vienna Convention on Diplomatic Relations, to argue that a sending State used diplomatic premises in a manner incompatible with the functions of the mission and failed to surrender a person who should have been surrendered; and (d) reinforces Ecuador’s claim of unlawful interference with Ecuador’s criminal jurisdiction and non‑intervention in internal affairs. Practical legal uses in the case at bar: (1) Article 1 furnishes a clear textual obligation to surrender persons accused/convicted of common offences who take refuge in diplomatic premises — Ecuador can invoke this to show Mexico breached an explicit treaty duty; (2) because the Convention addresses asylum in legations specifically, it supports Ecuador’s argument that Mexico’s conduct constituted an abuse of diplomatic premises and incompatible use under Article 41 VCDR; (3) the Convention’s regional character and the fact that both Ecuador and Mexico are historically bound by inter‑American asylum instruments (Montevideo and Caracas) bolster Ecuador’s reliance on regional treaty obligations alongside its claims under anti‑corruption instruments; and (4) while Article 2 vests the decision on political character with the granting State, that allocation does not nullify Article 1’s surrender requirement when offences are common — Ecuador can argue Mexico’s unilateral political characterization cannot override the treaty prohibition where the factual record shows common criminal convictions and ongoing prosecutions. Limitations and considerations: the Montevideo Convention gives the asylum‑granting State the power to judge political character, so Mexico may invoke Article 2 and contest characterization; the treaty is regional and binding only on Parties and insofar as it remains in force between them (so Ecuador must establish Mexico’s obligations under the Convention at the relevant time); and the Convention does not by itself resolve all questions about interplay with the Vienna Convention or customary limits on diplomatic asylum, so Ecuador should deploy it together with the Caracas Convention, VCDR Article 41, and anti‑corruption treaties to show a consistent body of obligations breached by Mexico’s conduct.",
    "keyPoints": [
      "Article 1 prohibits granting asylum in legations/warships/military camps/airships to persons accused or convicted of common offences and requires surrender upon request by the local government",
      "Article 2 allocates to the asylum‑granting State the judgment of whether an offence is political, but does not negate Article 1’s surrender duty for common crimes",
      "The Convention is a regional treaty directly relevant to diplomatic asylum and supports Ecuador’s claim that Mexico unlawfully used its embassy to shield a convict from local criminal jurisdiction",
      "In the case at bar the Convention can be used alongside the Caracas Convention and VCDR Article 41 to show treaty‑based obligations breached and to rebut any lawful basis for Mexico’s announced asylum",
      "Limitations: State discretion under Article 2 to characterize offences politically and the need to show both Parties’ treaty obligations remain in force and applicable in the present dispute"
    ]
  },
  {
    "filename": "Extradition Treaty (2006).pdf",
    "shortTitle": "Agreement On Extradition Between The United States Of America And The European Union",
    "date": "2003–2010",
    "type": "other document",
    "shortSummary": "A multilateral agreement between the United States and the European Union (and its Member States) that standardizes and enhances procedures for extradition cooperation, including definitions of extraditable offences, channels for requests and provisional arrest, transit, temporary surrender and treatment of sensitive information. It supplements and, in specified respects, replaces aspects of existing bilateral extradition treaties between the United States and EU Member States.",
    "detailedSummary": "The Agreement on Extradition (signed 25 June 2003; instruments exchanged 2009; entered into force 1 February 2010) establishes common rules and practical mechanisms to facilitate extradition and related cooperation between the United States and EU Member States. Key provisions define extraditable offences by reference to a one‑year custodial threshold (Art. 4); permit streamlined transmission and admissibility of extradition requests and supporting documents without further legalization or authentication where certified by an appropriate authority (Art. 5); allow direct transmission of provisional arrest requests between Ministries of Justice and use of Interpol facilities (Art. 6); authorize transmission of full requests to the requested State’s embassy following provisional arrest to preserve detention time-limits (Art. 7); permit requests for supplementary information to be exchanged directly between Ministries of Justice (Art. 8); provide for temporary surrender for purposes of prosecution with conditions for return and crediting of custody time (Art. 9); set rules for resolving competing requests (Art. 10); enable simplified procedures when the person consents (Art. 11); cover transit and unscheduled landings (Art. 12); address capital punishment concerns (Art. 13); and require consultation and periodic review (Arts. 15, 21). The Agreement also clarifies its relationship to existing bilateral treaties with Member States (Art. 3) and preserves the requested State’s ability to invoke any grounds for refusal available under bilateral treaties or constitutional/judicial constraints (Art. 17). The Explanatory Note confirms that operational difficulties may be addressed through consultations or future bilateral arrangements.",
    "keyPoints": [
      "Creates a clear, uniform threshold and definitions for extraditable offences (Art. 4) that reduce dual‑criminality friction and allow cooperation despite differences in domestic offense categories",
      "Facilitates rapid operational cooperation: direct provisional arrest requests, use of Interpol, embassy transmission to preserve detention time‑limits, and direct Ministry‑to‑Ministry exchanges for supplementary information (Arts. 5–8)",
      "Provides mechanisms for temporary surrender and transit that permit requested States to balance law‑enforcement interests with protections for detained persons (Arts. 9–12), and safeguards (capital‑punishment conditions, protection of sensitive information) to respect human‑rights and sovereign constraints (Arts. 13–14)",
      "Respects and complements bilateral treaties (Art. 3) and preserves requested States’ non‑derogable domestic grounds for refusal and the need for consultations where constitutional or judicial constraints arise (Art. 17)"
    ]
  },
  {
    "filename": "Vienna Convention on Diplomatic Relations, 1961 .pdf",
    "shortTitle": "Vienna Convention On Diplomatic Relations",
    "date": "1961-1964",
    "type": "other document",
    "shortSummary": "The Vienna Convention (1961) codifies the rules governing diplomatic missions, immunities, inviolability of mission premises, and the duties of diplomatic agents and sending States. It balances privileges necessary for mission functions with obligations to respect the laws and sovereignty of the receiving State.",
    "detailedSummary": "The Convention establishes key rules directly relevant to Ecuador v. Mexico. Article 22 makes mission premises inviolable and imposes a duty on the receiving State to protect them, while Articles 29–31 and 37 set out personal inviolability and immunities of diplomatic agents and certain staff. Crucially, Article 41(1) imposes duties on persons enjoying privileges and immunities to respect the laws and regulations of the receiving State and not to interfere in its internal affairs; Article 41(3) bars use of mission premises in ways incompatible with the mission's functions. Other provisions (Article 3 on mission functions, Article 9 on persona non grata, Article 27 on official communications, and Articles 45–46 on protection when relations break off) frame the scope and limits of permissible diplomatic activity. In Ecuador v. Mexico, Ecuador relies on Article 41 and related provisions to argue that Mexico misused its mission by sheltering an Ecuadorian national convicted of ordinary crimes, thereby interfering with Ecuador’s administration of justice and violating the duty not to use mission premises incompatibly. The Convention does not create a right to shelter local nationals from criminal process; immunity protects diplomats and certain staff, not private nationals on the receiving State’s territory. Applied to the facts, the Convention supports Ecuador’s contention that prolonged sheltering and a unilateral grant of asylum from mission premises, intended to remove the person from Ecuadorian jurisdiction, exceeded the scope of diplomatic functions and breached Mexico’s obligations under the Convention. The Convention also supplies procedural tools Ecuador may invoke (persona non grata, requests for surrender/cooperation under ordinary channels) and supports arguments about the limits of diplomatic protection when it conflicts with the receiving State’s criminal proceedings.",
    "keyPoints": [
      "Article 22 inviolability of mission premises does not permit using those premises to obstruct local criminal justice; the receiving State must also protect against misuse",
      "Article 41(1) expressly requires persons enjoying diplomatic privileges to respect the laws of the receiving State and not to interfere in its internal affairs — central to Ecuador's claim that Mexico's actions were improper",
      "Diplomatic immunities protect accredited agents and specified staff, not private local nationals; sheltering a convicted local national to evade arrest falls outside the Convention's protective scope",
      "Procedural and remedial provisions (Article 9 persona non grata; Articles 45–46 on protection/entrustment when relations break off) offer lawful responses to misuse of a mission and are consistent with Ecuador’s diplomatic steps",
      "The Convention’s balance between privileges and obligations supports Ecuador’s argument that any derogation from another State’s sovereignty (e.g., effective removal of a person from jurisdiction) must have a clear legal basis and cannot be achieved by unilateral misuse of mission premises"
    ]
  },
  {
    "filename": "Convention on International Civil Aviation (Chicago Convention).pdf",
    "shortTitle": "Convention On International Civil Aviation",
    "date": "1944-1948",
    "type": "other document",
    "shortSummary": "The Chicago Convention establishes sovereignty of States over their airspace and a framework of rules for international civil aviation, including limits on state aircraft, rights of transit and landing, and obligations to respect domestic aviation laws. While primarily an air-transport instrument, several provisions bear on forcible or unauthorized removal of persons by air and on the use of aircraft in ways that affect a receiving State’s sovereignty and public order.",
    "detailedSummary": "Overview: The Convention on International Civil Aviation (Chicago Convention) recognizes each State’s complete and exclusive sovereignty over the airspace above its territory (Art. 1) and establishes rules governing civil and state aircraft, rights of transit, landing, and the applicability of domestic aviation laws to foreign aircraft. Key provisions relevant to Ecuador v. Mexico: - Article 1 (Sovereignty): affirms that a State controls its airspace — any use of air transport to remove persons from a State’s territory without that State’s consent implicates sovereign control over entry and exit by air. - Article 3 (Civil and state aircraft): distinguishes civil from state aircraft and provides that state aircraft shall not fly over or land in the territory of another State without authorization or special agreement (Art. 3(c)); States must issue regulations for state aircraft with due regard for civil navigation (Art. 3(d)). - Article 4 (Misuse of civil aviation): contracting States agree not to use civil aviation for any purpose inconsistent with the aims of the Convention — this supports objections to using civil aircraft to effect an unauthorized extraction that interferes with the receiving State’s legal process. - Article 5–7, 10, 11 (Flights, scheduled services and landing/cabotage): set out rights and limits for non‑scheduled and scheduled flights, and require entry/exit and customs/immigration formalities at designated airports — forcible or clandestine removal by air would be inconsistent with these rules if conducted without Ecuador’s authorization. - Article 16 (Search of aircraft) and Articles 22–24 (facilitation, customs/immigration): underline the receiving State’s authority over immigration, customs and inspection on entry/exit by air. Relevance to the case at bar (Ecuador v. Mexico): - For Ecuador’s claim: The Convention can be used to reinforce Ecuador’s argument that any deliberate plan by Mexico to remove Mr. Glas from Ecuador by air without Ecuador’s consent would violate Ecuador’s sovereignty over its airspace (Art. 1), its domestic aviation and immigration regime (Arts. 10, 11, 22–24), and the Convention’s prohibition on misuse of aviation (Art. 4). If Mexico intended to use state aircraft (or civil aircraft under Mexican control) to depart Ecuador without authorization, Article 3(c) is directly engaged because state aircraft require authorization to fly over/land in another State. - For Mexico’s possible response / limitations: The Convention primarily regulates air navigation and aircraft; it does not govern diplomatic asylum or the use of diplomatic premises. Mexico could argue the Convention is only marginally relevant to actions that took place entirely within the receiving State’s territory (i.e., shelter in an embassy) unless there was a concrete attempt to use aircraft to extract Mr. Glas. Mexico can also invoke Art. 3(c) to argue that any outbound Mexican state aircraft would require Ecuador’s authorization, underscoring that the Convention supports, rather than contradicts, the requirement of consent for removal by air. Practical evidentiary uses in proceedings: - If Ecuador adduces evidence that Mexico planned or attempted to move Mr. Glas by air (press statements promising safe conduct and removal), the Court can rely on the Convention to show such removal would have required Ecuador’s authorization and thus constituted an infringement of sovereignty and aviation rules. - If Mexico used or intended to use a state aircraft, Ecuador can cite Article 3(c) to show that such a flight would be unlawful without prior authorization. - The Convention can be deployed alongside diplomatic and asylum treaties (Vienna Convention, Caracas/Montevideo Conventions) to demonstrate the broader legal landscape protecting Ecuador’s territorial jurisdiction and the illegitimacy of extrajudicial extraction by air. Limits: The Chicago Convention does not address embassy immunity, asylum law in diplomatic missions, or the lawfulness of sheltering a person inside diplomatic premises; it therefore cannot by itself prove misuse of diplomatic premises but is a strong supplementary instrument where air transport or attempted evacuation by air is alleged.",
    "keyPoints": [
      "Affirms State sovereignty over airspace (Art. 1) — unauthorized removal by air implicates sovereignty and entry/exit controls",
      "Distinguishes state and civil aircraft; state aircraft require authorization to enter/land in another State (Art. 3(c))",
      "Prohibits misuse of civil aviation for purposes inconsistent with Convention aims (Art. 4) — supports objections to unauthorized extrication by air",
      "Requires compliance with national laws on admission, clearance, immigration and customs for aircraft entering territory (Arts. 10–13, 22–24)",
      "Works as a complementary legal basis to show that any planned or attempted air removal of Mr. Glas by Mexico would have required Ecuador’s consent and thus could constitute a violation of Ecuador’s sovereignty"
    ]
  },
  {
    "filename": "Charter of the Organization of American States.pdf",
    "shortTitle": "Charter Of The Organization Of American States",
    "date": "1948 (amended 1967–1993)",
    "type": "other document",
    "shortSummary": "The OAS Charter establishes principles and organs for inter‑American cooperation, including respect for sovereign equality, non‑intervention, peaceful settlement of disputes, and promotion of representative democracy. In Ecuador v. Mexico these provisions support Ecuador’s claims that Mexico unlawfully interfered in Ecuador’s internal affairs and violated obligations to respect Ecuador’s sovereignty and legal order.",
    "detailedSummary": "The Charter of the Organization of American States (OAS) sets out core principles binding on Member States: sovereign equality, non‑intervention, territorial integrity, respect for international law and treaties, and promotion and consolidation of representative democracy (Articles 1–3, 10, 18–19). It also creates procedures and organs for peaceful settlement of disputes (Articles 24–29, Chapter IX–XIII) and affirms that Member States must abstain from interventions in the internal affairs of others (Article 3(e); Article 19). Relevant functions and competencies of the Permanent Council and General Assembly include assisting in peaceful settlement, recommending procedures, and taking measures to restore or protect friendly relations (Articles 80–91). In Ecuador v. Mexico, the Charter can be invoked to show that: (1) Mexico’s sheltering of a convicted Ecuadorian national inside its embassy and the grant of diplomatic/political asylum that would remove him from Ecuador’s jurisdiction amounts to interference in Ecuador’s internal affairs and a derogation from Ecuador’s sovereignty; (2) such conduct contravenes the duty of Member States to respect the laws and jurisdiction of other States and to abstain from intervening (Articles 3, 10, 19); and (3) Ecuador is entitled to seek peaceful settlement and cooperative remedies through OAS organs and, where appropriate, judicial settlement, because the Charter expressly contemplates settlement mechanisms for disputes between Member States (Articles 24–27, 80–91). The Charter also supports Ecuador’s contention that regional instruments and collective obligations (including cooperation to preserve democratic processes and the rule of law) impose duties not to take actions that disrupt another State’s domestic legal processes. While the Charter does not itself prescribe remedies before the International Court of Justice, its principles and procedural framework bolster Ecuador’s arguments on state responsibility, non‑intervention, and the obligation to respect the territorial State’s judicial processes, and they provide a regional context that the Court may consider when assessing breaches of obligations owed between OAS Member States.",
    "keyPoints": [
      "Articles 1–3 and 10–19 affirm sovereign equality, territorial integrity, and a strict prohibition on intervention in the internal affairs of other Member States, directly supporting Ecuador’s non‑intervention claims.",
      "Articles 24–29 and Chapters IX–XIII provide for peaceful settlement mechanisms and empower OAS organs (Permanent Council, General Assembly) to assist disputes — supporting Ecuador’s right to seek regional and judicial remedies.",
      "The Charter’s emphasis on representative democracy and respect for legal processes (Articles 2(b), 3(d), 45) reinforces Ecuador’s claim that obstruction of its judicial system undermines obligations among Member States.",
      "Provisions on duties of States to respect one another’s rights and laws (Articles 11, 13, 19) can be cited to show Mexico’s embassy conduct and asylum decision derogated from Ecuador’s jurisdiction and legal order.",
      "Although not a source of ICJ jurisdiction, the Charter supplies regional norms and expectations that the Court may consider when evaluating whether Mexico breached obligations of non‑interference and cooperation with Ecuador."
    ]
  },
  {
    "filename": "Convention Against Torture.pdf",
    "shortTitle": "Convention Against Torture",
    "date": "1984-1987",
    "type": "other document",
    "shortSummary": "The Convention Against Torture (CAT) establishes State obligations to prevent torture and other cruel, inhuman or degrading treatment, criminalize and prosecute such acts, provide remedies and ensure non-refoulement where there are substantial grounds to believe a person would face torture. Relevant provisions include obligations to prevent torture (Arts. 2, 10–13), non-refoulement (Art. 3), criminalisation and jurisdiction (Arts. 4–7), mutual assistance and extradition (Arts. 8–9), and prompt investigation and remedy (Arts. 12–14).",
    "detailedSummary": "Overview: The CAT binds States Parties to a comprehensive regime: prohibit and criminalize torture (Art. 1, Art. 4); adopt domestic measures to prevent torture (Art. 2); refuse transfer (expulsion, return, extradition) when there are substantial grounds for believing the person would be in danger of torture (Art. 3); investigate and provide remedies for allegations of torture (Arts. 12–14); and cooperate in criminal matters and mutual legal assistance (Arts. 8–9). The Convention also creates reporting and monitoring mechanisms (Committee against Torture, Part II).\n\nRelevant provisions for Ecuador v. Mexico and how they could be invoked:\n- Article 3 (non‑refoulement): Mexico could potentially rely on Art. 3 to justify not surrendering or removing an individual from its mission/territory if it legitimately believed Glas faced a real risk of torture upon return to Ecuador. The provision requires a State to consider all relevant information (including patterns of systematic violations) before transferring a person. Ecuador can counter that no such risk exists: the facts show criminal convictions and ongoing prosecutions in ordinary courts, and Ecuador can present evidence that Glas would not face torture or ill‑treatment, undermining any Art. 3 claim by Mexico.\n\n- Articles 2, 10–13 (prevention, training, investigation): Ecuador can argue Mexico breached its positive obligations under CAT by using diplomatic premises in a way that frustrated Ecuadorian investigations and enforcement of criminal sentences, and by failing to take measures (e.g., not coordinating cooperative investigative or custodial steps) to prevent possible ill‑treatment in the broader regional context. Conversely, Mexico could argue its actions were aimed at protecting an individual from ill‑treatment and that it complied with training and prevention obligations; Ecuador would need to show no substantive prevention rationale existed.\n\n- Articles 4–9 (criminalization, jurisdiction, custody, extradition, mutual assistance): Ecuador may rely on Arts. 8–9 to assert that Mexico failed to afford “the greatest measure of assistance” in corruption‑related criminal proceedings and improperly obstructed Ecuador’s jurisdiction by shielding Glas. If Mexico invoked CAT to refuse extradition or surrender, Ecuador can argue that CAT does not authorize harbouring persons convicted of ordinary crimes absent a demonstrable risk of torture, and that the asylum/conduct at issue cannot displace mutual‑assistance obligations in criminal matters where no torture risk exists. Additionally, Art. 6 (custody and preliminary inquiry) contemplates that a State where an alleged offender is present should take custody and inform other relevant States and make a prompt inquiry — Ecuador can argue Mexico violated those procedural duties by failing to take custody in a manner that enabled Ecuadorian proceedings.\n\n- Articles 12–14 (investigation, complaint, redress): Ecuador can point to the CAT duty to promptly and impartially investigate reasonable grounds for ill‑treatment; Mexico’s conduct could be framed as impeding Ecuador’s own investigatory and remedial processes. If Mexico asserts protection obligations under CAT, Ecuador can demand that Mexico produce evidence of any credible allegations of torture risk and of steps Mexico took (investigations, diplomatic assurances, monitoring) to discharge CAT duties.\n\nPractical lines of argument for the Court (ways the Convention can be used by each Party):\n- Ecuador’s use of CAT: show there was no real risk of torture (Art. 3) to negate any lawful basis for Mexico’s refusal to surrender; emphasise Mexico’s failure to observe Art. 6 procedures (custody, notification, inquiry) and Arts. 8–9 mutual‑assistance duties in criminal matters; invoke Arts. 2 and 12–13 to allege Mexico’s conduct frustrated prevention, investigation and cooperation obligations under CAT.\n- Mexico’s potential use of CAT: if it raises CAT defensively, Mexico must identify specific, credible grounds to believe Glas faced torture if returned (Art. 3), and show it took proportionate and compatible measures (e.g., offering asylum, seeking assurances, initiating inquiries) — otherwise the Court will likely find the CAT does not justify using diplomatic premises to prevent Ecuadorian enforcement of lawful sentences.\n\nNet effect for the Court: CAT is principally about protecting individuals from torture and obliges States to refuse transfers when a real risk exists; it does not authorise unilateral derogations from the territorial State’s criminal jurisdiction or the misuse of diplomatic premises to shield convicted persons in the absence of a demonstrated torture risk. The Convention therefore supplies both a potential justification (for Mexico if genuine risk is shown) and a strong rebuttal (for Ecuador if Mexico cannot substantiate a risk and has obstructed judicial cooperation and custody procedures).",
    "keyPoints": [
      "Article 3 (non‑refoulement) is central: it permits refusal of transfer only where substantial grounds exist to believe the person would face torture — Mexico must prove such grounds to justify non‑surrender.",
      "Procedural duties (Art. 6) and mutual assistance/extradition provisions (Arts. 8–9) support Ecuador’s claim that Mexico should have cooperated and not obstructed enforcement of domestic criminal judgments.",
      "Prevention, investigation and remedy obligations (Arts. 2, 12–14) cut two ways: they require States to prevent and investigate torture but do not permit unilateral refuge that undermines another State’s jurisdiction absent a real risk.",
      "If Mexico invokes CAT defensively, the Court will assess objective evidence of risk, consultation/assurances offered, and whether Mexico followed CAT’s procedural obligations before denying surrender.",
      "Overall, CAT does not provide a blanket justification for using diplomatic premises to shield a convicted national; it requires concrete, credible evidence of torture risk and fulfilment of procedural and cooperative duties."
    ]
  },
  {
    "filename": "Lopez Burgos v. Uruguay (Human Rights Committee, 1981).pdf",
    "shortTitle": "Lopez Burgos v. Uruguay",
    "date": "1981",
    "type": "other court case",
    "shortSummary": "The Human Rights Committee found that Uruguay violated the International Covenant on Civil and Political Rights by abducting, detaining and subjecting Lopez Burgos to inhuman treatment and by failing to investigate; the Committee also addressed the reach of a State's obligations to persons outside its territory. The decision highlights State responsibility for acts of agents abroad and the duty to investigate and remedy rights violations.",
    "detailedSummary": "Facts and findings: Lopez Burgos, a trade-union activist who had fled Uruguay to Argentina, was alleged to have been abducted by Uruguayan military personnel (with alleged assistance from Argentine actors), detained in Argentina and secretly returned to Uruguay, where he was held incommunicado and tortured. The Human Rights Committee (HRC) examined submissions including detailed allegations and witness testimony provided by the victim's wife. Uruguay did not rebut the facts or show that it had investigated. The HRC concluded that Uruguay breached Covenant obligations—notably Article 7 (prohibition of torture) and Article 2(1) (the duty to respect and ensure rights to everyone within a State’s territory)—and criticized Uruguay’s failure to investigate the allegations and provide an effective remedy. The Committee also commented on the extraterritorial dimension of State responsibilities where conduct by State agents produced effects beyond the State’s borders. Relevance and legal principles: Lopez Burgos establishes (i) that a State can be held internationally responsible for rights violations committed by its agents even when the facts involve cross-border conduct; (ii) that a State’s failure to investigate credible allegations and to provide remedies aggravates its responsibility; and (iii) that human-rights obligations may apply to persons affected by a State’s actions outside its territory where those actions are attributable to the State and affect protected rights.",
    "keyPoints": [
      "State responsibility for violations committed by its agents abroad and for effects produced outside its territory where conduct is attributable to the State",
      "Obligation to investigate credible allegations of torture and ill-treatment and to provide effective remedies; failure to do so constitutes a further breach",
      "Prohibition of torture (Article 7 ICCPR) is absolute and state denials or silence are insufficient in the face of substantiated allegations",
      "The decision is persuasive authority showing human-rights obligations can inform and constrain diplomatic and extraterritorial conduct"
    ]
  },
  {
    "filename": "United Nations Convention Against Corruption (Mérida Convention).pdf",
    "shortTitle": "United Nations Convention Against Corruption",
    "date": "2003-2004",
    "type": "other document",
    "shortSummary": "The United Nations Convention against Corruption (Merida Convention) establishes comprehensive standards for prevention, criminalization, international cooperation, and asset recovery to combat corruption. Its provisions require States Parties to cooperate widely in investigations, mutual legal assistance, extradition and the return of proceeds of corruption.",
    "detailedSummary": "Overview and relevant provisions: The Convention (adopted 2003 at Merida) sets out preventative obligations (Chapter II), criminalization standards (Chapter III), broad mutual legal assistance and extradition rules (Articles 43–46, 55–56), law‑enforcement cooperation (Articles 48–50), and a strong asset‑recovery regime (Articles 51–59, especially Articles 52–55 and 57). Key criminalization articles include bribery (Arts.15–16), embezzlement (Art.17), laundering (Art.23) and related offences; Article 31 requires States to enable freezing, seizure and confiscation of proceeds of offences. The Convention also calls for specialized anti‑corruption and law‑enforcement bodies (Arts.6, 36), protections for witnesses and reporting persons (Arts.32–33), and preventive measures such as enhanced scrutiny of financial accounts for politically exposed persons (Art.52). Mutual legal assistance (Art.46) is to be afforded “to the widest measure” and States must not decline assistance on grounds such as bank secrecy (Art.46(8)). The Convention affirms that asset return is a fundamental principle (Art.51) and provides procedures for identifying, freezing, confiscating and returning proceeds (Arts.54–57).Application to Ecuador v. Mexico and lines of argument: Ecuador can rely on the Merida Convention to show that Mexico owed specific, treaty‑based obligations to cooperate in criminal matters concerning corruption and the recovery/prevention of flight of proceeds and suspects. Relevant arguments Ecuador can press before the Court include: (1) Mexico breached its duty of cooperation under Articles 43 and 46 by sheltering an individual convicted of corruption in Ecuador and refusing to accede to lawful requests for surrender or for police access to embassy premises; (2) Mexico’s actions frustrated Ecuador’s ability to secure evidence, effect arrest and prevent transfer of a person who was subject to outstanding criminal process for offences covered by the Convention (embezzlement, bribery, illicit association), contrary to Articles 23, 31 and 52–55 which require States to identify, freeze and assist in recovery of proceeds and to facilitate extradition/mutual legal assistance; (3) Mexico’s purported grant of diplomatic asylum and use of mission premises to remove a convicted national undermines the Convention’s preventive obligations (Arts.5–14, Art.52 regarding enhanced scrutiny for politically exposed persons) because it obstructed law enforcement steps designed to prevent dissipation or transfer of proceeds and to enforce criminal sentences; (4) by denying assistance and failing to cooperate, Mexico frustrated the Convention’s core asset‑recovery objective (Art.51 and Arts.54–57), including Ecuador’s right to request tracing, freezing and confiscation of assets and to obtain the individual for prosecution or enforcement of sentence; (5) the Convention’s prohibition on using bank secrecy or other domestic rules to bar cooperation (Art.46(8), Art.31(7)) supports Ecuador’s position that Mexico cannot rely on internal or procedural pretexts to refuse requests. Practical litigation uses: Ecuador may cite specific treaty provisions (Arts.43–46, 48, 51–55, 31, 52) to show an international legal obligation breached by Mexico’s conduct, and to rebut any argument that asylum/diplomatic functions justify refusal to cooperate in corruption matters. Ecuador can also use the Convention to request measures preserving evidence, facilitating return or freezing of assets, and to characterize Mexico’s conduct as inconsistent with its international obligations to prevent impunity for corruption and to cooperate in asset recovery.",
    "keyPoints": [
      "Merida Convention (UN Convention against Corruption) creates binding obligations of prevention, criminalization and wide mutual legal assistance between States Parties",
      "Articles 43–46 and 48 require the widest measure of cooperation in investigations, mutual legal assistance and extradition for corruption offences and prohibit refusal of assistance on grounds such as bank secrecy",
      "Articles 51–57 make asset recovery a fundamental principle and require States to identify, freeze, seize and return proceeds of corruption, supporting Ecuador’s claims that Mexico unlawfully impeded enforcement and possible recovery",
      "Article 31 (freezing/seizure/confiscation) and Article 52 (enhanced scrutiny of politically exposed persons) support interim preservation measures and show State obligations to prevent transfer or dissipation of corrupt proceeds",
      "Ecuador can argue that Mexico’s sheltering and removal of a convicted national frustrated treaty duties under the Merida Convention and cannot be justified by diplomatic or asylum claims when offences are ordinary corruption crimes"
    ]
  },
  {
    "filename": "Charter of the United Nations.pdf",
    "shortTitle": "United Nations Charter",
    "date": "1945",
    "type": "other document",
    "shortSummary": "The UN Charter establishes fundamental principles of sovereign equality, non‑intervention, peaceful settlement of disputes, and the role of the International Court of Justice. These principles are directly relevant to Ecuador’s claims that Mexico interfered in its internal affairs and breached obligations under international law in the Glas Espinel matter.",
    "detailedSummary": "The Charter sets out core obligations and principles that frame State conduct between members and before the ICJ. Key provisions for this case include Article 1 (purposes: maintain international peace and security, promote respect for obligations arising from treaties and international law), Article 2 (in particular sovereign equality of States, obligation to fulfil Charter duties in good faith, duty to settle disputes by peaceful means, and the corollary non‑intervention principle), Chapter VI (encouraging peaceful settlement of disputes by negotiation or judicial means), Chapter XIV (confirming the International Court of Justice as the UN’s principal judicial organ and Articles 92–94 requiring compliance with Court decisions), and Articles 56 and 103 (cooperation with the Organization and Charter primacy over conflicting treaty obligations).\n\nApplied to Ecuador v. Mexico, the Charter supports Ecuador’s argument that: (1) States must respect each other’s sovereignty and refrain from interference in internal affairs; Mexico’s sheltering and attempted removal of an Ecuadorian national convicted and subject to arrest can be framed as an unlawful derogation from Ecuador’s territorial jurisdiction and an intervention contrary to the Charter’s non‑intervention principle and the Friendly Relations Declaration as an interpretive source; (2) disputes between Member States that involve questions of international law or alleged breaches of international obligations are properly addressed by peaceful settlement means including judicial settlement before the ICJ (Articles 1, 2 and Chapter VI); Ecuador may therefore rely on the Charter both substantively and procedurally to justify seisin of the Court and relief; (3) the ICJ’s role and the obligation of Members to comply with its decisions (Articles 92–94) underpin Ecuador’s request that legal consequences be declared and reparations ordered; and (4) where treaty obligations and Charter principles align (e.g., non‑intervention, respect for territorial jurisdiction, cooperation in law enforcement), the Charter’s primacy (Article 103) strengthens Ecuador’s case that Mexico could not lawfully invoke regional asylum instruments or diplomatic privileges to override Ecuador’s territorial sovereignty and criminal process.\n\nIn arguing before the ICJ, Ecuador can therefore use the Charter to: frame Mexico’s conduct as an unlawful interference with Ecuador’s sovereignty and judicial functions; place the dispute squarely within the Court’s judicial remit and stress the duty of States to resolve such disputes peacefully (including by litigation before the ICJ); and invoke the Court’s authority and States’ Charter obligations to seek binding relief and the legal consequences of Mexico’s internationally wrongful acts.",
    "keyPoints": [
      "Charter Principles: Sovereign equality and non‑intervention (Article 2) support Ecuador’s claim that Mexico unlawfully interfered in its internal affairs by sheltering and seeking to remove a convicted national.",
      "Peaceful Settlement & ICJ Role: The Charter encourages peaceful dispute settlement and recognizes the ICJ as the principal judicial organ (Chapter VI and Article 92), reinforcing Ecuador’s choice to bring the dispute to the Court.",
      "Obligation To Comply: Articles 94–95 impose an obligation to comply with ICJ decisions and permit recourse to the Security Council if a State fails to perform its judgment, bolstering requests for binding remedies.",
      "Primacy & Cooperation: Article 103 (Charter primacy) and Articles 55–56 on cooperation support Ecuador’s argument that Charter norms prevail over conflicting treaty or unilateral acts and that States must cooperate in upholding rule‑of‑law obligations.",
      "Procedural & Substantive Support: The Charter both procedurally validates ICJ jurisdiction for interstate disputes over international law and substantively supplies general principles (non‑intervention, respect for territorial jurisdiction) to frame Mexico’s conduct as internationally wrongful."
    ]
  },
  {
    "filename": "American Treaty on Pacific Settlement (Pact of Bogotá, 1948) [Conference of American States].pdf",
    "shortTitle": "American Treaty On Pacific Settlement (Pact Of Bogotá)",
    "date": "1948",
    "type": "other document",
    "shortSummary": "The Pact of Bogotá (1948) obliges American states to settle inter-state disputes by peaceful regional procedures and recognizes the ICJ’s compulsory jurisdiction for juridical disputes among American states. It sets out a hierarchy of peaceful means (negotiation, good offices, mediation, conciliation, arbitration, judicial settlement) and procedural rules for their application.",
    "detailedSummary": "The Pact of Bogotá requires High Contracting Parties to use pacific procedures to resolve controversies and, where appropriate, accepts the International Court of Justice’s compulsory jurisdiction for juridical disputes between American states (Article XXXI). Relevant provisions include the obligation to attempt regional procedures first (Articles II–IV), the referral of preliminary questions of domestic jurisdiction to the ICJ (Article V), the requirement to refrain from measures that interfere with ongoing peaceful procedures (Article XVI), and the rules on recourse to the ICJ or arbitration if conciliation fails (Articles XXXII–XXXVI). In Ecuador v. Mexico, Ecuador relies on the Pact both as a basis for the Court’s compulsory jurisdiction and as a framework that emphasizes peaceful regional settlement and respect for domestic jurisdiction. The Pact supports Ecuador’s procedural position that a legal dispute exists between two American States and that the ICJ may be seised for legal questions concerning interpretation of treaties, questions of international law, the existence of facts constituting breaches of international obligations, and reparation (Article XXXI). The Pact’s provisions on the primacy of peaceful procedures and the Court’s role in deciding jurisdictional preliminaries (Article V and Article XXXIII) strengthen Ecuador’s contention that the dispute is justiciable. Moreover, the Pact’s insistence that parties refrain from acts that might hinder conciliation (Article XVI) and its rules on obligations not to resort to diplomatic protection to circumvent domestic remedies (Article VII) can be invoked to argue that Mexico’s use of diplomatic premises and its asylum claim improperly interfered with Ecuador’s domestic judicial processes and regional legal framework. Finally, the Pact’s binding recognition of ICJ jurisdiction for juridical disputes lends procedural force to Ecuador’s application and constrains arguments by Mexico that the matter is non-justiciable or exclusively domestic.",
    "keyPoints": [
      "Article XXXI provides compulsory ICJ jurisdiction for juridical disputes among American States, supporting Ecuador’s seisin of the Court.",
      "Article V and XXXIII allow the Court to decide preliminary questions of domestic jurisdiction, enabling adjudication on whether Mexico’s acts are justiciable international wrongs.",
      "Articles II–IV and XVI emphasize regional peaceful procedures and restraint from acts that impede conciliation, bolstering Ecuador’s claim that Mexico unlawfully interfered with Ecuador’s judicial process.",
      "Article VII limits diplomatic recourse that would circumvent domestic remedies, supporting Ecuador’s argument that sheltering a convicted national in an embassy and granting asylum was incompatible with obligations under regional instruments and domestic-judicial respect."
    ]
  },
  {
    "filename": "Universal Declaration of Human Rights (1948).pdf",
    "shortTitle": "Universal Declaration Of Human Rights",
    "date": "1948",
    "type": "other document",
    "shortSummary": "The Universal Declaration of Human Rights (UDHR) sets out fundamental rights — including rights to a fair trial, protection from arbitrary arrest or exile, and the right to seek asylum subject to limits — which inform international legal principles. In Ecuador v. Mexico, the UDHR can be cited to support Ecuador’s arguments about protection of judicial processes, prohibition of arbitrary deprivation of liberty or exile, and limits on asylum for non-political/common crimes.",
    "detailedSummary": "The UDHR proclaims universal human rights and freedoms that underpin modern international law and state practice. Several provisions are particularly relevant to Ecuador’s submissions against Mexico: (1) Article 3 (right to life, liberty and security of person), Article 9 (prohibition of arbitrary arrest, detention or exile), Article 10 and 11 (rights to fair trial and presumption of innocence), and Article 8 (right to effective remedy) support Ecuador’s contention that its domestic criminal proceedings and arrest warrants must be respected and that removing a convicted/indicted national without lawful process risks arbitrary deprivation of liberty and denial of judicial remedies. (2) Article 14 recognizes the right to seek asylum but Article 14(2) expressly limits that right where prosecutions genuinely arise from non-political crimes — this textual limitation reinforces Ecuador’s argument that diplomatic asylum for a person convicted of corruption (common crimes) is not protected. (3) Articles 1 and 2 (dignity, equality, non-discrimination) and Articles 21–23 (political participation, rule of law and public service) provide contextual support for protecting the integrity of democratic institutions and the rule of law against external interference, which Ecuador alleges Mexico violated by shielding a convicted politician and publicly questioning election legitimacy. While the UDHR is a non-binding General Assembly proclamation, its provisions reflect customary norms and interpretive principles invoked by international courts; Ecuador can therefore use the UDHR to: (a) bolster arguments about fundamental procedural guarantees and the unlawfulness of measures that amount to arbitrary detention or forcible exile; (b) underscore that asylum does not displace domestic criminal jurisdiction for common offences; and (c) frame Mexico’s conduct as inconsistent with international commitments to respect sovereignty, non-intervention, and the rule of law, thereby supporting claims under treaty and customary law (e.g., Vienna Convention, Caracas/Montevideo Conventions, UN/OAS Charters).",
    "keyPoints": [
      "UDHR affirms rights to liberty, security, fair trial, and remedies (Articles 3,8,9,10,11) — useful to argue Ecuador’s criminal process must be respected",
      "Article 14(2) limits asylum for non-political/common crimes — supports Ecuador’s contention that Mexico’s asylum decision was unlawful",
      "UDHR’s principles on dignity, rule of law and non-interference (Articles 1,2,21) strengthen Ecuador’s claim that shielding a convicted official undermines democratic institutions and sovereignty",
      "Though not a treaty, UDHR reflects customary norms and interpretive guidance that can reinforce treaty-based arguments (Vienna Convention, asylum Conventions, anti-corruption Conventions) in the ICJ"
    ]
  },
  {
    "filename": "Statute of the International Court of Justice (Rules of Court reference).pdf",
    "shortTitle": "Statute Of The International Court Of Justice",
    "date": "1945–2025",
    "type": "other document",
    "shortSummary": "The Statute of the International Court of Justice (ICJ) sets out the Court’s composition, jurisdiction, applicable law and procedure, including provisions on seisin, provisional measures, admissibility, and the sources of international law the Court must apply. Relevant Rules of Court supplement procedural articles of the Statute.",
    "detailedSummary": "Summary Of Key Statutory Provisions And Their Application To Ecuador v. Mexico: \n- Jurisdiction (Article 36; Articles 34–37): The Statute establishes that only states may be parties and that the Court’s jurisdiction extends to matters the parties refer to it and to disputes provided for in treaties and conventions. Ecuador invokes the Pact of Bogotá (Article XXXI) and both States are parties to the Statute, so the Statute provides the legal foundation for the Court to determine jurisdiction (including preliminary disputes about jurisdiction). The Statute’s rule that jurisdictional disputes are for the Court to decide (Art. 36(6)) is directly relevant to Mexico’s challenge to seisin. \n- Instituting Proceedings & Notification (Article 40; Rules of Court): Article 40 (and Rules of Court) governs bringing a case by written application and service via the Registrar. Ecuador complied with these procedures (application filed and communications through the Registry), which supports admissibility. \n- Provisional Measures (Article 41): The Court may indicate provisional measures to preserve rights of the parties pending final decision. Ecuador can rely on Art. 41 to request measures (or to respond to Mexico’s earlier request) to prevent removal of the individual or other irreversible acts. \n- Procedural Rights & Composition (Articles 42–33, 21, 31): The Statute governs representation (agents, counsel), creation of chambers, and the right to appoint a judge ad hoc (Art. 31) — Ecuador has invoked its right to choose a judge ad hoc. These provisions protect equal procedural treatment and permit states to ensure national representation on the bench. \n- Sources Of Law (Article 38): The Court must apply treaties, international custom, general principles, and subsidiary means (decisions, doctrine). Ecuador’s submissions invoking the Vienna Convention on Diplomatic Relations, Caracas and Montevideo asylum instruments, the UN and OAS Charters, and anti-corruption conventions fit squarely within Article 38’s hierarchy and are admissible sources for the Court’s decision. \n- Effect And Finality Of Judgments (Articles 59–60): The Statute confirms that judgments are binding between the parties and final; this underpins Ecuador’s request for declaratory and consequential relief and for legal consequences of wrongful acts. \nHow These Statutory Rules Support Ecuador’s Arguments: \n- Jurisdiction: Under Art. 36 and the Pact of Bogotá (Article XXXI), Ecuador can argue the Court has compulsory jurisdiction over the legal questions it raises (interpretation of treaties; questions of international law; existence of facts constituting breaches). The Statute’s allocation of competence to decide jurisdictional challenges supports Ecuador’s ability to press those claims. \n- Provisional Protection & Urgency: Art. 41 empowers the Court to order provisional measures to prevent Mexico from removing Mr. Glas or otherwise frustrating Ecuadorian remedies; statutory authority for such measures strengthens Ecuador’s position on urgency and irreparable harm. \n- Admissibility & Procedural Regularity: Articles 40–44 and related Rules of Court validate Ecuador’s application and the Registry process, and permit Ecuador to rely on written and oral proceedings and documentary annexes it submitted. \n- Sources & Remedy: Article 38 authorizes the Court to apply the treaty and customary norms Ecuador invokes (Vienna Convention, Caracas/Montevideo, UN and OAS Charter principles, anti-corruption treaties). Articles 59–60 make an ICJ declaration and ruling on legal consequences an effective and binding remedy between the States. \nPractical Points Under the Statute: the Court will first consider jurisdiction and admissibility (Arts. 36, 40), may indicate provisional measures (Art. 41) if sought and warranted, will examine treaty and customary obligations under Art. 38, and any final declaration will be binding and without appeal (Arts. 59–60). Ecuador’s reliance on its right to appoint a judge ad hoc (Art. 31) and on the Registrar-mediated procedural rules (Art. 40 et seq.) is fully supported by the Statute.",
    "keyPoints": [
      "Article 36 (jurisdiction): gives the Court power to decide treaty and international-law disputes; essential to Ecuador’s reliance on Pact of Bogotá and treaty claims",
      "Article 41 (provisional measures): empowers the Court to order measures to preserve rights and prevent removal or irreversible acts",
      "Article 38 (sources of law): authorizes application of Vienna Convention, Caracas/Montevideo asylum rules, UN/OAS Charter norms, and anti‑corruption conventions relied on by Ecuador",
      "Articles 40–44 (procedure): set out filing, notification, written and oral proceedings and support Ecuador’s procedural compliance and admissibility",
      "Article 31 (judge ad hoc) and Articles 59–60 (binding, final judgments): let Ecuador appoint an ad hoc judge and seek a final, enforceable determination of legal consequences"
    ]
  },
  {
    "filename": "Inter-American Convention against Corruption [Organization of American States].pdf",
    "shortTitle": "Inter-American Convention Against Corruption",
    "date": "1996",
    "type": "other document",
    "shortSummary": "Regional treaty obliging OAS Member States to prevent, detect, punish and cooperate in relation to corruption, including mutual legal assistance, extradition and measures regarding proceeds of corruption. Ecuador can invoke the Convention to argue that Mexico breached its cooperation duties by sheltering and attempting to remove an Ecuadorian national convicted or prosecuted for corruption.",
    "detailedSummary": "The Inter-American Convention Against Corruption (1996) establishes obligations for States Parties to prevent, detect, punish and eradicate corruption and to cooperate with one another to that end. Relevant treaty obligations include: (a) a duty to provide the ‘‘widest measure of mutual assistance’’ in investigations and prosecutions of acts of corruption (Article XIV); (b) cooperation on identification, tracing, freezing, seizure and forfeiture of proceeds of corruption (Article XV); (c) provisions on extradition and the use of the Convention as a legal basis for extradition where no bilateral treaty exists (Article XIII); (d) territorial and jurisdictional scope tying applicability to acts committed in or producing effects in a State Party (Article IV–V); and (e) requirements that States adopt domestic criminal offences for bribery, illicit enrichment and related acts (Articles VI–XI). In the case at bar (Ecuador v. Mexico), Ecuador can rely on the Convention to argue that Mexico breached its international obligations by: sheltering in its diplomatic premises a person convicted of corruption and subject to arrest warrants; refusing to cooperate with Ecuadorean requests for surrender or for police access to the mission; and attempting to remove that person from Ecuador rather than facilitating investigation, prosecution or extradition. The Convention supports Ecuador’s position that (i) mutual legal assistance and cooperation duties are substantive obligations (Article XIV) that cannot be displaced by unilateral diplomatic asylum claims; (ii) where extradition or surrender is sought, the Convention provides a basis for cooperation or for using the Convention itself as a legal basis for transfer (Article XIII); and (iii) States must assist in preserving and securing evidence and proceeds and not obstruct enforcement of criminal judgments or ongoing prosecutions (Articles XV, XIV, IV). These provisions can be used to demonstrate Mexico’s internationally wrongful conduct both in failing to process Ecuador’s assistance requests and in actively facilitating the attempted removal of a person accused/convicted of corruption contrary to the Convention’s cooperative framework.",
    "keyPoints": [
      "Article XIV requires States Parties to afford the widest measure of mutual assistance in investigations, prosecutions and related proceedings concerning corruption, supporting Ecuador’s claim that Mexico had a duty to cooperate with surrender or custody requests",
      "Article XIII treats corruption offenses as extraditable and allows the Convention to serve as a legal basis for extradition where no bilateral treaty exists, undercutting Mexico’s unilateral removal of Glas instead of coordinating transfer or prosecution",
      "Article XV obliges States to assist with identification, tracing and seizure of proceeds and to cooperate on measures that secure enforcement of corruption-related judgments and investigations",
      "Article IV–V and the Convention’s Preamble emphasize applicability where acts were committed or produced effects in a State Party and the corresponding jurisdictional duties, reinforcing Ecuador’s position that the Convention governs cross-border cooperation here",
      "The Convention’s preventive and criminalization obligations (Articles VI–XI) contextualize Ecuador’s enforcement as part of a regional anti-corruption framework, showing Mexico’s actions frustrated multilateral anti-corruption objectives and specific cooperation duties"
    ]
  },
  {
    "filename": "Convention on Territorial Asylum.pdf",
    "shortTitle": "Convention On Political Asylum",
    "date": "1933",
    "type": "other document",
    "shortSummary": "The Convention on Political Asylum (Montevideo Convention, 1933) prohibits granting asylum in diplomatic premises to persons accused or convicted of common crimes and requires their surrender to local authorities on request. It frames asylum as a humanitarian, non‑reciprocal institution and reserves the assessment of political delinquency to the granting State.",
    "detailedSummary": "The Convention on Political Asylum (Montevideo Convention, 1933) establishes that States may not lawfully grant asylum in legations, warships, military camps, or airships to persons accused of common offences who have been duly prosecuted or sentenced by ordinary courts; such persons must be surrendered as soon as requested by the local government (Article 1). The instrument treats political asylum as humanitarian and non‑reciprocal (Article 3), and affirms that the judgment of whether an offence is political (political delinquency) is a matter for the asylum‑granting State (Article 2). The Convention therefore limits diplomatic asylum in places subject to the receiving State’s territorial jurisdiction when the individual is implicated in ordinary criminal proceedings, and requires cooperation with the territorial State’s requests for surrender. In the Inter‑American system this Convention operates alongside related regional instruments (notably the 1954 Convention on Diplomatic Asylum/Caracas Convention), which similarly recognize a high threshold for political offences and restrict asylum for common crimes.",
    "keyPoints": [
      "Article 1 bars asylum in diplomatic premises for persons accused or convicted of common offences and requires surrender on request by the local government",
      "Article 2 confirms that the State offering asylum judges political character, but regional practice and ICJ jurisprudence impose a strict test for political offences",
      "Article 3 treats political asylum as humanitarian and non‑reciprocal, but does not override obligations of the asylum State to respect the receiving State’s legal order regarding ordinary crimes",
      "Works with later regional instruments (e.g., Caracas Convention) that similarly restrict diplomatic asylum for common crimes and require cooperation with local authorities",
      "Relevant jurisprudence (e.g., Asylum case) recognizes that diplomatic asylum withdraws a person from territorial jurisdiction and therefore must have a legal basis and meet high standards for political persecution"
    ]
  },
  {
    "filename": "Vienna Convention on Consular Relations.pdf",
    "shortTitle": "Vienna Convention On Consular Relations",
    "date": "1963-1967",
    "type": "other document",
    "shortSummary": "The Vienna Convention on Consular Relations (VCCR) sets out the functions, privileges and immunities of consular posts and consular officers, including inviolability of consular premises, freedom of communication, and the duty of consular personnel to respect the laws of the receiving State. In the Ecuador v. Mexico dispute the VCCR is relevant as a closely related instrument that articulates norms (in particular the duty not to use mission premises incompatibly with official functions) that may be invoked by either party, even though the facts primarily concern a diplomatic mission rather than a consular post.",
    "detailedSummary": "Scope and purpose: The VCCR (1963) regulates consular relations: establishment of posts, the range of consular functions (Article 5), protections for consular premises and archives (Articles 31, 33), freedom of communication and consular bags (Article 35), rights to communicate with and assist nationals (Article 36), personal inviolability and limited immunity for consular officers (Articles 40–43), and the overarching obligation that persons enjoying privileges and immunities must respect the laws of the receiving State and not interfere in its internal affairs (Article 55). Relevance and application to Ecuador v. Mexico: 1) Direct applicability — limited. The incident at issue involved the premises and personnel of a diplomatic mission (Embassy of Mexico), so the Vienna Convention on Diplomatic Relations (VCDR) is the primary treaty. The VCCR governs consular posts specifically and therefore does not directly control the legal regime for embassies and diplomatic asylum in this case. 2) Corroborative norms — strong. Several VCCR provisions express principles that parallel provisions of the VCDR and general international law (inviolability of mission premises, duty not to use premises incompatibly with functions, and the obligation not to interfere in the receiving State’s internal affairs). Ecuador can rely on these parallel norms as reinforcing the claim that Mexico misused its mission to shelter a local national and obstruct judicial processes. 3) How Ecuador can use the VCCR: - Article 31 (inviolability) and Article 55 (duty not to use premises incompatibly with functions) support the proposition that mission premises must not be employed to frustrate the receiving State’s law enforcement — even if inviolability prevents forcible entry, misuse of premises can still constitute internationally wrongful conduct by the sending State. - Articles 35 and 36 (freedom of communication; consular contact with nationals) illustrate the limited, purpose-driven character of mission privileges: privileges exist to enable defined consular/diplomatic functions, not to shelter persons prosecuted for ordinary crimes. Ecuador can argue by analogy that the same purposive limits apply under the VCDR and that the VCCR’s framing supports a narrow reading of any asylum/diplomatic-asylum claims. - Articles on cooperation and respect for local law (Article 55) buttress Ecuador’s contention that Mexico had a duty, despite immunities, not to interfere in Ecuador’s internal judicial processes. 4) How Mexico might invoke the VCCR in its defence: - Mexico could point to the VCCR’s strong protections for the inviolability of mission premises and the practice of protecting persons on mission premises to argue that Ecuador’s arrest at the mission or demands for entry violated the sending State’s rights or that the sending State’s decision-making on asylum is within its sovereign competence. - Mexico might emphasise the distinction between consular and criminal jurisdiction under the VCCR (limited immunity for consular officers and functional immunity for official acts) to argue that presence of a national in a mission is not by itself an abuse of privileges absent clear treaty prohibition. Limitations and strategic use at the ICJ: - The Court will prioritize the VCDR, relevant regional asylum conventions (Caracas/Montevideo), and customary rules on non-intervention and mission inviolability. The VCCR should therefore be presented as corroborative authority that: (a) privileges are functional and limited; (b) missions must not be used incompatibly with those functions; and (c) States retain obligations to respect the criminal jurisdiction and judicial process of the receiving State. - Ecuador should use the VCCR to highlight the structural analogy between consular and diplomatic duties (Article 55’s duty not to interfere) to reinforce claims under the VCDR and regional anti‑asylum rules. Mexico should avoid over-relying on VCCR protections as a separate legal ground because the instrument governs consular posts, not embassies; instead Mexico must ground its defence in the VCDR, customary international law on inviolability, and any applicable asylum instruments.",
    "keyPoints": [
      "VCCR governs consular posts but expresses principles (inviolability, functional limits on privileges, duty not to interfere) that reinforce claims under the Vienna Convention on Diplomatic Relations",
      "Article 31 (inviolability of premises) and Article 55 (duty to respect laws and not to interfere) can be used by Ecuador by analogy to show misuse of mission premises to obstruct justice",
      "VCCR shows privileges are functional and limited — useful to argue asylum cannot lawfully shield persons prosecuted for ordinary crimes and that use of a mission for such sheltering is internationally wrongful",
      "Mexico may invoke inviolability protections but cannot rely on VCCR alone because the facts concern a diplomatic mission; the VCCR is best used as corroborative, not primary, authority"
    ]
  },
  {
    "filename": "Havana Convention on Asylum (1928) [Conference of American States].pdf",
    "shortTitle": "Convention On Asylum",
    "date": "1928–1929",
    "type": "other document",
    "shortSummary": "Regional inter-American treaty limiting diplomatic asylum for persons accused or convicted of common crimes and requiring surrender to local authorities; it conditions any diplomatic asylum on urgency, temporariness, and respect for receiving-State laws. The Convention was relied on by Ecuador to argue Mexico’s grant of asylum to Jorge Glas was unlawful.",
    "detailedSummary": "The Convention on Asylum (Havana, 1928) establishes rules among American States about when asylum may be granted in legations, warships, military camps or aircraft. It expressly prohibits granting asylum in such places to persons accused or convicted of common crimes or to military deserters and requires that such persons be surrendered to local authorities on request; where refuge occurs in foreign territory, surrender should follow extradition procedures in force. For political offenders, the Convention allows diplomatic asylum only in urgent cases and for the strictly necessary time, requires immediate notification to local authorities, permits the receiving State to request that the refugee be sent out of national territory as soon as possible, and prohibits use of asylum to carry out acts contrary to public peace. The Convention does not affect prior treaty obligations and was later modified by Montevideo (1933) and Caracas (1954). Relevance to Ecuador v. Mexico: Ecuador invokes the Havana Convention to show that Mexico’s sheltering of Mr. Jorge David Glas in its embassy, its refusal to surrender him despite arrest warrants and final convictions, and its public grant of “political asylum” intending to remove him from Ecuador violated binding regional rules. The Convention’s clear bar on asylum in legations for those accused or convicted of common crimes (and the duty to surrender them) supports Ecuador’s contention that Mexico’s actions were unlawful. Ecuador can also rely on the Convention’s procedural safeguards (notification, temporariness, prohibition on acts against public peace) to demonstrate Mexico failed to comply with the required procedures and exceeded any narrow humanitarian exception. Finally, the Convention’s interaction clause (it does not affect prior treaty obligations) allows Ecuador to combine its Havana-based arguments with obligations under the Vienna Convention and anti-corruption instruments to show a systemic breach of international law by Mexico.",
    "keyPoints": [
      "The Convention forbids diplomatic asylum in legations for persons accused or convicted of common crimes and requires their surrender to local authorities, supporting Ecuador’s claim that Mexico acted unlawfully by sheltering Glas.",
      "Diplomatic asylum for political offenders is permissible only in urgent, strictly temporary circumstances with immediate notification to local authorities—procedural limits Mexico did not respect when it announced asylum and sought safe conduct.",
      "Where refuge occurs abroad surrender should follow extradition channels; Mexico’s refusal to cooperate undermines the Convention’s prescribed surrender mechanisms and strengthens Ecuador’s claim of non-cooperation.",
      "The Convention’s prohibition on acts contrary to public peace and its requirement that asylum not be a means to evade ordinary criminal jurisdiction bolster Ecuador’s arguments about interference with its judicial process and territorial sovereignty.",
      "Because the Convention does not displace earlier treaty obligations, Ecuador may combine Havana-based arguments with breaches of the Vienna Convention and anti-corruption conventions to show cumulative international responsibility by Mexico."
    ]
  },
  {
    "filename": "1976 International Covenant on Civil and Political Rights (ICCPR).pdf",
    "shortTitle": "International Covenant On Civil And Political Rights",
    "date": "1966-1976",
    "type": "other document",
    "shortSummary": "The ICCPR binds States Parties to respect and ensure a wide range of civil and political rights for all persons within their territory and jurisdiction and to provide effective remedies when those rights are violated. Several provisions (notably Articles 2, 9, 14, 19 and 12) may be invoked to assess conduct that obstructs domestic criminal proceedings, arbitrary deprivation of liberty, and interference with legal guarantees.",
    "detailedSummary": "Relevant ICCPR obligations and how they can be relied on in Ecuador v. Mexico:\n\nCore obligations (Article 2 and 2(3)). States Parties undertake to respect and ensure the Covenant rights to all individuals within their territory and jurisdiction and to provide effective remedies where rights are violated. Ecuador can argue that Mexico’s sheltering and attempted removal of an Ecuadorian national who was subject to arrest warrants impeded Ecuador’s ability to secure effective remedies and to enforce its criminal judgments, and that Mexico therefore frustrated Ecuador’s capacity to guarantee rights protected under the Covenant (and the rights of victims of crime to see effective enforcement).\n\nProtection against arbitrary arrest and detention (Article 9). Article 9 requires that no one be arbitrarily deprived of liberty and that arrest and detention follow lawful procedure; it also guarantees prompt judicial review. Ecuador can argue that by preventing Ecuadorian authorities from taking lawful custody of Mr. Glas and by facilitating his removal, Mexico enabled or occasioned a deprivation of Ecuador’s lawful exercise of arrest powers and frustrated Mr. Glas’s and the State’s rights under Article 9 (for example, the right to judicial determination of lawfulness of detention and to lawful custody procedures), insofar as Mexico’s conduct removed the individual from the course of Ecuadorian criminal process.\n\nFair trial guarantees (Article 14). Article 14 protects the right to be tried by competent, independent and impartial tribunals and to the effective implementation of criminal proceedings. Ecuador may contend that Mexico’s use of diplomatic premises to shield a person convicted and under further prosecution undermined the proper conduct and enforcement of Ecuador’s criminal justice system and thereby interfered with Ecuador’s obligation to secure Article 14 guarantees in practice.\n\nFreedom of movement and right to enter one’s own country (Article 12). Article 12 protects the right to leave and re-enter one’s own country and sets limits on restrictions. Ecuador can use Article 12 to show that the forced removal or facilitation of removal of a national in a way that prevents the receiving State from exercising jurisdiction and enforcing criminal law has consequences for rights protected by the Covenant and for the receiving State’s obligation to ensure those rights within its territory.\n\nFreedom of expression (Article 19) and margin for restrictions. Mexico’s executive statements calling into question Ecuador’s electoral legitimacy raise issues of cross-border political interference. While Article 19 protects freedom of expression, it also contemplates restrictions necessary for public order; Ecuador can use the Covenant to show that public statements by a State that materially interfere with another State’s political processes and domestic legal order risk violating the principle that States must respect each other’s jurisdiction to secure Covenant rights. However, Article 19 does not directly prohibit a head of state from criticizing another State; the stronger legal basis for non-intervention is in the UN Charter and customary international law.\n\nInter‑State and Committee procedures (Articles 41–42). The ICCPR provides mechanisms for interstate communications to the Human Rights Committee where States have accepted the competence of the Committee. Ecuador could note these procedures as an alternative or complementary accountability route (good‑offices, conciliation), although in this ICJ dispute Ecuador has chosen to litigate breaches of treaty and customary obligations before the Court.\n\nLimitations and evidentiary points. The ICCPR primarily protects individual human rights and establishes State obligations to individuals; it is not primarily an inter‑State enforcement instrument. Before the ICJ, Ecuador should link ICCPR norms to the specific obligations Mexico owed in relation to persons on Ecuadorian territory (e.g., non‑facilitation of evasion of justice, cooperation in legal assistance) and show how Mexico’s conduct frustrated Ecuador’s capacity to secure Covenant rights. Ecuador should also be prepared to address jurisdictional and admissibility questions (the ICCPR itself is not a forum for direct ICJ adjudication unless the provisions are invoked as relevant sources of international law). Finally, Articles of the Covenant must be read together with the Vienna Convention on Diplomatic Relations, the Caracas and Montevideo asylum instruments, anti‑corruption conventions, and Charter principles invoked in Ecuador’s application.",
    "keyPoints": [
      "Article 2 and 2(3): States must respect and ensure Covenant rights and provide effective remedies—useful to show Mexico’s conduct impeded Ecuador’s ability to secure rights and remedies",
      "Article 9: protection against arbitrary deprivation of liberty and right to prompt judicial review — Mexico’s sheltering/removal of Glas interfered with lawful arrest and judicial processes",
      "Article 14: fair trial guarantees — shielding a convicted person and obstructing custody undermines Ecuador’s ability to implement criminal justice and secure trial rights",
      "Articles 41–42: interstate communication and conciliation procedures before the Human Rights Committee provide complementary accountability avenues, though ICCPR is primarily individual‑rights oriented",
      "Article 19 and Article 12: freedom of expression and freedom of movement offer subsidiary angles (statements by Mexico’s leadership and removal of a national) but require careful framing alongside Charter and diplomatic law on non‑intervention"
    ]
  },
  {
    "filename": "Temple of Preah Vihear (Cambodia v. Thailand) — ICJ (1962).pdf",
    "shortTitle": "Temple Of Preah Vihear",
    "date": "1962",
    "type": "icj judgement",
    "shortSummary": "ICJ judgment finding that the Temple of Preah Vihear lay within Cambodian territory, applying treaty interpretation, map evidence and acquiescence to determine sovereignty and limiting the legal basis for diplomatic asylum as a derogation from territorial sovereignty. The Court ordered Thailand to withdraw forces and to return certain cultural property.",
    "detailedSummary": "The Court determined sovereignty over the Preah Vihear temple in favour of Cambodia. Key legal reasoning included: (1) primary reliance on the frontier as represented on a contemporaneous map (Annex I) produced after mixed‑commission work; (2) finding that Thailand had, by long acquiescence and conduct, accepted that map line even where later technical surveys suggested a different watershed; (3) application of principles of treaty interpretation and of estoppel/acquiescence to give binding effect to the map in the border settlement; and (4) recognition that any grant of diplomatic asylum that withdraws a person from the territorial State's jurisdiction constitutes a derogation from that State's sovereignty and must have a clear legal basis. The Court therefore upheld Cambodia's claim, ordered Thailand to withdraw forces from the temple area, and (by a narrower majority) to return movable cultural items taken since occupation. For Ecuador v Mexico, this judgment is useful on multiple fronts: it underscores (a) the importance of objective state practice and official instruments (notes, maps, diplomatic correspondence) and the receiving State's lack of timely protest as evidence of acquiescence; (b) the strict limits on derogations from territorial sovereignty (including diplomatic asylum) — such measures cannot be recognized absent a clear legal basis; and (c) the Court's readiness to treat misuse of state privileges (acts that interfere with another State's jurisdiction) as internationally wrongful conduct. Ecuador can therefore analogize Preah Vihear to show that Mexico's sheltering of a convicted Ecuadorian national in its mission and unilateral grant of asylum — absent lawful basis under the asylum instruments invoked and against repeated protest — constitutes an unlawful derogation from Ecuador's territorial sovereignty and interference in its domestic jurisdiction. The judgment also supports reliance on long‑standing treaty interpretation principles, the evidentiary weight of diplomatic exchanges, and the doctrine that acquiescence or silence in the face of authoritative instruments may bind States.",
    "keyPoints": [
      "Court gave decisive weight to contemporaneous official instruments and subsequent acquiescence in determining rights arising from treaties and maps",
      "Established that a grant of diplomatic asylum that removes a person from the territorial State's jurisdiction derogates from that State's sovereignty and requires a clear legal basis",
      "Affirmed that State conduct and failure to protest over time can create estoppel/acquiescence affecting territorial claims or the legal effect of instruments",
      "Supported remedies ordering withdrawal of forces from a foreign territory and return of removed cultural property when sovereignty and misuse were established",
      "Demonstrates the Court's willingness to examine diplomatic correspondence and practice to determine whether use of diplomatic premises was compatible with functions and treaty obligations"
    ]
  },
  {
    "filename": "Oil Platforms (Islamic Republic of Iran v. United States) — ICJ (2003).pdf",
    "shortTitle": "Oil Platforms (Islamic Republic Of Iran V. United States)",
    "date": "1992-2003",
    "type": "icj judgement",
    "shortSummary": "ICJ judgment addressing whether U.S. attacks on Iranian offshore oil platforms (1987–1988) violated the 1955 Treaty of Amity, and whether the United States could rely on a treaty clause preserving measures to protect essential security interests (interpreted in light of the UN Charter and customary law on use of force). The Court rejected both Iran’s claim under Article X(1) and the U.S. counter-claim, and examined the interaction of treaty defenses with general international law.",
    "detailedSummary": "Summary of holdings and relevance to Ecuador v Mexico: The Court held that (1) where a treaty preserves a party’s right to take measures “necessary to protect its essential security interests,” the interpretation of that clause may require application of general international law (here the Charter’s prohibition on the use of force and the right of self‑defence); (2) the Court may examine such treaty defenses (Article XX(1)(d) in Oil Platforms) even though they are pleaded as merits defences, but jurisdictional and non ultra petita constraints remain important; (3) on the facts the U.S. attacks could not be justified as lawful self‑defence or as measures falling within Article XX(1)(d); (4) the Court carefully treated the territorial scope of treaty protections (distinguishing direct commerce between the Parties’ territories from broader or “indirect” commerce), allocated burdens of proof, and required sufficient evidence for attribution and for finding an “armed attack”; and (5) the Court addressed admissibility of counterclaims and established limits on parties expanding claims mid‑proceedings. How to use Oil Platforms in Ecuador v Mexico (strategic applications): - Treaty defenses must be read against general international law: if Mexico seeks to justify sheltering Glas under a treaty/asylum instrument or security rationale, Ecuador can invoke Oil Platforms to argue that any treaty carve‑out or claimed “essential security” justification must comply with primary rules (e.g., non‑intervention, limits on misuse of diplomatic premises) and cannot lawfully derogate from Ecuador’s territorial sovereignty. - Burden of proof and evidence standards: Oil Platforms stresses that a claimant bears the burden to prove wrongdoing and attribution; Ecuador can rely on the Court’s standards to show Mexico’s failure to demonstrate lawful basis for asylum or to meet high thresholds (e.g., political persecution vs. common crime), while pre‑empting Mexico’s counterarguments by demanding concrete evidence of any alleged rights invoked. - Territorial and functional scope of treaty protections: the ICJ’s careful parsing of the territorial limits of Article X(1) supports Ecuador’s argument that privileges granted to diplomatic missions do not extend to using premises to obstruct domestic criminal process or to shield nationals convicted of common crimes; diplomatic immunities and asylum exceptions must be narrowly construed. - Limits on permissible mission uses and non‑intervention: Oil Platforms’ willingness to interpret treaty clauses in light of overarching principles (Charter, customary law) can be cited to argue Mexico’s acts were incompatible with duties not to interfere in internal affairs and not to use mission premises “in any manner incompatible with the functions of the mission.” - Procedural cautions (claims/counterclaims and remedies): Oil Platforms shows the Court will scrutinize the scope of the legal question submitted and resist parties widening issues; Ecuador can emphasize that Mexico’s press announcements and unilateral actions do not create new lawful bases and cannot transform the dispute’s subject‑matter to evade treaty limits. Overall, Oil Platforms provides precedent for (a) reading treaty exceptions narrowly and in light of higher norms, (b) demanding strict proof for extraordinary defenses, and (c) treating misuse of diplomatic premises and asylum claims against the backdrop of non‑intervention and cooperation obligations.",
    "keyPoints": [
      "Treaty exceptions (e.g., security or asylum) are interpreted in light of general international law and cannot justify measures otherwise unlawful (Court applied UN Charter/self‑defence law to treaty clause)",
      "Claimant bears the burden to prove wrongful acts and attribution; the Court requires concrete evidence and will distinguish direct from indirect effects when assessing treaty rights",
      "Court enforces territorial and functional limits of treaty protections—uses of diplomatic premises incompatible with mission functions may violate other obligations",
      "Admissibility and scope of claims/counterclaims are tightly controlled; parties cannot expand the dispute’s subject to avoid legal limits or to seek remedies not pleaded",
      "Oil Platforms is useful to argue that treaty defenses or unilateral acts (press announcements, claimed asylum) do not override obligations of non‑intervention, territorial sovereignty, and cooperation in criminal matters"
    ]
  },
  {
    "filename": "Lotus (Case (France v. Turkey) — PCIJ (1927).pdf",
    "shortTitle": "S.S. Lotus",
    "date": "1927",
    "type": "icj judgement",
    "shortSummary": "The Permanent Court of International Justice held that, absent a prohibitive rule of international law, States remain free to exercise jurisdiction and sovereign powers, and that a State does not violate international law simply by exercising jurisdiction unless a specific rule forbids it.",
    "detailedSummary": "The S.S. Lotus (France v. Turkey) judgment addressed whether Turkey violated principles of international law by criminally prosecuting a French officer after a collision on the high seas. The Court concluded there was no general rule of international law prohibiting a State from exercising criminal jurisdiction in the factual circumstances presented and refused to accept an exclusive rule vesting jurisdiction solely in the flag State. The Court emphasized that international law ordinarily leaves States a wide discretion to regulate and to exercise jurisdiction unless a contrary rule (treaty or well-established custom) limits that freedom. Several judges dissented, arguing for a stronger territorial/flag limitation and warning against expanding extraterritorial criminal jurisdiction by unilateral municipal law. The judgment is often cited for the principle that permissive rules (what is not forbidden is permitted) govern State practice where no binding prohibition exists.",
    "keyPoints": [
      "The Court held there was no universally accepted rule prohibiting a State from prosecuting a foreigner for acts that produced effects on its ship on the high seas; therefore Turkey's prosecution was not ipso facto contrary to international law.",
      "Fundamental proposition: absent an applicable treaty or prohibitive customary rule, States retain broad discretion to exercise jurisdiction; restrictions on that discretion must be proven.",
      "Lotus recognizes concurrent jurisdictions may arise (e.g., flag State and injured State) and rejects a rigid exclusive flag State rule in the facts before it.",
      "Dissents emphasized territoriality and the law-of-the-flag principle and warned against sanctioning unilateral extensions of domestic criminal law that impinge on other States' sovereignty.",
      "The decision is factual and limited in scope; it turned on the absence of a prohibitive customary rule applicable to collisions on the high seas rather than creating a general license for all extraterritorial acts."
    ]
  },
  {
    "filename": "ICJ Rules of Court.pdf",
    "shortTitle": "Rules Of Court",
    "date": "1978-2023",
    "type": "other document",
    "shortSummary": "The ICJ Rules of Court set out the procedural framework for instituting and conducting contentious cases before the Court, including jurisdictional filings, written and oral proceedings, provisional measures, and incidental procedures. In Ecuador v. Mexico those Rules govern Ecuador’s application, the request for provisional measures, jurisdictional objections, evidence and pleadings, and any applications to intervene or for interpretation/revision.",
    "detailedSummary": "The Rules of Court (adopted 1978, amended subsequently) provide the procedural architecture that governs every stage of Ecuador v. Mexico. Relevant provisions include: the form and content requirements for an application (Article 38); service and registration of the case and communications by the Registrar (Articles 26, 38–42); appointment and role of agents, counsel and judges ad hoc (Articles 31, 35–37, 40); the schedule and content of written pleadings (Memorial, Counter‑Memorial, Replies/Rejoinders) and annexing of evidence and translations (Articles 44–53); oral proceedings, interpretation, transcripts and the Court’s questioning powers (Articles 54–72); special incidental procedures such as requests for provisional measures (Articles 73–77), preliminary objections (Articles 79–79ter), counter‑claims (Article 80) and intervention (Articles 81–86); and rules on judgments, interpretation and revision (Articles 94–100). Practically, the Rules determine admissibility (timing and content of Ecuador’s Application), prioritize and set the procedure for Ecuador’s request for provisional measures (urgency and hearing schedule), fix time‑limits for pleadings and production of documents and witnesses (including production after written phase), and control the process for any preliminary objections Mexico might raise about jurisdiction or admissibility. They also set the procedure for third‑party participation (intervention or submissions by international organizations under Article 43), and for the Court’s internal composition (judge ad hoc requests, disqualification, chambers). The registry obligations (translations, certified annexes, circulation to States and the UN) affect evidentiary strategy and public diplomacy (timeliness of diplomatic notes and press releases included as annexes). Finally, the Rules govern remedies after judgment (interpretation, revision) and the formalities for recording discontinuance or settlement.",
    "keyPoints": [
      "Article 38 requirements govern Ecuador’s Application content and signature/authentication formalities and the Registrar must transmit a certified copy to Mexico promptly, so Ecuador’s documentary record and diplomatic notes (annexes) are procedurally critical",
      "Articles 73–77 give priority and an expedited procedure for provisional measures — Ecuador’s request for urgent protection (e.g., to prevent removal of Mr. Glas) must be heard urgently and the President may convene the Court immediately",
      "Articles 44–53 control the written phase: time‑limits, required annexes, certified translations and limits on post‑written submissions — these rules shape Ecuador’s evidentiary disclosures and Mexico’s ability to lodge preliminary objections under Articles 79–79ter",
      "Articles 31, 35–37 and 40 regulate agents, counsel and judges ad hoc — Ecuador may exercise rights to appoint an agent and, if needed, select a judge ad hoc; Mexico’s choice or any request to abstain must follow prescribed timing",
      "Articles 81–86 and Article 43 enable third‑party participation or requests for observations from public international organizations (e.g., OAS) or States parties to asylum/anti‑corruption conventions, which Ecuador can invoke to show treaty interpretation and contextual support"
    ]
  },
  {
    "filename": "United States Diplomatic and Consular Staff in Tehran (United States v. Iran), ICJ (1980) — Tehran Hostage Case.pdf",
    "shortTitle": "United States Diplomatic and Consular Staff in Tehran (Tehran Hostage Case)",
    "date": "1980",
    "type": "icj judgement",
    "shortSummary": "The ICJ found Iran internationally responsible for the seizure and prolonged detention of US diplomatic and consular staff in Tehran, ordered immediate release and restoration of mission premises to a protecting power, and held Iran liable to make reparation. The Court emphasized States' obligations under the Vienna Conventions and general international law to prevent use of diplomatic premises in a manner incompatible with their functions.",
    "detailedSummary": "The Tehran Hostage Judgment (ICJ, 1980) held that: (1) Iran violated multiple treaty and customary-law obligations (notably under the 1961 Vienna Convention on Diplomatic Relations, the 1963 Vienna Convention on Consular Relations and a 1955 Treaty of Amity), by failing to protect the US Embassy and Consulates, permitting and later endorsing their occupation, and detaining mission staff; (2) once organs of the State approved and perpetuated the occupation, the acts of militant occupiers were attributable to the State and engaged state responsibility; (3) the Court ordered immediate release of detained diplomatic and consular personnel, return of mission premises to a protecting power, safe passage for those persons, and held Iran obliged to make reparation, leaving form and amount to subsequent proceedings; (4) the Court examined admissibility and jurisdiction even though Iran did not participate, and relied on a broad body of concordant evidence; and (5) the Court rejected claims that alleged special circumstances (e.g. prior wrongdoing by the applicant) justified coercive measures against diplomatic premises, stressing peaceful remedies and diplomatic measures. Relevance to Ecuador v Mexico: The Tehran judgment supplies controlling precedents for (a) the scope of Article 41 Vienna Convention duties not to use mission premises incompatibly with their functions and to respect the laws of the receiving State; (b) attribution: when State organs approve or perpetuate sheltering that frustrates the receiving State’s law enforcement, acts are attributable and engage state responsibility; (c) relief: the Court’s power to order release/return, safe passage, placing premises with a protecting power and reparations; (d) treatment of diplomatic asylum/legation asylum claims — the Court’s insistence that derogations from territorial sovereignty require lawful basis and cannot be used to shield persons convicted of ordinary crimes; and (e) procedural guidance where the respondent does not participate and the Court relies on concordant documentary evidence. These holdings support Ecuador’s claims that Mexico breached the Vienna Convention, regional asylum conventions and non-intervention principles by sheltering and attempting to remove an Ecuadorian national convicted or under valid judicial process: Tehran provides legal authority to argue that use of embassy premises to prevent execution of arrest warrants is incompatible with mission functions, that State endorsement converts private sheltering into attributable State conduct, that the Court can order immediate measures (release/surrender, safe conduct, return of premises to a protecting power), and that alleged political asylum cannot justify derogation from the receiving State’s sovereignty absent a lawful treaty basis and a showing that offences are political in nature.",
    "keyPoints": [
      "Affirmed duty under Vienna Conventions to prevent use of mission premises in ways incompatible with mission functions and to respect laws of the receiving State",
      "State responsibility attaches where State organs endorse, perpetuate or approve sheltering that interferes with the receiving State’s jurisdiction",
      "Court ordered immediate remedies (release, safe passage, handing premises to a protecting power) and reserved reparations — directly applicable remedial template for Ecuador",
      "Diplomatic asylum does not permit derogation from territorial sovereignty to shield persons convicted of common crimes; lawful basis must be established case-by-case",
      "Court may proceed and rely on concordant documentary evidence even where the respondent State refuses to participate, and will examine jurisdiction and admissibility sua sponte"
    ]
  },
  {
    "filename": "Immunities and Criminal Proceedings (Equatorial Guinea v. France) — ICJ (2020).pdf",
    "shortTitle": "Immunities and Criminal Proceedings (Equatorial Guinea v. France)",
    "date": "2016-2020",
    "type": "icj judgement",
    "shortSummary": "The ICJ decided whether a Paris property formed part of Equatorial Guinea’s diplomatic mission and therefore enjoyed inviolability under the Vienna Convention, holding that a receiving State’s timely, non-arbitrary and non-discriminatory objection can prevent a property from acquiring ‘premises of the mission’ status. The Court emphasised the object and purpose of the Vienna Convention and limited the scope of diplomatic protection where recognition would frustrate legitimate criminal justice processes.",
    "detailedSummary": "Background and holdings: The case arose from French criminal investigations and measures against assets linked to a senior Equatoguinean official and a contested claim that the building at 42 Avenue Foch was part of Equatorial Guinea’s diplomatic mission. The Court found (by majority) that the building never acquired the status of “premises of the mission” under Article 1(i)/Article 22 VCDR because France had from the outset and consistently communicated an objection that was timely, non-arbitrary and non-discriminatory. The judgment developed a test: a receiving State’s communicated objection (if timely, non-arbitrary and non-discriminatory) prevents a property from qualifying as mission premises, and the Convention must be interpreted in light of its object and purpose (facilitating friendly relations and ensuring privileges only to the extent necessary for functional diplomatic purposes). The Court also stressed that privileges and immunities are not to be used to benefit individuals or to frustrate bona fide criminal proceedings; it dismissed Equatorial Guinea’s claims that France breached Article 22 once the objection met the stated criteria. Procedural and remedial points: the Court had earlier ordered provisional measures to protect the building’s inviolability pending the merits; ultimately it declined to sustain Equatorial Guinea’s substantive claims.",
    "keyPoints": [
      "A receiving State can prevent a property from becoming ‘premises of the mission’ by communicating an objection that is timely, non-arbitrary and non-discriminatory; ownership alone is insufficient to create diplomatic premises.",
      "The Vienna Convention must be read in light of its object and purpose: diplomatic privileges exist to ensure functional performance of missions, not to shield individuals or obstruct the receiving State’s criminal justice.",
      "Recognition or protection of premises is not absolute where doing so would impede legitimate criminal investigations; State practice and context matter in assessing whether premises have acquired diplomatic status.",
      "The Court will consider diplomatic exchanges and the sequence of communications when assessing whether an objection was timely and reasonable.",
      "Provisional measures may be indicated to preserve inviolability temporarily, but they do not predetermine the merits of a claim that privileges were misused."
    ]
  },
  {
    "filename": "Nicaragua v. United States (Military and Paramilitary Activities in and against Nicaragua, 1986).pdf",
    "shortTitle": "Military And Paramilitary Activities In And Against Nicaragua (Nicaragua v. United States Of America)",
    "date": "1984-1986",
    "type": "icj judgement",
    "shortSummary": "The ICJ found the United States internationally responsible for unlawful intervention in Nicaragua through support for contra forces, direct attacks (including mining), and violations of Nicaraguan sovereignty and maritime commerce, and affirmed State responsibility and the duty to make reparation. The judgment elaborated core rules of customary international law on non‑intervention, sovereignty, use of force, and attribution of wrongful acts to States.",
    "detailedSummary": "The Court (Merits, 1986) concluded that the United States breached customary international law and treaty obligations by financing, training, equipping and otherwise supporting contra forces that were engaged in military and paramilitary activities against Nicaragua, and by direct acts (including mining ports and attacks on installations) amounting to unlawful uses of force and violations of Nicaragua's sovereignty. The Court applied customary international law (noting limits imposed by the U.S. “multilateral treaty” reservation) and analyzed: (a) the customary prohibitions on the use of force and on intervention in the internal affairs of other States; (b) the standard for lawful self‑defence (necessity and proportionality, and that assistance to rebels as such does not constitute an armed attack); (c) the elements of non‑intervention (including coercion and support for efforts to overthrow a government); (d) rules on State responsibility and reparation; and (e) obligations under humanitarian law (e.g., to avoid encouraging violations of common Article 3). The Court found imputable acts (mines, certain attacks) and support to the contras that breached the non‑intervention and non‑use‑of‑force rules and resulted in an obligation to cease wrongful acts and to make reparation. The judgment also contains important material on evidence, justiciability, and how to assess attribution where non‑State actors are supported by a State.",
    "keyPoints": [
      "Affirmation of non‑intervention and state sovereignty: supporting armed groups to coerce or overthrow another State constitutes wrongful intervention and may engage responsibility.",
      "Attribution and responsibility: a State can be held responsible for acts of irregular forces where it finances, organizes, trains, equips, directs or exercises effective control over their operations; certain direct acts (e.g., mining ports) were attributable to the United States.",
      "Non‑use of force and self‑defence limits: collective self‑defence is only lawful in response to an armed attack and must meet necessity and proportionality; provision of arms or support to rebels alone is not automatically an armed attack.",
      "Use of diplomatic/other facilities and abuse of functions: while the case focused on paramilitary support and direct force, the Court emphasized that conduct which interferes with another State's judicial or sovereign functions (or frustrates its territorial jurisdiction) can amount to unlawful intervention and give rise to responsibility.",
      "Procedural and evidentiary guidance: the Court addressed admissibility, justiciability and the treatment of evidence where the respondent does not participate, which is relevant when evaluating claims of wrongful State conduct and attribution."
    ]
  },
  {
    "filename": "Minquiers and Écréhous (France v. United Kingdom) — ICJ (1953).pdf",
    "shortTitle": "Minquiers And Ecrehos",
    "date": "1953",
    "type": "icj judgement",
    "shortSummary": "The ICJ decided (unanimously) that sovereignty over the Minquiers and Écréhous islands belonged to the United Kingdom, applying proof standards based on effective and continuous display of state authority rather than indirect medieval presumptions. The Court emphasized direct evidence of administration and acts manifesting sovereignty when resolving competing title claims.",
    "detailedSummary": "The Court was asked by special agreement between the UK and France to determine which State had better title to the Minquiers and Écréhous groups. It framed the dispute as one of proof: each Party had to establish its alleged title and the facts on which it relied. The Court downplayed indirect medieval presumptions and treaties that did not directly specify the islands, holding that what matters is evidence of actual, peaceful and continuous exercise of State functions (justice, administration, taxation, registration, local legislation, and other acts indicating territorial authority). For both island groups the Court examined historical documents and a long series of acts (e.g., jurisdiction over wrecks and criminal prosecutions, registration of real estate, taxation, erection of habitations, and other administrative measures). The Court found the UK had produced stronger direct evidence of continuous and effective authority, while French acts (buoys, light aids, occasional official visits, subsidies for a house) were not sufficient as manifestations of State sovereignty. The Court therefore awarded sovereignty to the United Kingdom. Judges appended individual opinions noting concerns about overreliance on medieval evidence and stressing the primacy of modern effective control.",
    "keyPoints": [
      "Burden of proof: each State must prove title by direct evidence of possession and sovereign acts rather than relying solely on indirect medieval presumptions or treaties that do not specify the territory",
      "Effective control standard: peaceful, continuous and public exercise of State functions (administration, justice, taxation, registry, policing, etc.) is decisive evidence of sovereignty",
      "Acts that are technical, sectoral or navigational (e.g., buoys, lights) are not necessarily manifestations of sovereignty unless clearly intended as State authority over the territory",
      "The Court will evaluate the probative value of a series of acts over time; isolated or equivocal acts by a State are insufficient to establish title",
      "Historical claims must be corroborated by later manifestations of authority — long-term local administration carries strong weight"
    ]
  },
  {
    "filename": "Convention on Diplomatic Asylum (Caracas Convention, 1954).pdf",
    "shortTitle": "Convention On Diplomatic Asylum (Caracas Convention)",
    "date": "1954",
    "type": "other document",
    "shortSummary": "Regional treaty establishing rules for diplomatic asylum in the Americas, including limits on asylum for persons charged with or convicted of common offences and procedures for safe-conduct and surrender. Relevant provisions clarify when diplomatic asylum may be granted and the duties of the asylum-granting State and the territorial State.",
    "detailedSummary": "The Convention on Diplomatic Asylum (Caracas Convention) sets regional rules governing diplomatic asylum in legations, warships and military premises. Key rules: Article III bars granting asylum to persons who at the time of request are under indictment, on trial, or convicted of common (ordinary) offences unless the acts are clearly political in nature; Article V limits asylum to urgent cases and only for the strictly necessary time to permit the asylee to depart with guarantees; Article VIII requires prompt notification to the territorial State; Article IX requires the asylum-granting authority to take into account information furnished by the territorial government and affords deference to the territorial State's position while nonetheless leaving the ultimate decision on the nature of the offence to the asylum State; Articles XI–XIII prescribe requests for safe-conduct, the obligation of the territorial State to grant guarantees and safe-conduct absent force majeure, and rules for transit and protection during departure; Article XIV protects the asylum State from responsibility for delays caused by necessary information-gathering; Article XVIII prohibits asylees from performing acts contrary to public peace or interfering in internal politics; Article XIX addresses rupture of diplomatic relations and transfer or surrender of asylees. Mexico is a party to the Convention (ratified in 1957), so its provisions apply between Mexico and Ecuador.",
    "keyPoints": [
      "Article III: asylum unlawful for persons under indictment, on trial, or convicted of common offences unless the acts are clearly political in nature — places the burden on the asylum-granting State to justify a political character.",
      "Articles V, XI–XIII: asylum is limited to urgent, temporary measures to secure safe departure and requires the territorial State to grant safe-conduct and guarantees to permit departure (except in case of force majeure).",
      "Article IX: asylum-granting State must consider information from the territorial State when determining the character of the offence; the decision to continue asylum or to request safe-conduct is respected but must take that information into account.",
      "Articles VIII and XVIII: the asylum-granting mission must notify the territorial authorities promptly and must not permit asylees to interfere in the internal politics or public peace of the territorial State.",
      "Mexico is a party to the Convention, so Ecuador can rely on its treaty obligations to challenge Mexico’s actions under the Convention in addition to other instruments (Vienna Convention, Montevideo Convention)."
    ]
  },
  {
    "filename": "Barcelona Traction, Light and Power Co. (Belgium v. Spain) — ICJ (1970).pdf",
    "shortTitle": "Barcelona Traction, Light And Power Company, Limited (Belgium v. Spain)",
    "date": "1970",
    "type": "icj judgement",
    "shortSummary": "The ICJ held that Belgium lacked standing to espouse claims on behalf of shareholders in a Canadian company injured by measures taken in Spain, affirming that diplomatic protection of corporate injury belongs primarily to the State of the company's nationality. The Court dismissed Belgium’s claim for lack of jus standi (capacity to bring the claim).",
    "detailedSummary": "Judgment core holdings: The Court found that the national State of a company (here Canada) — not the national States of its shareholders (Belgium) — is the appropriate holder of diplomatic protection for wrongs done to the corporate entity. The Court emphasized the distinction between corporate rights and shareholders’ individual rights: injury to a company generally gives rise to a claim by the company itself and, by extension, its national State, not by shareholder States. The Court therefore rejected Belgium’s claim for reparation for damage to Belgian shareholders caused by Spanish measures affecting Barcelona Traction, since Belgium had no legal right (jus standi) to exercise diplomatic protection for a Canadian company. The Court also considered (but did not ultimately decide on) issues of exhaustion of local remedies and complex tri-lateral relationships among the States involved; several separate and dissenting opinions discussed possible narrow exceptions and equitable arguments but were not adopted by the majority. Relevance to Ecuador v Mexico (how Barcelona Traction can be used in argument): 1) For Mexico (respondent) — standing/challenge: Barcelona Traction is a strong precedent to challenge any part of Ecuador’s case that seeks to bring claims that effectively vindicate private rights of a non-Ecuadorian corporate or individual interest rather than rights owed directly to Ecuador as a State. Mexico can argue that international adjudication should be confined to rights that belong to Ecuador itself (e.g., treaty obligations between States, abuse of diplomatic premises) and that Ecuador cannot convert purely private or corporate grievances into interstate claims absent a clear rule or treaty conferring such standing. If Ecuador’s pleading relied substantially on the personal legal position of Mr. Glas rather than on independent interstate rights, Barcelona Traction supports a preliminary objection. 2) For Ecuador (applicant) — distinguishing the precedent: Ecuador can distinguish Barcelona Traction by showing that its claims are not exercises of diplomatic protection of private shareholders or a foreign-incorporated company but rather assertions of breaches of obligations owed to Ecuador as a State (Vienna Convention duties, asylum/diplomatic-asylum conventions, non-intervention, and anti-corruption cooperation obligations). The Court in Barcelona Traction did not preclude a State from bringing claims that vindicate its own sovereign rights (territorial integrity, non-intervention, misuse of diplomatic premises, treaty obligations). Ecuador should therefore emphasize that its injuries (obstruction of its judicial system, misuse of embassy premises, breaches of inter‑state treaty obligations and non-intervention) are distinct in kind from the corporate-injury claim in Barcelona Traction. 3) Narrow exceptions and equity arguments: Barcelona Traction recognized debate over possible exceptions (company ceased to exist; extreme denial of justice) but declined to create a general right for shareholder States. Ecuador may rely on the Court’s willingness to examine special circumstances to argue that Mexico’s acts (use of embassy to shield a person with final convictions, press statements undermining Ecuador’s institutions, refusal to cooperate on anti‑corruption obligations) are direct affronts to Ecuador’s sovereign prerogatives and treaty duties — matters squarely within Ecuador’s own rights. 4) Procedural lesson: Barcelona Traction underscores the importance of framing the legal interest alleged as an injury to the applicant State itself, and of providing clear legal basis for standing (treaty or customary rule conferring rights to the State). Ecuador should therefore anchor claims in inter‑state obligations (Vienna Convention, asylum conventions, OAS/UN Charter norms, Merida and Inter‑American anti‑corruption treaties) rather than in the private legal status of Mr. Glas. Conclusion: Barcelona Traction is principally useful as a Respondent tool to test jus standi where an applicant’s case overlaps private interests; it is neutralized when the Applicant frames the dispute as an injury to sovereign rights and treaty duties — as Ecuador has done by alleging breaches of obligations owed to Ecuador itself (territorial sovereignty, non-intervention, misuse of diplomatic premises, and treaty-based cooperation).",
    "keyPoints": [
      "Core holding: only the State of a company’s nationality may espouse claims for injuries to the corporate entity; shareholder States lack jus standi to bring such claims",
      "Court distinguished corporate rights from individual shareholders’ rights and rejected equitable expansion of diplomatic protection to shareholder States",
      "Barcelona Traction provides a strong precedent to object to interstate claims that merely vindicate private or corporate rights rather than rights of the applicant State",
      "Ecuador v Mexico can be distinguished because Ecuador alleges breaches of inter‑state obligations (misuse of diplomatic premises, non‑intervention, treaty duties to cooperate on anti‑corruption), i.e., injuries to Ecuador’s sovereign rights rather than to a private person or foreign corporation",
      "Procedural lesson: frame the dispute as an injury to State rights and ground standing on treaties/customary law to avoid the bar applied in Barcelona Traction"
    ]
  },
  {
    "filename": "1951 Refugee Convention.pdf",
    "shortTitle": "Convention Relating To The Status Of Refugees",
    "date": "1951-1967",
    "type": "other document",
    "shortSummary": "The 1951 Convention (and its 1967 Protocol) defines who is a refugee and establishes core protections—most importantly non-refoulement and non-penalization—together with States’ duties on travel documents, rights and cooperation with UNHCR. In Ecuador v. Mexico, the Convention can be used to test whether Mr. Glas fell within the refugee definition and whether Mexico’s actions were a lawful exercise of asylum or an abuse incompatible with other international obligations.",
    "detailedSummary": "Overview: The 1951 Convention (as amended by the 1967 Protocol) provides the primary international definition of “refugee” (Article 1) and a package of rights and duties for refugees and States parties, including non-refoulement (Article 33), prohibition on penalizing entry (Article 31), issuance of identity and travel documents (Articles 27–28), and obligations to cooperate with UNHCR (Article 35). Scope and exclusions: The Convention excludes persons for whom there are “serious reasons for considering” they committed war crimes, serious non-political crimes, or acts contrary to UN purposes (Article 1F). Core protections vs. criminal conduct: Non-refoulement forbids returning a refugee to persecution for protected grounds (race, religion, nationality, membership of a social group, political opinion) but does not oblige States to shield persons convicted of ordinary/common crimes or who fall within Article 1F. Relevance to Ecuador v. Mexico: - Whether Mr. Jorge Glas qualifies as a “refugee” under Article 1 is central: the Convention protects those fleeing a well‑founded fear of persecution for listed grounds; it does not protect persons seeking shelter from prosecution for ordinary criminal offences. Ecuador’s record shows final convictions for corruption and ongoing prosecutions for embezzlement and other criminal investigations—facts that, if accepted, tend to place Mr. Glas outside the Convention’s protective scope. - Article 1F and the exclusion for “serious non-political crimes” is directly pertinent: Ecuador can argue that Glas’s convictions for corruption are serious non-political crimes and therefore preclude refugee status and protections (including protection against removal). - Non-refoulement does not authorize diplomatic missions to obstruct enforcement of criminal judgments where the asylum claimant does not meet the refugee definition. Mexico’s use of its embassy to shield a convicted national who is not demonstrably persecuted for Convention grounds is therefore inconsistent with the Convention’s purposes and with general international law on diplomatic functions. - Procedural and cooperative duties: the Convention envisages State cooperation with refugee protection and with UNHCR; it does not displace States’ criminal‑law cooperation obligations (and other regional anti‑corruption instruments cited by Ecuador). Mexico’s unilateral press‑grant of asylum and removal without prior diplomatic coordination or legal basis under the refugee definition can be framed as an abuse of asylum powers not remedied by the Convention. How to use the Convention in argument before the Court: 1) Challenge Mexico’s characterization of Glas as a refugee by showing he does not meet Article 1’s “well‑founded fear of persecution” test and/or falls within Article 1F (serious non‑political crime); therefore Mexico had no Convention-based entitlement to shelter or safe conduct. 2) Emphasize that core Convention protections (notably non-refoulement) cannot be turned into a shield for persons convicted of ordinary crimes nor be invoked to justify misuse of diplomatic premises to prevent enforcement of criminal judgments. 3) Use Article 35 (cooperation with UNHCR) and the Convention’s general scheme to argue that asylum must be exercised consistently with international law and in cooperation, not as unilateral interference with another State’s criminal jurisdiction. 4) Draw on the Protocol’s removal of temporal/geographic limits to show the Convention’s universal applicability where refugee protection is claimed, and thus the appropriate legal test is the Convention’s definition rather than ad hoc assertions of “political asylum.” 5) If Mexico argues humanitarian concerns or risk of persecution, require it to meet the Convention’s standards and to prove that Glas’s prosecution was genuinely persecutory in nature rather than ordinary criminal enforcement.",
    "keyPoints": [
      "The Convention defines refugees narrowly (well‑founded fear for five protected grounds) and excludes serious non‑political criminals (Article 1F).",
      "Non‑refoulement protects those meeting the refugee definition but does not legitimize sheltering convicted common criminals or obstructing another State’s judicial enforcement.",
      "Article 31 (non‑penalization) and Articles 27–28 (identity and travel documents) presuppose lawful refugee status and do not validate diplomatic asylum in the face of disqualifying convictions.",
      "Article 35 requires cooperation with UNHCR and reflects that asylum must be applied consistent with international law; the 1967 Protocol universalized Convention coverage so the Convention’s tests apply to modern claims.",
      "Argument strategy: show Mr. Glas is not a Convention refugee (or falls under 1F), hence Mexico’s embassy shelter and press grant of asylum lack legal basis and cannot lawfully obstruct Ecuador’s criminal process."
    ]
  },
  {
    "filename": "Democratic Republic of the Congo v. Uganda (2005).pdf",
    "shortTitle": "Armed Activities on the Territory of the Congo (Democratic Republic of the Congo v. Uganda)",
    "date": "2005-2022",
    "type": "icj judgement",
    "shortSummary": "The ICJ found Uganda internationally responsible for unlawful use of force, violations of humanitarian and human-rights law and looting of natural resources in the DRC (merits, 2005) and later quantified reparations (reparations phase, judgment 2022). The judgments set out principles on State responsibility, causal nexus, burden and standard of proof in mass-injury contexts and permissible forms of reparation.",
    "detailedSummary": "Background and holdings: In its 2005 merits Judgment the Court concluded that Uganda committed internationally wrongful acts on Congolese territory (use of force, occupation of Ituri, violations of IHL and human rights, support to and conduct with armed groups, and looting of resources) and thus owed reparation to the DRC. The Court reserved the question of reparations. In the reparations proceedings (judgment of 2022, summary above), after appointing experts and holding hearings, the Court (i) recalled contextual evidentiary difficulties in long-running conflicts, (ii) explained how the duty and consequences of occupation affect causation and burden of proof, (iii) applied flexible standards of proof and allowed global sums in exceptional mass-injury cases, and (iv) fixed a global award (US$325 million) distributed across damage to persons, property and natural resources with post-judgment interest and payment terms.\nKey legal principles and procedural rules from the decisions relevant to other ICJ disputes: 1) Occupier duty and burden: when a State exercised effective control or occupation (Ituri), the Court treated the occupier’s duty of vigilance as bearing on causation and shifted the evidentiary burden in reparations: the occupier must establish that particular injuries in the occupied area were not caused by its failure to meet occupation obligations. 2) Causation: reparations require a sufficiently direct and certain causal nexus between wrongful act and injury; in complex armed-conflict settings the Court recognized concurrent causes and adopted an approach allocating responsibility where appropriate. 3) Proof and flexibility: the Court accepted a more flexible, context-sensitive standard of proof in the reparations phase (allowing reasonable estimates and reliance on corroborated reports, expert assessment and global sums where precise quantification is impossible). 4) Forms of reparation: restitution where possible, otherwise compensation; the Court accepted global lump-sum awards for categories of mass damage and emphasised equity infra legem (equitable considerations within law) but rejected ex aequo et bono absent consent. 5) Limits: the Court dismissed claims where causal link or evidence was insufficient (e.g., macroeconomic damage, some specific property claims).\nHow the case can be used in Ecuador v. Mexico: DRC v. Uganda provides precedent on burden/causation, evidentiary flexibility, and appropriate remedies that Ecuador can invoke. Ecuador can analogize the Court’s treatment of occupation/derogation of territorial sovereignty to Mexico’s alleged use of its embassy to derogate Ecuadorian jurisdiction: the Asylum precedent cited in DRC (and DRC’s discussion of derogation from sovereignty) supports Ecuador’s submission that granting diplomatic asylum that withdraws a person from local jurisdiction is a derogation from territorial sovereignty requiring a clear legal basis. The DRC reparations phase shows the Court will (i) take contextual constraints into account when assessing evidence and may apply flexible standards of proof rather than demanding unrealistically precise documentation, (ii) infer responsibility where a State had control or effective authority over the relevant space or actors and failed in duties (useful for showing misuse of diplomatic premises and obstruction of justice), and (iii) consider non-pecuniary remedies (declaratory relief, satisfaction) alongside compensation where appropriate. Ecuador can therefore argue that: Mexico’s sustained sheltering and alleged removal of an Ecuadorian national from local enforcement is a clear derogation/interference in Ecuador’s territorial sovereignty and internal affairs (citing the Asylum case reasoning reiterated in DRC), that Mexico’s conduct breached obligations under the VCDR and regional asylum instruments and the obligation to cooperate in anti-corruption instruments, and that the Court should be flexible in assessing diplomatic exchanges and contemporaneous evidence (notes verbales, press releases, requests for surrender) rather than require formalistic proof unrecoverable in diplomatic contexts. Finally, Ecuador can use DRC v. Uganda’s acceptance of global or equitable remedies to support requests for declaratory findings, specific performance (e.g., return/surrender or an order to refrain from removing the person), and, if appropriate, reparatory measures adapted to diplomatic context — while being mindful of differences: DRC involved large-scale armed conflict, occupation and mass human-rights violations whereas Ecuador v. Mexico concerns diplomatic use and alleged obstruction of national criminal process; the Court’s allocation of burden in DRC depended on occupation/effective control facts that will not map identically onto embassy inviolability and diplomatic immunity issues. The DRC judgments therefore offer useful analogies on burden, proof and remedial flexibility but require careful tailoring to the Vienna Convention and asylum-convention framework at issue in Ecuador v. Mexico.",
    "keyPoints": [
      "Where a State exercised occupation or effective control, the Court shifted evidentiary burdens and required the occupier to show a particular injury was not caused by its failure of vigilance",
      "The Court required a sufficiently direct and certain causal nexus for compensation but allowed flexible proof and reasonable estimation in mass-injury contexts",
      "Global lump-sum awards and equity infra legem are permissible in exceptional circumstances where precise quantification is impossible, but ex aequo et bono requires consent",
      "Findings about derogation from territorial sovereignty and diplomatic asylum in earlier jurisprudence (Asylum case) were endorsed and applied as principles relevant to interference in internal affairs",
      "The Court rejected claims lacking causal link or adequate evidence (illustrating limits: strong claims still require a demonstrable legal and factual connection)"
    ]
  },
  {
    "filename": "American Convention on Human Rights (1969).pdf",
    "shortTitle": "American Convention On Human Rights",
    "date": "1969",
    "type": "other document",
    "shortSummary": "Regional human-rights treaty (Pact of San José) establishing civil, political, economic and social rights and creating the Inter‑American Commission and Court of Human Rights. It imposes positive obligations on States to respect and ensure rights (including due process, personal liberty and judicial protection) for all persons under their jurisdiction.",
    "detailedSummary": "The American Convention sets binding human‑rights obligations for OAS Member States, including: Article 1(1) (duty to respect and ensure rights to all persons subject to a State’s jurisdiction), Article 7 (personal liberty), Article 8 (right to a fair trial and judicial guarantees), Article 5 (humane treatment), Article 22 (freedom of movement and residence, and asylum-related limits), Article 23 (political participation and legitimacy of elections), and Article 25 (right to judicial protection). In Ecuador v. Mexico, Ecuador can invoke the Convention to show how Mexico’s conduct—sheltering a convicted national in its embassy, refusing cooperation with Ecuadorian authorities, publicly asserting asylum for a person convicted of common crimes, and making statements that call into question Ecuador’s electoral legitimacy—undermined Ecuador’s capacity to secure the rights and legal remedies guaranteed by the Convention. Concrete arguments using the Convention include: that Mexico’s misuse of diplomatic premises frustrated Ecuador’s duty under Article 1(1) to ensure effective judicial protection (Article 25) and the right to be promptly brought before competent authorities (Articles 7 and 8); that withholding cooperation on criminal proceedings against offences falling within anti‑corruption conventions impaired Ecuador’s ability to investigate and prosecute corruption, in turn affecting the Convention guarantees to victims and to the rule of law; and that Mexico’s public statements interfering with Ecuador’s electoral process engage Article 23 (right to participate in government) and the Convention’s broader protections for democratic institutions. While the Convention does not regulate diplomatic asylum procedures directly, its rights and State obligations provide a regional human‑rights framework showing the consequences of a State’s actions that obstruct another State’s ability to secure fair trial and judicial remedies, and to protect democratic processes.",
    "keyPoints": [
      "Establishes State obligations to respect and ensure rights to all persons under their jurisdiction (Article 1(1)), including positive duties to enable effective judicial protection (Article 25).",
      "Protects personal liberty and fair‑trial guarantees (Articles 7 and 8) — Ecuador can argue Mexico’s sheltering of a convicted person interfered with these rights by preventing lawful arrest and enforcement of judgments.",
      "Affirms protections relevant to movement, exile/asylum limits and the rule of law (Article 22 and related principles) that undermine any abusive use of diplomatic premises to avoid prosecution for common crimes.",
      "Protects political participation and the integrity of democratic processes (Article 23); Ecuador can rely on this to show Mexico’s public statements about Ecuador’s elections constituted wrongful interference with democratic institutions.",
      "The Convention supplies a regional human‑rights lens showing how Mexico’s actions frustrated Ecuador’s duty to provide remedies and uphold the rule of law, supporting Ecuador’s claims of international responsibility even where asylum/diplomatic law overlap with human‑rights obligations."
    ]
  },
  {
    "filename": "Alleged Violations of Sovereign Rights and Maritime Spaces (Nicaragua v. Colombia, 2022).pdf",
    "shortTitle": "Alleged Violations Of Sovereign Rights And Maritime Spaces (Nicaragua v. Colombia)",
    "date": "2022",
    "type": "icj judgement",
    "shortSummary": "The Court found that Colombia breached Nicaragua’s sovereign rights in Nicaragua’s exclusive economic zone by interfering with fishing, authorising fishing and purporting to enforce conservation measures, and that Colombia’s ‘integral contiguous zone’ exceeded customary-law limits. The Judgment also addressed jurisdiction ratione temporis, admissibility and standards of proof.",
    "detailedSummary": "The Judgment (summary) addresses multiple interlocking issues: (1) jurisdiction ratione temporis — the Court accepted jurisdiction to examine alleged incidents occurring after the denunciation of the Pact of Bogotá where those incidents arose directly out of the same dispute and met criteria of continuity/connexity; (2) evidentiary approach — the Court emphasised the applicant’s burden of proof, gave greater weight to contemporaneous/direct sources, treated press reports and materials prepared for litigation with caution, and required corroboration for serious factual allegations; (3) substantive findings in the exclusive economic zone (EEZ) — the Court found Colombia violated Nicaragua’s sovereign rights by interfering with Nicaraguan-flagged/licensed fishing and research vessels, by exercising control or implementing conservation measures in Nicaragua’s EEZ, and by authorising fishing there; (4) contested domestic measures — Presidential Decree 1946 (Colombia’s ‘integral contiguous zone’) was held inconsistent with customary international law where it extended beyond 24 nm and conferred powers not permitted in the contiguous zone; the Court required Colombia to bring the Decree into conformity by its own means; (5) remedies and limits — the Court ordered cessation of wrongful conduct and reform (but declined compensation where no material loss was proved). The Judgment contains important statements on non‑intervention, coastal‑State rights and due‑regard obligations in the EEZ and on the legal consequences of national measures that affect a neighbour’s jurisdiction.",
    "keyPoints": [
      "Jurisdiction Ratione Temporis: the Court may examine post‑lapse events that arise directly from the dispute and meet continuity/connexity criteria — relevant for claims based on continuing or linked conduct",
      "Standards Of Proof: applicant bears burden; contemporaneous/direct evidence is strongest; press reports and litigation‑prepared materials are treated with caution and need corroboration",
      "Sovereign Rights In Zones: coastal State rights in the EEZ (explore/exploit/conserve/manage) are protected; third States must have due regard and cannot lawfully exercise enforcement or conservation jurisdiction inconsistent with the coastal State’s rights",
      "Misuse Of Domestic Measures: unilateral domestic rules (e.g., creation/expansion of zones or broad control powers) that impinge on another State’s maritime rights can engage international responsibility and must be remedied",
      "Remedies: Court ordered cessation of wrongful acts and substantive adjustment of national measures (by the State’s own means); compensation requires demonstrable material injury"
    ]
  },
  {
    "filename": "Asylum (Colombia v. Peru) — Asylum Case (ICJ, 1950).pdf",
    "shortTitle": "Colombian-Peruvian Asylum Case",
    "date": "1950",
    "type": "icj judgement",
    "shortSummary": "The ICJ held that diplomatic asylum is a derogation from the territorial State’s sovereignty and cannot be unilaterally and definitively qualified by the State of refuge; asylum is lawful only where its treaty conditions (including political character and urgency) are met, and a safe‑conduct is not owed unless the territorial State has demanded the refugee’s departure. The Court rejected Colombia’s claim to a binding unilateral qualification and found the grant of asylum in the circumstances not in conformity with the Havana Convention.",
    "detailedSummary": "The Asylum (Colombia v. Peru) judgment explains several core legal limits on diplomatic asylum. The Court found that: (1) diplomatic asylum removes the person from the territorial State’s jurisdiction and thus derogates from that State’s sovereignty, so any lawful derogation requires a clear legal basis in the particular case; (2) the State granting asylum may form a provisional view, but it does not have a general right to unilaterally and definitively qualify the nature of the offence for the territorial State; (3) asylum under regional instruments (Havana/Montevideo style conventions) applies only where the conditions in those instruments are objectively met — notably that offences are political in nature and that there is urgency or a real danger to the person beyond ordinary, law‑ful prosecution; (4) where the territorial State has not demanded the refugee’s departure, it is not obliged to issue a safe‑conduct (the safe‑conduct protection in the Havana Convention arises only after such a demand); and (5) regional practice is insufficient to create a blanket rule allowing unilateral qualification or automatic safe‑conduct obligations. The Court therefore rejected Colombia’s principal submissions and found the asylum unjustified on the facts (lack of urgency and lack of a legal basis), while also rejecting Peru’s claim that the accused was necessarily guilty of common crimes.",
    "keyPoints": [
      "Diplomatic asylum derogates from territorial sovereignty and thus requires a legal basis in each case",
      "The State of refuge lacks a generally binding right to unilaterally and definitively qualify the nature of offences committed in the territorial State",
      "Asylum under regional conventions is limited to objectively established political offences and cases of genuine urgency — ordinary legal prosecution does not justify asylum",
      "The territorial State is not obliged to grant safe‑conduct unless it has been required to effect the refugee’s departure",
      "The judgment supports limiting extraterritorial use of mission premises where it would unlawfully interfere with the receiving State’s jurisdiction and administration of justice"
    ]
  },
  {
    "filename": "Rainbow Warrior Arbitration (New Zealand v. France, 1990).pdf",
    "shortTitle": "Rainbow Warrior",
    "date": "1990",
    "type": "other court case",
    "shortSummary": "Arbitral tribunal (France–New Zealand) found France breached obligations in an exchange‑of‑letters agreement after French agents were removed from a Pacific facility, addressed circumstances excluding wrongfulness (force majeure, distress, necessity), and ordered declaratory relief and moral satisfaction. The tribunal applied customary treaty and state responsibility principles to assess justification and remedies.",
    "detailedSummary": "The Rainbow Warrior arbitration arose from France's failure to comply with a 1986 agreement (exchange of letters) under which France undertook to keep two agents on the island of Hao for not less than three years after their transfer from New Zealand custody. New Zealand invoked arbitration when France evacuated and repatriated the agents without New Zealand's consent. The Tribunal held that treaty obligations (pacta sunt servanda) and the law of state responsibility governed the dispute. It examined whether circumstances excluding wrongfulness (force majeure, distress, necessity) applied. Force majeure was rejected because compliance was not rendered objectively impossible; distress (extreme medical urgency) was narrowly construed and required prompt recognition by the other party, re‑establishment of the original situation once the emergency passed, and good‑faith attempts to obtain consent. The Tribunal found France committed material breaches in respect of one agent (Prieur) and failed to return the other (Mafart) after recovery; it concluded the obligations continued during the relevant period but by the time of the decision the fixed period had elapsed, so New Zealand’s request for an order to return the agents was denied. The Tribunal recognized non‑material (moral/political/legal) damage and held that a public declaration and a conciliatory monetary contribution constituted appropriate satisfaction in the circumstances.",
    "keyPoints": [
      "Treaty obligations are assessed together with general rules of state responsibility; breaches give rise to responsibility even if characterized as implementation of agreements",
      "Circumstances excluding wrongfulness (force majeure, distress, necessity) are narrowly construed: force majeure requires impossibility; distress requires extreme, demonstrable urgency, good‑faith attempts to obtain consent, and restoration once the emergency ceases",
      "A State cannot rely on its domestic law as a justification for failing to perform international obligations",
      "Remedies include declarations of breach and satisfaction (including non‑material damage); orders for cessation may be inappropriate if the underlying obligation has expired",
      "Tribunal can recommend conciliatory measures (e.g., fund/contribution) as appropriate satisfaction"
    ]
  }
]
