[
  {
    "filename": "Arrest Warrant of 11 April 2000 (Democratic Republic of the Congo v. Belgium).pdf",
    "shortTitle": "Arrest Warrant of 11 April 2000 (Democratic Republic of the Congo v. Belgium) 2002",
    "type": "icj judgement",
    "shortSummary": "The International Court of Justice held that incumbent Ministers for Foreign Affairs enjoy full immunity from criminal jurisdiction and inviolability under customary international law, and found that Belgium violated that immunity by issuing and circulating the 11 April 2000 arrest warrant for Mr. Yerodia. The Court required Belgium to cancel the warrant and notify authorities to whom it had been circulated.",
    "detailedSummary": "The Democratic Republic of the Congo instituted proceedings against Belgium over a Belgian examining judge's arrest warrant of 11 April 2000 for the acting Congolese Minister for Foreign Affairs, Abdoulaye Yerodia Ndombasi. The ICJ accepted jurisdiction and examined only questions of customary international law concerning immunity from criminal jurisdiction and inviolability of an incumbent foreign minister. The Court found that such immunities serve the State’s interests in ensuring effective performance of foreign affairs and that, for the duration of their office and when abroad, foreign ministers enjoy full immunity from criminal jurisdiction and inviolability. The Court was unable to find in State practice any customary-law exception allowing prosecution of incumbent foreign ministers for alleged war crimes or crimes against humanity. It distinguished jurisdictional immunities (procedural) from criminal responsibility (substantive), noting that immunity may delay or bar prosecution but does not amount to substantive exoneration. Applying these principles, the Court held that the mere issuance and subsequent international circulation of the Belgian arrest warrant violated Belgium’s obligation to respect Mr. Yerodia’s immunity. As reparation, the Court found that its findings provided satisfaction for the moral injury but also ordered Belgium to cancel the warrant and inform those authorities to which the warrant had been circulated.",
    "keyPoints": [
      "Incumbent Ministers for Foreign Affairs enjoy full immunity from criminal jurisdiction and inviolability under customary international law while abroad.",
      "The Court found no customary-law exception permitting prosecution of incumbent foreign ministers for war crimes or crimes against humanity.",
      "Issuance and international circulation of Belgium’s 11 April 2000 arrest warrant violated Belgium’s obligation to respect the DRC minister’s immunity.",
      "Immunity is procedural (may bar prosecution) and distinct from substantive criminal responsibility (which remains possible once immunity ceases).",
      "Remedy: Belgium must cancel the warrant and notify the authorities to which it had been circulated; the Court’s finding also provided satisfaction for moral injury."
    ]
  },
  {
    "filename": "Julian Assange : Ecuadorian Embassy (London) matter (diplomatic-asylum : embassy-inviolability issues).pdf",
    "shortTitle": "Julian Assange / Ecuadorian Embassy (London) 2012",
    "type": "other document",
    "shortSummary": "Julian Assange sought refuge in the Ecuadorian Embassy in London in 2012 to avoid arrest and extradition; Ecuador granted diplomatic asylum while the UK maintained it had no obligation to recognize that asylum and could not enter the embassy due to inviolability. The standoff exposed tensions between diplomatic asylum claims and state obligations under extradition and diplomatic law.",
    "detailedSummary": "In 2012 Julian Assange entered the Ecuadorian Embassy in London to avoid arrest on a Swedish extradition request and possible subsequent US charges related to WikiLeaks. Ecuador granted him diplomatic asylum, citing fears of human rights violations if he were extradited. Under the Vienna Convention on Diplomatic Relations, embassy premises are inviolable and UK police could not lawfully enter the embassy to arrest him without Ecuador's consent. The UK, however, asserted its legal duty to extradite Assange to Sweden and considered using domestic legislation (the Diplomatic and Consular Premises Act 1987) to withdraw recognition of the embassy premises and thereby circumvent inviolability; this measure was threatened but not enacted. Ecuador refused to surrender Assange, creating a prolonged diplomatic stalemate. The case underscored that diplomatic asylum granted by a sending state is not binding on the receiving state absent specific treaties, highlighted the limits of embassy inviolability when weighed against extradition obligations, and demonstrated that severing diplomatic relations and closing an embassy is a legal option to end inviolability though it was never used in this instance. Assange remained protected while inside the embassy but faced immediate arrest if he left, illustrating the complex interplay of asylum claims, diplomatic law, and domestic legal obligations.",
    "keyPoints": [
      "Assange was protected from arrest while inside the Ecuadorian Embassy because of embassy inviolability under the Vienna Convention.",
      "Diplomatic asylum granted by Ecuador did not bind the UK, which maintained its obligation to extradite to Sweden and could deny safe passage.",
      "The UK threatened to use the Diplomatic and Consular Premises Act 1987 to revoke the embassy's inviolability but did not implement this step.",
      "The situation highlighted a legal gap: diplomatic asylum and embassy inviolability can clash with extradition duties where no bilateral or regional treaty governs diplomatic asylum.",
      "Severing diplomatic relations and closing the embassy—thereby ending inviolability—was a legal option but was not pursued."
    ]
  },
  {
    "filename": "Nicaragua v. Honduras (1988).pdf",
    "shortTitle": "Nicaragua v. Honduras (1988)",
    "type": "icj judgement",
    "shortSummary": "Nicaragua sued Honduras (and Costa Rica) alleging violations of international law for military activities by contras operating from their territory. The ICJ found it had jurisdiction based on Article XXXI of the 1948 Pact of Bogotá, dismissed Honduras's jurisdictional and admissibility objections, but the proceedings were discontinued in 1992 after an out-of-court settlement.",
    "detailedSummary": "Nicaragua instituted proceedings on 28 July 1986 against Costa Rica and Honduras over alleged internationally wrongful acts, particularly military actions by contra forces operating from their territories. Honduras contested the Court's jurisdiction; the parties agreed that jurisdiction and admissibility would be decided preliminarily. Nicaragua relied on Article XXXI of the Inter‑American Treaty for the Peaceful Settlement of Disputes (Pact of Bogotá, 1948) and on mutual declarations under Article 36(2) of the ICJ Statute. In its 20 December 1988 Judgment on jurisdiction and admissibility, the Court held that Article XXXI of the Pact of Bogotá conferred jurisdiction and rejected Honduras’s arguments that the article required or could be supplemented by a separate declaration of acceptance of compulsory ICJ jurisdiction. The Court also set aside Honduras’s proposed interpretation giving effect to certain reservations in its 1986 declaration and found the Pact commitment independent of such declarations. The Court dismissed four admissibility objections raised by Honduras (two general, two Pact-derived). After the merits phase had begun and procedural timelines were adjusted at the parties’ request, Nicaragua informed the Court in May 1992 that the parties had reached an out-of-court agreement; on 27 May 1992 the Court recorded discontinuance of the proceedings and removed the case from the General List.",
    "keyPoints": [
      "ICJ held it had jurisdiction under Article XXXI of the 1948 Pact of Bogotá and rejected Honduras’s arguments requiring or supplementing that article with separate declarations.",
      "The Court dismissed four admissibility objections raised by Honduras, finding the Pact commitment independent of declarations under Article 36(2) of the Statute.",
      "Judgment on jurisdiction and admissibility delivered 20 December 1988; substantive proceedings began afterwards.",
      "Proceedings were discontinued and removed from the General List on 27 May 1992 following an out-of-court settlement between the parties."
    ]
  },
  {
    "filename": "Eritrea v. Ethiopia (Partial Award).pdf",
    "shortTitle": "Jus Ad Bellum—Ethiopia’s Claims 1-8 (2005)",
    "type": "other court case",
    "shortSummary": "The Eritrea-Ethiopia Claims Commission held that Eritrea unlawfully resorted to armed force on 12 May 1998 by attacking and occupying Badme and adjacent Ethiopian-administered areas, violating Article 2(4) of the UN Charter, and is liable for damages. The Commission declined to find that subsequent attacks elsewhere were proven to be pre-planned coordinated unlawful operations.",
    "detailedSummary": "Ethiopia brought a jus ad bellum claim alleging Eritrea unlawfully used force in May–June 1998. The Commission found it had jurisdiction under the Parties' Agreement to decide whether the resort to force violated international law. It rejected Eritrea’s arguments that (a) a territorial claim justified use of force, (b) localized border incidents of 6–7 May 1998 constituted an armed attack triggering lawful self-defense, or (c) Ethiopia’s parliamentary resolution of 13 May 1998 amounted to a declaration of war. The Commission concluded that Eritrean forces launched a significant attack on 12 May 1998 that captured Badme and other areas then peacefully administered by Ethiopia; those actions could not be justified as self-defense and violated Article 2(4) of the UN Charter. The Commission held Eritrea liable for damages arising from that unlawful use of force; it did not find sufficient proof that Eritrea’s other operations across the border between mid-May and mid-June were pre-planned, coordinated unlawful attacks. The scope of damages was reserved for the damages phase.",
    "keyPoints": [
      "The Commission has jurisdiction to decide claims that a State’s use of force violated jus ad bellum under the Parties’ Agreement.",
      "Eritrea’s 12 May 1998 attack on Badme and nearby areas—then under peaceful Ethiopian administration—violated Article 2(4) of the UN Charter.",
      "Localized border clashes on 6–7 May 1998 were not of sufficient scale to constitute an armed attack permitting lawful self-defense under Article 51.",
      "A claimed territorial title does not permit resort to force to settle border disputes.",
      "Claims that subsequent attacks across other fronts were pre-planned and coordinated were not proven; damages for the unlawful attack on Badme are to be determined later."
    ]
  },
  {
    "filename": "Gabcíkovo-Nagymaros Project (Hungary v. Slovakia, 1997).pdf",
    "shortTitle": "Gabcíkovo-Nagymaros Project (1997)",
    "type": "icj judgement",
    "shortSummary": "The International Court of Justice ruled on the 1977 Treaty dispute between Hungary and Slovakia (successor to Czechoslovakia), finding Hungary was not entitled to suspend and abandon works in 1989 and that Czechoslovakia was entitled to adopt a provisional solution but not to put the barrage into operation in 1992. The Court ordered both States to negotiate in good faith, awarded mutual compensation for damages, and later recorded discontinuance of Slovakia’s request for an additional judgment in 2017.",
    "detailedSummary": "Background: Hungary and (then) Czechoslovakia concluded the 1977 Budapest Treaty to construct and operate the Gabčíkovo-Nagymaros barrage system. After Hungary suspended and later abandoned works in 1989, Czechoslovakia implemented a ‘‘provisional solution’’ in 1991 and put a dam into operation in 1992. Slovakia, as successor State to Czechoslovakia, continued the dispute with Hungary.\n\nSpecial Agreement and Questions: In 1993 both Parties submitted a Special Agreement to the ICJ asking whether Hungary was entitled to suspend and abandon works in 1989, whether Czechoslovakia/Slovakia was entitled to adopt and operate the provisional solution, and what were the legal effects of Hungary’s 1992 notification terminating the Treaty. They also asked the Court to determine the legal consequences and obligations arising from the Judgment.\n\nCourt’s 1997 Decision: On 25 September 1997 the ICJ held that Hungary was not entitled to suspend and abandon the works for which it was responsible. The Court found Czechoslovakia entitled to proceed in November 1991 with the provisional solution as agreed between the Parties, but not entitled to put the barrage into operation from October 1992. The Court determined that Slovakia, as successor State, became party to the 1977 Treaty as of 1 January 1993. It ordered both States to negotiate in good faith, to take measures to achieve the Treaty’s objectives, and to agree modalities for implementation. The Court allocated reciprocal compensation: Hungary to compensate Slovakia for damage resulting from Hungary’s suspension and abandonment; Slovakia to compensate Hungary for damage caused by the dam’s putting into operation and maintenance.\n\nPost-judgment proceedings: Slovakia requested an additional judgment in 1998 to determine execution modalities, citing Hungary’s reluctance to implement the 1997 Judgment. Negotiations ensued; Slovakia later requested discontinuance of the additional-judgment proceedings in 2017, and Hungary did not oppose. The Court recorded the discontinuance, noting both Parties reserved the right under the Special Agreement to request an additional judgment in the future.\n\nSignificance: The case addresses treaty termination, state responsibility, lawful countermeasures, state succession, environmental and transboundary water obligations, and the Court’s role in supervising implementation and ordering reparations and good-faith negotiations.",
    "keyPoints": [
      "ICJ found Hungary unlawfully suspended and abandoned treaty obligations in 1989 and was therefore not entitled to do so.",
      "Czechoslovakia/Slovakia was entitled to adopt a provisional solution in 1991 but not to put the barrage into operation from October 1992; Slovakia succeeded to the 1977 Treaty as of 1 Jan 1993.",
      "The Court ordered both States to negotiate in good faith and to take measures to achieve the Treaty’s objectives, allocating reciprocal compensation for damages.",
      "Slovakia sought an additional judgment in 1998 to secure execution; that procedure was discontinued by mutual note in 2017, with both Parties reserving the right to request further Court determination under the Special Agreement.",
      "The case clarifies issues of treaty termination, state responsibility for environmental/transboundary projects, and the duties of successor States."
    ]
  },
  {
    "filename": "Convention on Political Asylum (Montevideo, 1933) [Conference of American States].pdf",
    "shortTitle": "Convention on Political Asylum 1933",
    "type": "other document",
    "shortSummary": "A multilateral convention adopted at Montevideo in 1933 that revises the Havana Convention on asylum by defining limits on diplomatic and other forms of asylum and establishing procedural, ratification, and denunciation rules. It emphasizes the humanitarian character of political asylum while limiting asylum for common criminals and military deserters.",
    "detailedSummary": "The Convention on Political Asylum (Montevideo, 26 December 1933) amends Article 1 of the 1928 Havana Convention and sets rules governing political asylum among American states. It prohibits granting asylum in legations, warships, military camps, or airships to persons accused or convicted of common crimes and to military deserters, and requires surrender of such persons when requested by the local government. It affirms that determination of political delinquency is for the state granting asylum, declares political asylum a humanitarian institution not subject to reciprocity, and notes that states not recognizing asylum domestically may exercise it abroad only as permitted by the receiving state. The Convention provides that withdrawal of a diplomatic agent over asylum disputes does not constitute a rupture of diplomatic relations if replaced, preserves existing international obligations, and sets out ratification, deposit, and notification procedures via the Minister of Foreign Affairs of Uruguay and the Pan American Union. Entry into force is by order of ratification deposits; the treaty remains in force indefinitely but allows denunciation with one year’s notice, and it is open to accession by non-signatory states.",
    "keyPoints": [
      "Prohibits asylum in legations, warships, military camps, or airships for those accused or convicted of common crimes and for military deserters; such persons must be surrendered when requested by local authorities.",
      "Affirms that the state granting asylum determines whether an act is political and treats asylum as a humanitarian, non-reciprocal institution.",
      "Specifies that withdrawal of diplomatic agents over asylum disputes, if replaced, does not amount to breaking diplomatic relations.",
      "Sets ratification, deposit, and notification procedures through Uruguay and the Pan American Union and establishes entry into force by order of ratification deposits.",
      "Allows denunciation with one year’s notice and permits accession by non-signatory states."
    ]
  },
  {
    "filename": "Vienna Convention on Diplomatic Relations, 1961 .pdf",
    "shortTitle": "Vienna Convention on Diplomatic Relations 1961",
    "type": "other document",
    "shortSummary": "A multilateral treaty codifying the rules, privileges, immunities and functions of diplomatic missions and agents to ensure efficient performance of diplomatic functions and friendly relations between states. It establishes inviolability of mission premises, diplomatic immunity, privileges for staff and rules for establishment and conduct of missions.",
    "detailedSummary": "The Vienna Convention on Diplomatic Relations (1961) is an international treaty that standardizes diplomatic intercourse, privileges, immunities and the functions of diplomatic missions. It defines terms (head of mission, diplomatic agent, mission premises, etc.), sets out how diplomatic relations and missions are established and accredited, and governs appointment, notification and acceptance of mission staff. Key provisions include inviolability of mission premises and archives; immunity from jurisdiction for diplomatic agents (with limited civil exceptions); inviolability and protection of diplomatic correspondence and the diplomatic bag; exemptions from taxes, customs duties and certain obligations; rules on freedom of movement and communication; and procedures for declaring persons persona non grata. The Convention also addresses duties of diplomatic agents (respect for host state laws, non-interference), the end of functions and withdrawal, protection of missions in cases of conflict or severed relations, and transit protections through third States. Ratification, accession and entry-into-force procedures, non-discrimination in application, and registration with the UN Secretary-General are provided. The Convention aims to ensure that privileges and immunities serve the effective performance of diplomatic functions rather than personal benefit.",
    "keyPoints": [
      "Defines legal status, functions and categories of diplomatic agents and mission staff and premises.",
      "Establishes inviolability of mission premises, archives, official correspondence and the diplomatic bag, and protection obligations for the receiving State.",
      "Provides immunity from criminal, civil and administrative jurisdiction for diplomatic agents with limited exceptions and requires waiver by the sending State for prosecution.",
      "Grants tax, customs and entry exemptions, freedom of movement and communication, and protections for diplomatic couriers and transit through third States.",
      "Sets procedures for agrément, persona non grata declarations, termination of functions, protection when relations are broken and rules for accession and entry into force."
    ]
  },
  {
    "filename": "Convention on International Civil Aviation (Chicago Convention).pdf",
    "shortTitle": "Convention on International Civil Aviation, 1944",
    "type": "other document",
    "shortSummary": "Multilateral treaty signed at Chicago on 7 December 1944 establishing rules for international civil aviation and creating the International Civil Aviation Organization (ICAO). It sets state sovereignty over airspace and defines standards, procedures, rights and obligations for air navigation and international air transport.",
    "detailedSummary": "The Convention on International Civil Aviation (Chicago Convention) of 7 December 1944 establishes fundamental principles and a regulatory framework for international civil aviation. It recognizes each State's complete and exclusive sovereignty over the airspace above its territory, distinguishes civil from state aircraft, and sets rules for flights across and into territories of contracting States (including rights for non-scheduled flights and requirements for scheduled services and cabotage). The Convention requires uniform application of certain laws and regulations, prescribes documentation, licensing, airworthiness and operational standards, and contains provisions on search and rescue, accident investigation, public health measures, customs and immigration facilitation, and protection from seizure on patent claims. It mandates cooperation to develop uniform international standards and recommended practices through the International Civil Aviation Organization (ICAO), which the treaty creates and empowers (Assembly, Council, Air Navigation Commission, Secretary General) to adopt Annexes, coordinate technical standards, collect information, and assist States in improving air navigation facilities. The Convention also establishes procedures for disputes, amendments, ratification and adherence, financing, joint operating arrangements, and special provisions for wartime or emergency conditions. It came into force after ratification by the required number of States and includes schedules of early signatories and parties.",
    "keyPoints": [
      "Establishes State sovereignty over airspace and distinguishes civil from state aircraft with rules for overflight, landing, and prohibited areas.",
      "Creates the International Civil Aviation Organization (ICAO) to adopt international standards and recommended practices (Annexes) and to coordinate global civil aviation matters.",
      "Sets uniform requirements for aircraft nationality, registration, airworthiness, crew licensing, documentation, and operational procedures.",
      "Provides rules on customs/immigration facilitation, free temporary admission of aircraft supplies, search and rescue, and investigation of accidents.",
      "Defines dispute-settlement mechanisms, amendment and ratification procedures, and financial/organizational arrangements for implementation and technical assistance."
    ]
  },
  {
    "filename": "Charter of the Organization of American States.pdf",
    "shortTitle": "Charter of the Organization of American States 1948",
    "type": "other document",
    "shortSummary": "Founding constitutional treaty that establishes the Organization of American States (OAS), sets out its purposes, principles, membership rules, organs, and functioning. It promotes peace, representative democracy, collective security, integral development, and respect for human rights among American states.",
    "detailedSummary": "The Charter of the Organization of American States (1948, amended several times) creates the OAS as the regional agency of the Americas within the United Nations framework and defines its scope, powers, and limits. It proclaims the Organization's essential purposes: to strengthen continental peace and security; promote and consolidate representative democracy; facilitate peaceful settlement of disputes and collective action against aggression; and foster economic, social, cultural, scientific, and technological development, including eradication of extreme poverty. The Charter codifies core principles such as respect for sovereignty, nonintervention, rule of law, good faith, equality of states, prohibition of territorial conquest, and the primacy of international law. It establishes membership criteria, procedures for suspension of states whose democratically constituted governments are overthrown, and modalities for admission. The document details fundamental rights and duties of states, prohibits intervention and coercive economic or political measures, and affirms peaceful dispute settlement mechanisms and collective-security arrangements governed by special treaties. Integral development (economic and social aims, education, health, labor rights, social security, regional integration) is treated as essential to peace and democracy, with many specific development goals and principles. The Charter creates the Organization's organs and bodies — notably the General Assembly, Meeting of Consultation of Ministers of Foreign Affairs, Permanent Council, Inter-American Council for Integral Development, Inter-American Juridical Committee, Inter-American Commission on Human Rights, General Secretariat (Secretary General and Assistant Secretary General), Specialized Conferences, and Specialized Organizations — and prescribes their composition, functions, and procedures. It sets out administrative rules for the General Secretariat, privileges and immunities, staff selection principles, budgetary procedures, and geographic representation. Provisions on relations with the United Nations, ratification, entry into force, amendment, denunciation, and transitional measures are also included. The Charter emphasizes cooperation among member states, technical and financial cooperation for regional integration, and mechanisms to protect and promote human rights pending further conventions.",
    "keyPoints": [
      "Establishes the OAS and its purposes: peace and security, representative democracy, collective security, and integral development.",
      "Affirms principles of sovereignty, nonintervention, equality of states, peaceful settlement of disputes, and prohibition of force or coercion.",
      "Defines membership rules, suspension for overthrow of democratic governments, and admission procedures for new states.",
      "Creates the Organization's organs (General Assembly, Permanent Council, General Secretariat, Inter-American bodies) and delineates their powers and procedures.",
      "Prioritizes integral development (economic, social, educational, cultural, scientific, technological) and human-rights promotion as bases for regional stability and democracy."
    ]
  },
  {
    "filename": "Vienna Convention on Diplomatic Relations.pdf",
    "shortTitle": "Vienna Convention on Diplomatic Relations 1961",
    "type": "other document",
    "shortSummary": "Multilateral treaty codifying rules governing diplomatic relations, privileges, immunities, and the functioning of diplomatic missions between states. It defines status of diplomatic agents, inviolability of mission premises and communications, and procedures for appointment, accreditation and termination.",
    "detailedSummary": "The Vienna Convention on Diplomatic Relations (1961) is a foundational multilateral treaty that establishes the legal framework for diplomatic intercourse and the privileges and immunities of diplomatic missions and their staff. It defines key terms (head of mission, diplomatic agent, mission premises, etc.), sets out functions of missions, and governs establishment and size of missions, accreditation and agrément procedures, and precedence. The Convention guarantees inviolability of mission premises and archives, immunity of diplomatic agents from arrest and most civil/criminal jurisdiction (with specified exceptions), protection of diplomatic communications and the diplomatic bag, tax and customs exemptions, and freedom of movement subject to national security limits. It prescribes duties of diplomatic agents (respect host laws, non-interference), procedures for declaring persons persona non grata, rules for waiver of immunity, and arrangements for termination of functions, transit through third States, and protection of missions when relations break down. The treaty also addresses privileges for family members, administrative/technical and service staff, and rules on entry into force, signature, ratification and accession. The Convention emphasizes that privileges and immunities are granted to ensure efficient performance of diplomatic functions and are not personal benefits.",
    "keyPoints": [
      "Defines diplomatic actors, mission premises, and core functions of diplomatic missions (representation, protection of interests, negotiation, reporting, and promotion of relations).",
      "Establishes inviolability of mission premises and archives, and protection of diplomatic communications and the diplomatic bag; restricts host State officials from entering mission premises without consent.",
      "Grants diplomatic agents broad immunity from criminal and most civil jurisdiction, personal inviolability (no arrest/detention), and various tax and customs exemptions, while specifying limited exceptions and procedures for waiver.",
      "Gives host States the right to refuse agrément or declare persons persona non grata without explanation, and sets rules for accreditation, precedence, and termination of diplomatic functions.",
      "Imposes duties on diplomatic agents to respect host State laws and not interfere in internal affairs; includes provisions for transit through third States, protection when relations are severed, and non-discrimination among States in application."
    ]
  },
  {
    "filename": "Convention Against Torture.pdf",
    "shortTitle": "Convention against Torture and Other Cruel, Inhuman or Degrading Treatment or Punishment (1984)",
    "type": "other document",
    "shortSummary": "A United Nations treaty adopted in 1984 that defines torture, obliges States to prevent and criminalize it, prohibits refoulement to torture, and establishes a monitoring Committee against Torture. It sets procedural, jurisdictional and remedial measures for victims and mechanisms for international cooperation and reporting.",
    "detailedSummary": "The Convention against Torture (adopted 1984, entry into force 1987) defines ‘‘torture’’ and requires States Parties to take effective legislative, administrative, judicial and other measures to prevent torture and other cruel, inhuman or degrading treatment or punishment in any territory under their jurisdiction. It prohibits torture under all circumstances, disallows orders from superiors as justification, and bars expulsion, return or extradition where there are substantial grounds to believe a person would face torture (non-refoulement). States must criminalize torture, establish jurisdiction in specified cases, cooperate in arrest and prosecution or extradition, and provide mutual legal assistance. The Convention mandates prompt, impartial investigations, guarantees complainants the right to examine allegations, and requires redress, compensation and rehabilitation for victims; statements obtained by torture are inadmissible except against an accused torturer. It also obliges training, review of interrogation and detention procedures, and protection for complainants and witnesses. The treaty establishes the Committee against Torture to monitor implementation through periodic reports, confidential inquiries into systemic torture, and (where States opt in) consideration of inter-state and individual communications. Provisions cover election and functioning of the Committee, reporting cycles, confidentiality measures for inquiries, and procedures for amendments, reservations, denunciation, and dispute settlement.",
    "keyPoints": [
      "Defines ‘‘torture’’ and requires States to prevent, criminalize and punish it; no exceptional circumstances or superior orders justify torture.",
      "Prohibits refoulement: States must not expel, return or extradite persons to states where they risk torture.",
      "Obliges prompt, impartial investigation of torture allegations, protection for complainants and witnesses, and guarantees victims effective remedy, compensation and rehabilitation.",
      "Establishes the Committee against Torture to review periodic state reports, conduct confidential inquiries into systematic torture, and—if States declare acceptance—consider inter-state and individual complaints.",
      "Requires training of officials, review of detention and interrogation practices, international cooperation on extradition and mutual legal assistance, and mechanisms for amendments and dispute settlement."
    ]
  },
  {
    "filename": "Lopez Burgos v. Uruguay (Human Rights Committee, 1981).pdf",
    "shortTitle": "Lopez Burgos v. Uruguay (1981)",
    "type": "other court case",
    "shortSummary": "The Human Rights Committee found that Uruguay violated the International Covenant on Civil and Political Rights by abducting, detaining and subjecting Sergio Euben López Burgos to torture and inhuman treatment, including actions carried out across the Argentine border. Uruguay failed to refute the allegations or show that it investigated the abuses.",
    "detailedSummary": "Sergio Euben López Burgos’s wife submitted a communication to the UN Human Rights Committee alleging that Uruguayan military personnel, with assistance from Argentine agents, kidnapped López Burgos in Argentina, detained him there for two weeks, secretly transported him to Uruguay, and held him in a secret prison for three months. During detention in both countries he was allegedly beaten, given electric shocks, and otherwise subjected to torture and inhuman treatment in violation of Article 7 of the International Covenant on Civil and Political Rights. The complainant provided detailed facts, dates, names of alleged Uruguayan officers, and testimony from former detainees. Uruguay did not refute the substance of the allegations nor produce evidence of an investigation. The Committee also addressed state obligations under Article 2(1) of the Covenant concerning respect for rights of persons within a state’s territory, noting implications for conduct that crosses borders. Based on the available evidence and Uruguay’s lack of rebuttal or investigative steps, the Committee concluded that Uruguay breached its Covenant obligations.",
    "keyPoints": [
      "López Burgos was allegedly abducted in Argentina, detained there, and secretly transferred to Uruguay where he was held and tortured, violating Article 7 of the Covenant.",
      "The complainant provided detailed corroborating evidence (dates, names, former detainee testimony), and Uruguay did not refute the allegations or show an investigation had been undertaken.",
      "The Committee considered state obligations under Article 2(1) regarding protection of rights within a state’s territory and the cross-border nature of the conduct.",
      "The decision found Uruguay responsible for violations of the Covenant due to acts by its agents and the absence of redress or investigation."
    ]
  },
  {
    "filename": "United Nations Convention Against Corruption (Mérida Convention).pdf",
    "shortTitle": "United Nations Convention against Corruption (2004)",
    "type": "other document",
    "shortSummary": "The United Nations Convention against Corruption (2004) is a comprehensive international treaty establishing standards, measures and mechanisms to prevent, criminalize and combat corruption, strengthen international cooperation and facilitate asset recovery. It also provides for technical assistance, information exchange and a Conference of States Parties to monitor implementation.",
    "detailedSummary": "Adopted by the UN General Assembly in 2003 and published in 2004, the Convention sets out a far-reaching legal and policy framework to address corruption in both public and private sectors. It requires States Parties to implement preventive measures (anti‑corruption policies, independent prevention bodies, public-sector transparency, procurement rules, codes of conduct, judiciary safeguards and anti‑money‑laundering regimes), to criminalize key corrupt acts (bribery of national and foreign public officials and officials of international organizations, embezzlement, trading in influence, illicit enrichment, money‑laundering, obstruction of justice and related offences) and to ensure effective law‑enforcement responses (specialized authorities, witness protection, prosecution and sanctioning). The Convention prioritizes international cooperation — extradition, mutual legal assistance, law‑enforcement cooperation, joint investigations and special investigative techniques — and establishes detailed procedures for freezing, seizure, confiscation and the return of proceeds of corruption, with asset recovery declared a fundamental principle. It calls for technical assistance, training and information exchange, encourages measures to involve civil society and the private sector, and creates institutional mechanisms including a Conference of the States Parties and UNODC secretariat support to promote and review implementation.",
    "keyPoints": [
      "Establishes comprehensive preventive frameworks: national anti‑corruption policies, independent prevention bodies, public‑sector transparency, procurement safeguards and anti‑money‑laundering measures.",
      "Requires criminalization of core corrupt acts: bribery (domestic and foreign), embezzlement, money‑laundering and related offences, and provides for sanctions, liability of legal persons and procedural tools for investigations.",
      "Prioritizes international cooperation: detailed rules for extradition, mutual legal assistance, law‑enforcement cooperation, joint investigations and use of special investigative techniques.",
      "Makes asset recovery central: obligations and mechanisms for identification, freezing, confiscation and return of proceeds of corruption, including direct civil recovery and cross‑border enforcement.",
      "Provides for technical assistance, training, information exchange and an institutional review mechanism (Conference of the States Parties with UNODC as secretariat) to support implementation, especially for developing countries."
    ]
  },
  {
    "filename": "Charter of the United Nations.pdf",
    "shortTitle": "United Nations Charter (1945)",
    "type": "other document",
    "shortSummary": "The United Nations Charter is the foundational treaty that established the United Nations in 1945, setting out its purposes, principles, structure, and powers. It defines the UN's main organs, membership rules, procedures for maintaining international peace and security, and provisions for amendment and ratification.",
    "detailedSummary": "Adopted at San Francisco on 26 June 1945, the United Nations Charter creates an international organization dedicated to maintaining international peace and security, promoting human rights, fostering social and economic development, and harmonizing the actions of states. The Charter enumerates the UN's purposes and principles (sovereign equality, peaceful settlement of disputes, prohibition on use of force except in self-defence), establishes principal organs (General Assembly, Security Council, Economic and Social Council, Trusteeship Council, International Court of Justice, and Secretariat), and defines their composition, functions, powers, and voting procedures. It sets out mechanisms for collective security, including Chapters VI–VII procedures for peaceful settlement and enforcement measures, details on regional arrangements, and the International Court of Justice's role. The Charter also addresses trusteeship and decolonization, the international economic and social remit of the UN, staff and Secretariat rules, privileges and immunities, treaty registration, supremacy of Charter obligations over other treaties, and procedures for amendment, signature, and ratification. Subsequent amendments (notably to Security Council and ECOSOC composition and voting) are noted, and the Charter specifies languages, authentication, and entry into force conditions.",
    "keyPoints": [
      "Defines the UN's purposes: maintain international peace and security, develop friendly relations, promote human rights and international cooperation, and serve as a centre for harmonizing state actions.",
      "Establishes principal organs (General Assembly, Security Council, ECOSOC, Trusteeship Council, ICJ, Secretariat) and sets out their composition, functions, and voting rules.",
      "Grants the Security Council primary responsibility for peace and security, including authority to recommend measures, impose non‑military measures, or authorize enforcement action.",
      "Sets membership criteria, rules for suspension/expulsion, and procedures for treaty registration, with Charter obligations prevailing over conflicting treaty commitments.",
      "Provides procedures for amendment, ratification, and entry into force; includes provisions addressing trusteeship, decolonization, and the role of specialized agencies."
    ]
  },
  {
    "filename": "American Treaty on Pacific Settlement (Pact of Bogotá, 1948) [Conference of American States].pdf",
    "shortTitle": "Pact of Bogotá 1948",
    "type": "other document",
    "shortSummary": "Multilateral treaty among American states establishing procedures for peaceful settlement of international disputes, including negotiation, mediation, conciliation, arbitration, and compulsory recourse to the International Court of Justice. It affirms non-use of force and sets institutional mechanisms for commissions, arbitral tribunals, and enforcement procedures.",
    "detailedSummary": "The American Treaty on Pacific Settlement (Pact of Bogotá), signed in Bogotá on April 30, 1948, commits signatory American states to refrain from the threat or use of force and to resolve international controversies by pacific means. It lays out a flexible sequence of dispute-resolution procedures—negotiation, good offices, mediation, investigation and conciliation, judicial settlement before the International Court of Justice (with compulsory jurisdiction among parties), and arbitration—specifying rules and timeframes for each. The treaty establishes procedures for constituting commissions and arbitral tribunals (including use of a permanent panel of conciliators and reference to the Permanent Court of Arbitration), confidentiality and reporting rules for mediators and conciliators, financial arrangements, and representation of parties. It requires suspension of adverse acts while conciliation is pending, allows petition to the ICJ when conciliation fails, and obliges parties to submit to arbitration if the ICJ lacks jurisdiction for reasons other than domestic-jurisdiction, treaty conflicts, or nationals’ protection issues. The Pact prescribes follow-up mechanisms for enforcing judicial or arbitral decisions—first attempting a Meeting of Consultation of Ministers of Foreign Affairs before resorting to the UN Security Council—and provides for advisory opinions, accession, reservations, duration, denunciation, and the supersession of earlier inter-American dispute-settlement instruments. The treaty is registered through the Pan American Union and remains in force indefinitely unless denounced with one year’s notice.",
    "keyPoints": [
      "Affirms prohibition of threat or use of force and requires resort to pacific settlement procedures.",
      "Sets a sequence of dispute-resolution methods: negotiation, good offices/mediation, investigation and conciliation, judicial settlement (ICJ) and arbitration, with detailed rules for commissions and tribunals.",
      "Declares compulsory jurisdiction of the International Court of Justice among parties for juridical disputes while the treaty is in force, and mandates arbitration if the ICJ declines jurisdiction for specified reasons.",
      "Establishes procedural details (permanent panel of conciliators, appointment rules, time limits, confidentiality, financial responsibilities) and publication/reporting rules for outcomes.",
      "Provides enforcement and final provisions: consultation of foreign ministers before UN Security Council recourse, accession/reservations rules, denunciation clause, and repeal of earlier inter-American dispute-settlement treaties upon entry into force."
    ]
  },
  {
    "filename": "Universal Declaration of Human Rights (1948).pdf",
    "shortTitle": "Universal Declaration of Human Rights 1948",
    "type": "other document",
    "shortSummary": "The Universal Declaration of Human Rights (1948) proclaims a comprehensive set of fundamental rights and freedoms to which all human beings are entitled. It establishes principles of equality, dignity, rule of law, and protections across civil, political, economic, social and cultural spheres.",
    "detailedSummary": "Adopted by the United Nations General Assembly in 1948, the Universal Declaration of Human Rights (UDHR) sets out a universal standard for human dignity and basic rights. Its preamble situates the Declaration as a response to atrocities and a foundation for freedom, justice and peace, and calls for protection of rights by the rule of law and international cooperation. The Declaration contains 30 articles articulating rights including equality before the law; rights to life, liberty, security and due process; prohibitions on slavery, torture, arbitrary arrest and exile; freedoms of thought, religion, expression, assembly and movement; political rights such as participation in government and fair elections; economic and social rights including work, social security, adequate standard of living, education and cultural participation; and responsibilities and permissible limitations to protect the rights of others and public order. Article 30 clarifies that no provision may be used to destroy the rights it affirms. The UDHR functions as a common standard of achievement to guide states, institutions and individuals in promoting and securing human rights worldwide.",
    "keyPoints": [
      "Affirms universal, inalienable rights and equal dignity for all people without discrimination.",
      "Enumerates civil and political rights (e.g., life, liberty, fair trial, freedom of expression, religion, assembly) and protections against slavery, torture and arbitrary detention.",
      "Recognizes economic, social and cultural rights (e.g., work, social security, adequate standard of living, education, participation in cultural life).",
      "Emphasizes rule of law, effective remedies, and the responsibility of states and society to promote and protect rights.",
      "Allows lawful limitations to rights only to protect the rights of others, public order and general welfare, and prohibits using the Declaration to destroy its own rights."
    ]
  },
  {
    "filename": "Statute of the International Court of Justice (Rules of Court reference).pdf",
    "shortTitle": "Statute of the International Court of Justice (1945)",
    "type": "other document",
    "shortSummary": "The Statute establishes the composition, jurisdiction, and procedures of the International Court of Justice as the principal judicial organ of the United Nations. It sets out provisions on election and conduct of judges, contentious and advisory jurisdiction, and procedural rules for cases and opinions.",
    "detailedSummary": "The Statute of the International Court of Justice defines the Court's organization, competence, and procedure. It provides for a body of fifteen independent judges elected by the General Assembly and the Security Council, eligibility and terms of office, rules on disqualification, resignation and replacement, and administrative arrangements including seat, languages, salaries, and immunities. The Statute outlines the Court's jurisdiction in contentious cases (consensual and optional compulsory declarations), its advisory opinion function, and the sources of law the Court must apply (treaties, custom, general principles, and subsidiary means). Procedural provisions govern languages, initiation of cases, written and oral proceedings, provisional measures, evidence, intervention, chambers, judgments (including finality, revision, and separate opinions), and costs. Finally, it prescribes procedures for amendment of the Statute.",
    "keyPoints": [
      "Court composition and elections: 15 independent judges elected by the General Assembly and Security Council for nine-year terms, with rules to ensure representation of principal legal systems.",
      "Jurisdiction: hears cases between states and may render advisory opinions for authorized UN bodies; states may recognize compulsory jurisdiction by declaration.",
      "Procedure: bilingual (English and French), written and oral proceedings, rules for provisional measures, evidence, intervention, and public hearings.",
      "Decision-making and judgments: judgments are final, state-specific, reasoned, and may include separate opinions; judicial decisions and scholarly writings serve as subsidiary means of law.",
      "Amendment: Statute may be amended following UN Charter amendment procedures, and the Court may propose amendments via the Secretary-General."
    ]
  },
  {
    "filename": "Inter-American Convention against Corruption [Organization of American States].pdf",
    "shortTitle": "Inter-American Convention Against Corruption (1996)",
    "type": "other document",
    "shortSummary": "A multilateral OAS treaty adopted in 1996 to prevent, detect, punish and eradicate corruption in the performance of public functions and to promote international cooperation among member states. It sets substantive offenses, preventive measures, mutual legal assistance, extradition, and asset recovery mechanisms.",
    "detailedSummary": "The Inter-American Convention Against Corruption (1996) is a treaty of the Organization of American States aimed at strengthening domestic and regional responses to corruption. It defines key terms (public function, public official, property), establishes the Convention's purposes (prevent, detect, punish, eradicate corruption and facilitate cooperation), and enumerates a broad set of preventive measures states should consider (codes of conduct, enforcement mechanisms, ethics training, asset and income registration, transparent procurement, protection for whistleblowers, oversight bodies, and civil-society participation). The Convention enumerates acts of corruption (solicitation/acceptance and offering/granting of bribes, illicit acts or omissions by officials, concealment of proceeds, and participation in such offenses) and invites states to criminalize transnational bribery and illicit enrichment, providing rules for notification when they do so. It addresses jurisdictional bases, extradition and mutual legal assistance (including identification, tracing, freezing, seizure and forfeiture of proceeds), denies bank secrecy as a basis to refuse assistance, and requires central authorities to make and receive cooperation requests. The treaty preserves non-retroactivity in criminal law, allows reservations that are compatible with its object and purpose, permits additional protocols, and sets entry into force and denunciation procedures. Overall, it promotes harmonization of domestic laws, technical cooperation, and practical mechanisms for cross-border investigations and asset recovery to combat corruption in the Hemisphere.",
    "keyPoints": [
      "Requires states to adopt preventive measures: codes of conduct, oversight, asset/income registration, procurement transparency, and whistleblower protection.",
      "Defines and obligates criminalization/cooperation for bribery (domestic and transnational), illicit enrichment, concealment of proceeds, and related participation.",
      "Establishes mutual legal assistance, extradition obligations, and broad cooperation on asset identification, freezing, seizure and forfeiture, with limitations set by domestic law.",
      "Limits invocation of bank secrecy to refuse assistance and mandates designation of central authorities for direct communication and processing of cooperation requests."
    ]
  },
  {
    "filename": "Convention on Territorial Asylum.pdf",
    "shortTitle": "Convention on Political Asylum (1933)",
    "type": "other document",
    "shortSummary": "Inter-American treaty (signed in Montevideo, 1933) defining rules and limits for political asylum among American states, updating the 1928 Havana provisions. It sets where asylum may not be granted, the responsibilities of asylum-granting states, and procedural rules for ratification, entry into force, denunciation, and accession.",
    "detailedSummary": "The Convention on Political Asylum (Montevideo, 26 December 1933) revises the 1928 Havana rules and establishes inter-American norms on political asylum. Article 1 bars granting asylum in legations, warships, military camps or airships to persons accused of common crimes who have been duly prosecuted or sentenced, and to military deserters, and requires their surrender when requested. Article 2 declares that the determination of political delinquency is for the state granting asylum. Article 3 frames political asylum as humanitarian and not subject to reciprocity, permitting any person regardless of nationality to seek protection while noting limits for states that do not generally recognize asylum. Article 4 provides that a diplomatic agent recalled over asylum disputes shall be replaced and that withdrawal does not automatically mean rupture of diplomatic relations. Article 5 preserves existing international obligations. Articles 6–9 set ratification and deposit procedures (with instruments archived at the Pan American Union via Uruguay), provisions for entry into force in order of ratification, rules for denunciation (one year's notice), and open accession for non-signatory states. The Convention was signed in four languages and remains in force indefinitely until denounced.",
    "keyPoints": [
      "Article 1 prohibits granting asylum in legations, warships, military camps or airships to those accused or convicted of common crimes and to military deserters, with obligation to surrender when requested.",
      "Article 2 assigns to the asylum-granting State the judgment whether an act is political delinquency.",
      "Article 3 treats political asylum as humanitarian and non-reciprocal, allowing persons of any nationality to seek it while recognizing limits for States that do not accept asylum generally.",
      "Articles 6–7 establish ratification, deposit (Pan American Union archives via Uruguay), and entry-into-force procedures; Article 8 allows denunciation with one year’s notice; Article 9 permits accession by non-signatories.",
      "Article 4 ensures that recalling a diplomatic agent over asylum disputes does not necessarily break diplomatic relations."
    ]
  },
  {
    "filename": "Havana Convention on Asylum (1928) [Conference of American States].pdf",
    "shortTitle": "Convention on Asylum (1928)",
    "type": "other document",
    "shortSummary": "Multilateral treaty adopted at the Sixth International Conference of American States (Havana, 1928) setting rules for granting asylum in legations, warships, military camps and aircraft, distinguishing between common-crime and political asylum and establishing procedures and limits. It entered into force on 21 May 1929 and was later modified by the Montevideo (1933) and Caracas (1954) Conventions.",
    "detailedSummary": "The Convention on Asylum (Havana, 1928) defines when and how States of the Americas may grant asylum in diplomatic premises, warships, military camps and aircraft. It prohibits granting asylum in those places to persons accused or convicted of common crimes and to military deserters, requiring their surrender to local authorities or extradition in accordance with existing treaties and domestic law. By contrast, asylum for political offenders is permitted only in urgent cases and for the minimal time strictly necessary for the refugee's safety; the asylum-granting authority must promptly notify the receiving State's foreign ministry or local administrative authority. The Convention sets limits and procedures: the host State may require the refugee’s speedy departure, the asylum-granting diplomatic or military authority may require guarantees for safe departure, refugees cannot be landed on national territory or too near it, and may not engage in acts disturbing public order while under asylum. States are not obligated to cover costs incurred by another State granting asylum. The treaty preserves prior international obligations, establishes a ratification and deposit mechanism through the Pan American Union, remained open to adherence by non-signatories, and notes later modifications (Montevideo 1933; Caracas 1954). It records signatures, ratifications and certain reservations (notably the United States’ reservation rejecting recognition of the doctrine of asylum as part of international law) and lists denunciations/withdrawals by some States.",
    "keyPoints": [
      "Common-crime suspects and military deserters may not be granted asylum in legations, warships, military camps or aircraft and must be surrendered or extradited under existing agreements or domestic law.",
      "Political asylum is allowed only in urgent cases and for the strictly necessary period; asylum must be reported immediately to the relevant national authorities and the host State may require the refugee’s prompt removal.",
      "Refugees under asylum must not be landed on or too near national territory, must not commit acts against public peace, and the granting State is not obligated to pay expenses incurred.",
      "The Convention preserves prior treaty obligations, requires ratification with deposit at the Pan American Union, entered into force on 21 May 1929, and was later modified by the Montevideo (1933) and Caracas (1954) Conventions.",
      "Some States entered reservations or later denounced/withdrew (e.g., U.S. reservation rejecting the doctrine of asylum; denunciations/withdrawals by Haiti and the Dominican Republic)."
    ]
  },
  {
    "filename": "1976 International Covenant on Civil and Political Rights (ICCPR).pdf",
    "shortTitle": "International Covenant on Civil and Political Rights 1966",
    "type": "other document",
    "shortSummary": "A multilateral treaty adopted by the UN General Assembly that codifies a broad set of civil and political rights and establishes monitoring and reporting mechanisms. It sets obligations for States Parties to respect, protect and fulfil those rights, with limited derogation clauses and procedures for oversight and interstate complaints.",
    "detailedSummary": "The International Covenant on Civil and Political Rights (ICCPR), adopted in 1966 and entered into force in 1976, is a core United Nations human rights treaty that defines fundamental civil and political rights and binds States Parties to respect and ensure these rights for all individuals under their jurisdiction without discrimination. The Covenant includes rights such as the right to self-determination, life, liberty and security, freedom from torture and slavery, freedom of movement, fair trial guarantees, freedom of thought, conscience, religion and expression, rights of assembly and association, and protections for families, children and minorities. It allows limited derogations in times of public emergency (subject to strict conditions and certain non-derogable rights), prohibits discrimination, and requires States to adopt legislative and other measures to implement the Covenant. The treaty establishes the Human Rights Committee to monitor implementation through periodic State reporting, commentaries and an individual and interstate communications procedure (if a State makes the relevant declaration). It also provides for conciliation procedures between States and mechanisms for elections, terms and functioning of Committee members, reporting timetables, amendment and accession procedures, and provisions on entry into force and depositary functions of the UN Secretary-General.",
    "keyPoints": [
      "Defines a wide range of civil and political rights (e.g., life, liberty, fair trial, freedom from torture, freedom of expression, assembly and religion) and prohibits discrimination.",
      "Requires States Parties to adopt measures (legislative and administrative) to give effect to Covenant rights and to provide effective remedies for violations.",
      "Creates the Human Rights Committee to monitor implementation via State reports and, subject to optional declarations, to consider interstate and individual communications and to facilitate conciliation.",
      "Allows derogation from certain obligations during a formally proclaimed public emergency but lists non-derogable rights and strict procedural limits.",
      "Sets procedures for signature, ratification, accession, entry into force, amendment, and reporting; entry into force occurred after 35 ratifications and the Covenant is deposited with the UN Secretary-General."
    ]
  },
  {
    "filename": "United States Diplomatic and Consular Staff in Tehran (United States v. Iran), ICJ (1980) — Tehran Hostage Case.pdf",
    "shortTitle": "United States Diplomatic and Consular Staff in Tehran (United States v. Iran) (1980)",
    "type": "icj judgement",
    "shortSummary": "The ICJ found that Iran had violated its obligations under international law by failing to protect the US Embassy and its diplomatic and consular staff and ordered immediate release of the hostages and restoration of the premises. The Court held Iran responsible where State organs later endorsed and perpetuated the militants' acts.",
    "detailedSummary": "Following the 4 November 1979 occupation of the U.S. Embassy in Tehran and seizure of diplomatic and consular staff, the United States brought the case to the International Court of Justice. On provisional measures the Court emphasized the inviolability of diplomatic envoys and premises and indicated measures to secure immediate restoration of the Embassy and release of the hostages. In its 24 May 1980 judgment on the merits, the Court found that Iran had violated obligations under bilateral conventions and general international law, that those violations engaged Iranian State responsibility, and that Iran was bound to secure the immediate release of the hostages, restore the Embassy premises, and make reparation. While initial conduct by militants on 4 November could not be directly attributed to the State for lack of definitive information, the Court found that Iranian authorities subsequently endorsed and perpetuated the wrongful acts, transforming them into acts of the State. The Court reached its judgment despite Iran's absence and rejected Iran's arguments that the Court should not entertain the case. The Court did not deliver a separate judgment on reparation because the case was removed from the List on 12 May 1981 following discontinuance.",
    "keyPoints": [
      "ICJ indicated provisional measures to ensure immediate restoration of the U.S. Embassy premises and release of hostages.",
      "Court found Iran breached obligations under treaties and general international law and that those breaches engaged State responsibility.",
      "Although initial militant actions were not conclusively attributable to Iran, subsequent endorsement and perpetuation by Iranian organs rendered the acts attributable to the State.",
      "Judgment was given in Iran's absence after rejecting Iran's objections to the Court's jurisdiction and admissibility.",
      "No separate judgment on reparations was issued because the case was discontinued and removed from the Court's list in May 1981."
    ]
  },
  {
    "filename": "Nicaragua v. United States (Military and Paramilitary Activities in and against Nicaragua, 1986).pdf",
    "shortTitle": "Nicaragua v. United States (1986)",
    "type": "icj judgement",
    "shortSummary": "The International Court of Justice found that the United States violated customary international law and a 1956 treaty by supporting military and paramilitary activities against Nicaragua, ordered it to cease such acts and to make reparation, and later the reparation phase was not completed because Nicaragua discontinued proceedings. The Court also confirmed its jurisdiction and the admissibility of Nicaragua’s application.",
    "detailedSummary": "Nicaragua filed an application in April 1984 alleging U.S. responsibility for military and paramilitary activities in and against Nicaragua and sought provisional measures; the Court ordered immediate cessation of actions restricting Nicaraguan port access, including mine-laying. After determining in November 1984 that it had jurisdiction and that the application was admissible (relying on interwar and 1946 declarations), proceedings on the merits continued despite the United States’ decision in January 1985 not to participate. In its 27 June 1986 Judgment the Court rejected the U.S. claim of collective self‑defence, found that the United States violated customary international law by intervening in Nicaragua’s affairs, using force, infringing sovereignty, and interrupting peaceful maritime commerce, and also breached obligations under the 1956 Treaty of Friendship, Commerce and Navigation. The Court ordered the United States to cease acts breaching its obligations and to make reparation for injury caused, leaving the amount and form of reparation to be determined in subsequent proceedings if the Parties could not agree. Nicaragua submitted its Memorial on reparation in 1988 while the United States continued to abstain; in September 1991 Nicaragua informed the Court it did not wish to continue the proceedings and the case was removed from the Court’s List by presidential order.",
    "keyPoints": [
      "ICJ confirmed jurisdiction and admissibility of Nicaragua’s application (Nov 1984).",
      "Court found the United States violated customary international law (non‑intervention, prohibition on use of force, respect for sovereignty) and obligations under the 1956 Treaty (Jun 1986).",
      "Rejected U.S. justification of collective self‑defence for its actions.",
      "Ordered the U.S. to cease breaches immediately and to make reparation; amount/form of reparation to be fixed later if parties could not agree.",
      "Reparation phase was not completed: Nicaragua discontinued proceedings in 1991 and the case was removed from the Court’s List."
    ]
  },
  {
    "filename": "Convention on Diplomatic Asylum (Caracas Convention, 1954).pdf",
    "shortTitle": "Convention on Diplomatic Asylum, 1954",
    "type": "other document",
    "shortSummary": "Multilateral treaty adopted at Caracas on 28 March 1954 establishing rules for diplomatic asylum in OAS member states, including conditions for granting asylum, urgent cases, safe‑conduct for departure, and transit protections. It sets limits on who may receive asylum, procedural duties of the asylum‑granting mission and territorial State, and provisions on entry into force and denunciation.",
    "detailedSummary": "The Convention on Diplomatic Asylum (Caracas, 28 March 1954) is a multilateral treaty among Member States of the Organization of American States that defines rights and obligations relating to diplomatic asylum. It recognizes each State's right to grant asylum but does not obligate any State to do so; asylum must be granted only in urgent cases and only for the time strictly necessary to permit safe departure. The Convention limits asylum eligibility (excluding persons charged with or convicted of common crimes, unserved sentences, and most military deserters unless acts are clearly political) and places the determination of the political nature of acts with the asylum‑granting State. It requires the asylum‑granting official to notify territorial authorities, to consider information provided by them, and to seek safe‑conduct and guarantees for the asylee's departure; transit through third parties that are Parties is permitted on presentation of a diplomatic safe‑conduct. The treaty forbids asylees from engaging in acts against public order or intervening in internal politics, forbids reciprocity limitations (protection regardless of nationality), and contains provisions on withdrawal, transfer, and responsibilities for expenses and preventive surveillance. The instrument designates the Pan American Union as depositary, details ratification/entry into force procedures, and allows denunciation with one year’s notice. Several States entered reservations on specific articles when signing or ratifying.",
    "keyPoints": [
      "Affirms each State’s right to grant diplomatic asylum but does not impose an obligation to do so; asylum is allowed only in urgent cases and for the strictly necessary time to secure safe departure.",
      "Limits asylum eligibility: excludes persons accused/convicted of common crimes or unserved sentences and most military deserters, unless the acts are clearly political in nature.",
      "Requires prompt notification to territorial authorities, consideration of their information, and obtaining a safe‑conduct and guarantees for the asylee’s departure; permits transit through Party States on presentation of a diplomatic safe‑conduct.",
      "Prohibits asylees from engaging in activities against public peace or internal politics; provides rules for transfer, surrender in case of rupture of relations, and allocation of costs and limited preventive surveillance.",
      "Sets procedural provisions for ratification, entry into force, deposit with the Pan American Union, allows denunciation with one year’s notice, and records various reservations by States."
    ]
  },
  {
    "filename": "1951 Refugee Convention.pdf",
    "shortTitle": "Convention Relating to the Status of Refugees (1951)",
    "type": "other document",
    "shortSummary": "The 1951 Convention Relating to the Status of Refugees (with the 1967 Protocol) defines who is a refugee and sets minimum international rights, protections and State obligations for refugees. It establishes core principles — notably non-discrimination, non-penalization for illegal entry and the prohibition of refoulement — and assigns UNHCR a supervisory role.",
    "detailedSummary": "This UN instrument (adopted 1951; Protocol adopted 1967) provides the primary international legal framework for refugee protection. Article 1 gives a single definition of \"refugee\": a person who, owing to a well-founded fear of persecution for reasons of race, religion, nationality, membership of a particular social group or political opinion, is outside their country of nationality and is unable or unwilling to avail themselves of that country's protection. The Convention codifies fundamental principles: non-discrimination in application, non-penalization for unlawful entry when seeking asylum, and the absolute prohibition of expulsion or return (non-refoulement) to territories where life or freedom would be threatened. It lists a broad set of rights and minimum standards — access to courts, primary education, employment (wage-earning, self-employment, liberal professions), housing, public relief, social security, identity and travel documents (refugee travel document) — and administrative measures (identity papers, freedom of movement subject to general alien regulations). The Convention also sets out exceptions and exclusions (e.g., persons who committed serious crimes, those receiving protection from other UN agencies, or those enjoying rights equivalent to nationals in the country of asylum). The 1967 Protocol removes the Convention's original temporal and (in most cases) geographic limits, extending the substantive protections to refugees irrespective of when or where events causing flight occurred. States are required to cooperate with and supply information to the Office of the UN High Commissioner for Refugees (UNHCR), which has a supervisory role. The instrument includes procedural provisions on signature, accession, reservations, dispute settlement (ICJ), territorial/federal application and transitional measures, as well as a Schedule specifying the form and use of refugee travel documents.",
    "keyPoints": [
      "Definition and scope: establishes a single legal definition of \"refugee\" focused on well-founded fear of persecution for specified grounds.",
      "Core principles: non-discrimination, non-penalization for illegal entry when seeking asylum, and the absolute prohibition of refoulement.",
      "Rights and minimum standards: sets out rights to education, work, social security, access to courts, identity and travel documents, and freedom of movement (subject to general conditions).",
      "Exclusions and limits: excludes persons guilty of serious crimes or those under protection of other UN agencies; allows limited security-related measures and reservations by States.",
      "1967 Protocol & UNHCR role: the Protocol removed temporal/geographic limits to give universal coverage, and States must cooperate with UNHCR in supervising application of the instruments."
    ]
  },
  {
    "filename": "Democratic Republic of the Congo v. Uganda (2005).pdf",
    "shortTitle": "Democratic Republic of the Congo v. Uganda (2005)",
    "type": "icj judgement",
    "shortSummary": "The International Court of Justice found that Uganda committed an unlawful use of force, acts of occupation, human rights and humanitarian law violations, and responsibility for exploitation and looting by its forces in the DRC, and later ordered reparations. The Court dismissed Uganda’s main counter‑claim alleging DRC support for anti‑Ugandan rebels but upheld claims concerning attacks on Ugandan diplomatic premises.",
    "detailedSummary": "The DRC filed proceedings in 1999 against several States and proceeded against Uganda in the case concerning Armed Activities on the Territory of the Congo. The Court found that from August 1998 Uganda’s military presence in the DRC was not consented to (apart from a narrow border exception) and that Uganda could not validly invoke self‑defence. The Court characterized Uganda’s intervention as a grave violation of the prohibition on use of force, and also found Uganda responsible for extending military, logistic and economic support to irregular forces, breaching non‑intervention. The Court concluded Uganda was the occupying power in parts of the DRC (notably Ituri) and failed in its obligations under the Hague Regulations to restore public order and safety; it found credible evidence that UPDF personnel committed violations of international humanitarian and human rights law attributable to Uganda. The Court found UPDF officers and soldiers were involved in looting and exploitation of natural resources, making Uganda responsible for those acts, but did not find sufficient evidence of a Ugandan governmental policy to exploit DRC resources or that the intervention was conducted to obtain access to resources. Uganda’s counter‑claim that the DRC supported anti‑Ugandan rebels was rejected for lack of proof; however, the Court found the DRC responsible for breaches of the Vienna Convention and related rules regarding attacks and mistreatment of Ugandan diplomatic personnel and property. The Court reserved reparations initially; after negotiations failed, it appointed experts and, in a 2022 reparations judgment, awarded US$325,000,000 (US$225,000,000 for persons, US$40,000,000 for property, US$60,000,000 for natural resources) payable in five annual instalments with 6% post‑judgment interest on overdue amounts.",
    "keyPoints": [
      "ICJ found Uganda’s military intervention in the DRC (from Aug 1998) unlawful and not justified by self‑defence, amounting to a grave violation of the UN Charter’s prohibition on use of force.",
      "Uganda was held responsible for occupation obligations, human rights and humanitarian law violations by UPDF forces, and for support to irregular armed groups operating in the DRC.",
      "The Court concluded UPDF personnel engaged in looting and exploitation of DRC natural resources, making Uganda responsible for those acts, but did not find proof of an official Ugandan policy to exploit resources.",
      "Uganda’s counter‑claim alleging DRC support to anti‑Ugandan rebels was dismissed; the DRC was found responsible for breaches of diplomatic protections regarding attacks and mistreatment of Ugandan diplomats and property.",
      "After failed negotiations, the Court awarded reparations (total US$325,000,000) in a 2022 judgment, payable in five annual instalments with 6% interest on late payments."
    ]
  },
  {
    "filename": "Alleged Violations of Sovereign Rights and Maritime Spaces (Nicaragua v. Colombia, 2022).pdf",
    "shortTitle": "Alleged Violations of Sovereign Rights and Maritime Spaces (Nicaragua v. Colombia, 2022)",
    "type": "icj judgement",
    "shortSummary": "Nicaragua brought proceedings alleging that Colombia violated its sovereign rights and maritime zones as determined in the Court's 2012 judgment and threatened force to implement those violations. On 21 April 2022, the International Court of Justice found that Colombia had violated Nicaragua's sovereign rights and jurisdiction in Nicaragua's exclusive economic zone.",
    "detailedSummary": "Nicaragua filed an application in November 2013 alleging Colombia breached Nicaragua’s sovereign rights and maritime zones established by the ICJ’s 19 November 2012 judgment and threatened to use force to implement those breaches. Nicaragua relied on Article XXXI of the Pact of Bogotá (and alternatively the Court’s inherent power) for jurisdiction. Colombia raised preliminary objections in December 2014; the Court rejected those objections in March 2016, finding it had jurisdiction under Article XXXI to adjudicate the dispute concerning the maritime zones declared to appertain to Nicaragua. Colombia filed a Counter-Memorial in November 2016 advancing four counter-claims (duties of due diligence re: marine environment and inhabitants’ rights, artisanal fishing rights, and invalidity/effects of Nicaragua’s Decree No. 33-2013). In November 2017 the Court found two counter-claims inadmissible and admitted two (the artisanal fishing claim and the challenge to Decree No. 33-2013) into the proceedings. Public hearings on the merits were held in hybrid format from 20 September to 1 October 2021. In its 21 April 2022 Judgment on the merits, the Court concluded that Colombia had violated Nicaragua’s sovereign rights and jurisdiction in Nicaragua’s exclusive economic zone.",
    "keyPoints": [
      "Nicaragua instituted proceedings (2013) claiming Colombia violated rights and maritime zones awarded to Nicaragua in the Court’s 2012 judgment and threatened force.",
      "ICJ confirmed jurisdiction under Article XXXI of the Pact of Bogotá (Judgment on preliminary objections, 2016).",
      "Colombia lodged four counter-claims; two were admitted into the proceedings (artisanal fishing rights and challenge to Decree No. 33-2013).",
      "Public merits hearings were held in Sept–Oct 2021.",
      "ICJ Judgment (21 April 2022) found Colombia had violated Nicaragua’s sovereign rights and jurisdiction in Nicaragua’s exclusive economic zone."
    ]
  },
  {
    "filename": "Asylum (Colombia v. Peru) — Asylum Case (ICJ, 1950).pdf",
    "shortTitle": "Asylum (Colombia v. Peru) — Asylum Case (1950)",
    "type": "icj judgement",
    "shortSummary": "The ICJ addressed whether Colombia could unilaterally determine that a person granted diplomatic asylum had committed a political offence, and whether Peru was obliged to guarantee the asylum seeker safe passage out of its territory. The Court rejected both contentions but found Peru had not proved the asylum-seeker was a common criminal and upheld Peru's counter-claim that Colombia violated the Havana Convention.",
    "detailedSummary": "The dispute arose after Colombia granted diplomatic asylum in its Lima embassy on 3 January 1949 to Victor Raúl Haya de la Torre, a Peruvian national accused of instigating military rebellion. Peru and Colombia submitted questions to the ICJ concerning: (1) whether, under the 1928 Havana Convention on Asylum, the asylum-granting State could unilaterally determine that the offence was political (binding the territorial State), and (2) whether the territorial State was obligated to provide guarantees enabling the refugee to leave safely. In its 20 November 1950 Judgment, the Court held that Colombia could not unilaterally qualify the offence in a manner binding on Peru, and that Peru was not bound to provide the requested guarantees for safe departure. However, the Court also found that Peru had failed to prove Haya de la Torre was a common criminal. Finally, the Court upheld Peru's counter-claim that Colombia had acted in violation of the Havana Convention by granting asylum in the circumstances.",
    "keyPoints": [
      "ICJ ruled that the asylum-granting State cannot unilaterally classify an offence as political in a way binding on the territorial State.",
      "The territorial State is not automatically obliged to provide guarantees for the asylum-seeker's safe departure.",
      "Peru did not prove the refugee was a common criminal.",
      "Court found Colombia violated the Havana Convention by granting asylum in the case's circumstances."
    ]
  },
  {
    "filename": "Rainbow Warrior Arbitration (New Zealand v. France, 1990).pdf",
    "shortTitle": "Rainbow Warrior (New Zealand v. France) 1990",
    "type": "other court case",
    "shortSummary": "An arbitration tribunal (France–New Zealand, 1990) found that France breached its 1986 agreement by removing and failing to return two French agents (Mafart and Prieur) from the island of Hao, though some evacuations raised issues of distress. The Tribunal held breaches occurred, declined New Zealand’s request to order the agents’ return because the obligation had expired, and recommended a US$2 million fund for reconciliation.",
    "detailedSummary": "Background: In 1985 French agents sabotaged and sank Greenpeace’s ship Rainbow Warrior in Auckland, killing a crew member. Two agents (Mafart and Prieur) were arrested in New Zealand, pleaded guilty and were sentenced. Following mediation by the UN Secretary‑General, France agreed (by exchange of letters on 9 July 1986) to pay compensation and to transfer the agents to the French military facility on Hao for not less than three years, with removal only by mutual consent. After medical and family developments, France evacuated both agents without New Zealand’s consent and did not return them to Hao. New Zealand invoked the arbitration clause of the 1986 Agreement; a Supplementary Agreement of 14 February 1989 established the tribunal. Applicable law and issues: The Tribunal applied the 1986 Agreements and customary international law, including the Vienna Convention rules and the law of State responsibility. It considered whether France’s conduct could be justified by force majeure, distress, or necessity. Findings: - Force majeure did not apply because compliance was not rendered impossible, only more difficult. - Distress (a choice to depart from an international obligation to avoid a serious threat to life/physical integrity) could apply if (i) exceptional and urgent circumstances existed and were demonstrable to the other Party, (ii) the original situation was promptly re-established once the emergency passed, and (iii) there was a good‑faith attempt to obtain consent. Application to Mafart: By majority (2–1) the Tribunal found Mafart’s initial evacuation in December 1987 was not wrongful because he required treatment unavailable on Hao; the dissent argued France should have facilitated New Zealand’s medical assessment. Unanimously the Tribunal found France breached the Agreement by failing to return Mafart to Hao after 12 February 1988 when he had recovered. Application to Prieur: Unanimously the Tribunal found France materially breached the Agreement by (a) not acting in good faith to secure New Zealand’s consent to her repatriation, (b) removing her from Hao, and (c) failing to return her to Hao; French domestic law did not excuse non‑performance of international obligations. Continuation and remedy: By majority (2–1) the Tribunal held that France’s obligations under the First Agreement expired on 22 July 1989 (three years after handover), so New Zealand’s request for an order to return the agents was rejected as the obligation had ceased; the dissent argued the three years should be continuous or aggregated and that the Tribunal’s date conclusion was unconvincing. Damages and satisfaction: The Tribunal unanimously recognized that non‑material (moral, political, legal) damage is compensable, but New Zealand had not sought monetary compensation; a public declaration of France’s breaches constituted appropriate satisfaction. Reconciliation recommendation: Unanimously the Tribunal recommended France and New Zealand establish a fund to promote friendly relations, with an initial French contribution of US$2 million. Separate/dissenting views: Sir Kenneth Keith dissented on several issues (notably on whether Mafart’s evacuation was justified and on the legal effect/duration of the three‑year obligation).",
    "keyPoints": [
      "Tribunal found France breached the 1986 Hao Agreement by removing and failing to return both agents (unanimous for Prieur; mixed for Mafart).",
      "Force majeure did not apply; distress can excuse conduct only under strict conditions (exceptional urgency, restoration of original situation, good‑faith attempt to obtain consent).",
      "Majority held the Agreement’s obligations ended 22 July 1989 so ordering return was no longer appropriate; a dissent argued the three‑year period required continuous or aggregated presence.",
      "Non‑material damage was recognized but New Zealand did not seek monetary compensation; public condemnation was deemed appropriate satisfaction.",
      "Tribunal recommended a reconciliation fund with an initial French contribution of US$2 million."
    ]
  }
]
